README.org
#+TITLE: Emacs Configuration
#+AUTHOR: Toby Slight
#+EMAIL: tslight@pm.me
#+PROPERTY: header-args:emacs-lisp :lexical t
#+PROPERTY: header-args+ :cache yes :comments yes :mkdirp yes :results silent
#+PROPERTY: header-args+ :tangle (expand-file-name "init.el" user-emacs-directory)
#+PROPERTY: header-args+ :tangle-mode (identity #o644)
#+OPTIONS: broken-links:t toc:t num:nil
#+STARTUP: overview
#+EXPORT_FILE_NAME: index
#+SETUPFILE: ./theme-readtheorg.setup

A fairly standard [[https://en.wikipedia.org/wiki/Literate_programming][literate]] Emacs configuration using [[https://orgmode.org/][Org mode]]. *Emacs 29+ ONLY*.

To install, evaluate the code block below with ~C-c C-c~ in an Emacs buffer:

#+begin_src emacs-lisp :tangle no
  (org-babel-tangle) (load init-file) (ts-ensure-byte-compiled-init)
#+end_src

This will tangle all the code blocks below into =~/.emacs.d/init.el=, compile
that file and load it, installing a [[*MELPA Packages][plethora of packages]] along the way.

Be sure to back up your current =~/.emacs.d= with something like ~mv
~/.emacs.d{,.bak}~.

* use-package bootstrap

#+begin_src emacs-lisp
  ;; Allow loading from the package cache.
  (setq package-quickstart t)
  ;; Don't write (package-initialize) to my init file!
  (setq package--init-file-ensured t)
  ;; Turn on ahead-of-time native compilation when installing a package.
  (setq package-native-compile t)
  ;; Setup up archives
  (setq package-archives
        '(("melpa" . "https://melpa.org/packages/")
          ("gnu" . "https://elpa.gnu.org/packages/")))
  (setq use-package-enable-imenu-support t
        use-package-always-defer t
        use-package-verbose t)
  (require 'use-package)
#+end_src

* Settings
** Auto-save

#+begin_src emacs-lisp
  (setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
  (setq auto-save-timeout 5)
#+end_src

** Backups

#+begin_src emacs-lisp
  (setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
  (setq backup-by-copying t) ;; copy files, don't rename them.
  (setq delete-old-versions t)
  (setq kept-new-versions 12)
  (setq kept-old-versions 12)
#+end_src

