index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-29 Sun 23:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configuration</title>
<meta name="author" content="Toby Slight" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcf7b6cc">use-package bootstrap</a></li>
<li><a href="#org0940f87">Settings</a>
<ul>
<li><a href="#orgb254242">Auto-save</a></li>
<li><a href="#orgc9f8320">Backups</a></li>
<li><a href="#org5a745be">Bell</a></li>
<li><a href="#org5ac22be">Bookmarks</a></li>
<li><a href="#org776c418">Clipboard</a></li>
<li><a href="#org9d60500">Code Style</a></li>
<li><a href="#org9f694e9">Compilation Scroll Output</a></li>
<li><a href="#orgf61e0d2">Customize settings file</a></li>
<li><a href="#org9a9f655">Delete all on backspace</a></li>
<li><a href="#orgd6e7354">Emacsclient executable</a></li>
<li><a href="#orgf455004">Enable all advanced features</a></li>
<li><a href="#orgfc4bacd">Encoding</a></li>
<li><a href="#org59d76b4">Encryption</a></li>
<li><a href="#org2fb1960">Final newline</a></li>
<li><a href="#orgf9f8e59">History</a></li>
<li><a href="#org6e00539">Initial startup</a></li>
<li><a href="#org36a534a">Kill Ring Duplicates</a></li>
<li><a href="#orgce26edf">More extensive apropos</a></li>
<li><a href="#orgb41af97">More Messages</a></li>
<li><a href="#org9873dba">Mouse yank at point</a></li>
<li><a href="#org3188f39">Native Compilation</a></li>
<li><a href="#orga9d38ea">No lockfiles</a></li>
<li><a href="#org3d5e3d8">Passwords</a></li>
<li><a href="#orgd1240f6">Pop mark on repeat</a></li>
<li><a href="#org05f232c">Prefer newer over compiled</a></li>
<li><a href="#orgedee6c5">Preferred programs</a>
<ul>
<li><a href="#org229a31d">Windows Find</a></li>
</ul>
</li>
<li><a href="#org7eca34a">Repeat on final keystroke</a></li>
<li><a href="#org83f3bcf">Safe Local Variables</a></li>
<li><a href="#org7ca9f37">Scrolling</a></li>
<li><a href="#org20361d6">Sentence End Spaces</a></li>
<li><a href="#org120bcd0">Sort Fold Case</a></li>
<li><a href="#org1367b0d">Truncate Lines</a></li>
<li><a href="#org47a9161">Undo limits</a></li>
<li><a href="#orgd4129d9">Undo save</a></li>
<li><a href="#orgb843db0">Uniquify</a></li>
<li><a href="#org8d24017">User info</a></li>
<li><a href="#org59b013c">Windows</a></li>
<li><a href="#orge7bdae7">Logging stuff</a></li>
<li><a href="#org847bf0f">Yes or no</a></li>
</ul>
</li>
<li><a href="#orge9c76ec">Keybindings</a>
<ul>
<li><a href="#org01225ee">Buffers</a></li>
<li><a href="#org19e100a">Editing</a></li>
<li><a href="#orge503841">Frames</a></li>
<li><a href="#orgfa27dbb">Menubar</a></li>
<li><a href="#org70d37f5">Special mode</a></li>
</ul>
</li>
<li><a href="#org1a1f803">Theme/UI</a>
<ul>
<li><a href="#org0758d28">Disable themes</a></li>
<li><a href="#orgcd42ab4">Maximize on startup</a></li>
<li><a href="#org21cf3d2">Setup Frame for Emacsclient</a></li>
<li><a href="#org61f62d4">Turn off UI elements</a></li>
</ul>
</li>
<li><a href="#org0d2b358">Buffer Functions</a>
<ul>
<li><a href="#org6dedc42">Encoding</a></li>
<li><a href="#org0948389">Indent Buffer</a></li>
<li><a href="#org329dfa2">Kill this buffer</a></li>
<li><a href="#org7225318">Last buffer</a></li>
<li><a href="#org4a396fe">Nuke buffers</a></li>
<li><a href="#org45bd5bf">Remove stuff from a buffer</a></li>
<li><a href="#org7f14012">Save buffers silently</a></li>
</ul>
</li>
<li><a href="#orgafc5e9f">Editing Functions</a>
<ul>
<li><a href="#org43c3349">Aligning symbols</a></li>
<li><a href="#org52643dc">Beginning of line</a></li>
<li><a href="#org02f3555">Change numbers</a></li>
<li><a href="#orge19a8a3">Delete inside delimiters</a></li>
<li><a href="#org9af9f1e">Generate a numbered list</a></li>
<li><a href="#org72cb888">Kill Region</a></li>
<li><a href="#org1e4bd7b">Kill Ring Save</a></li>
<li><a href="#org744c937">Kill Ring Save Whole Buffer</a></li>
<li><a href="#org9ddd0da">Moving lines</a></li>
<li><a href="#orgd7c5d1f">Sort Words</a></li>
<li><a href="#org1256d8d">Surround stuff</a></li>
<li><a href="#orgdba582c">XML pretty print</a></li>
</ul>
</li>
<li><a href="#orgb79490c">File Functions</a>
<ul>
<li><a href="#org93f669f">Delete this file</a></li>
<li><a href="#orgb50cde9">Make backup of current file</a></li>
<li><a href="#org9893e46">Open current file as root</a></li>
<li><a href="#org44f2e6b">Rename file and buffer</a></li>
<li><a href="#org35db538">Yank current file contents to kill ring</a></li>
<li><a href="#org9441b54">Yank current file name to kill ring</a></li>
</ul>
</li>
<li><a href="#org8c81705">Miscellaneous</a>
<ul>
<li><a href="#org29a0b34">Byte compile and load on save</a></li>
<li><a href="#org9263a7a">Ensure init files are byte compiled</a></li>
<li><a href="#org22aef4f">Recompile config</a></li>
<li><a href="#org768f66b">Tangle config</a></li>
</ul>
</li>
<li><a href="#org6edaabc">Window Functions</a>
<ul>
<li><a href="#org7f2d39e">Better scrolling of other windows</a></li>
<li><a href="#org24a8b46">Kill buffer other window</a></li>
<li><a href="#org07725e6">Switch to the previous window</a></li>
<li><a href="#org4b2d127">Toggle focus to last window</a></li>
<li><a href="#orgfe403ef">Toggle maximize window</a></li>
<li><a href="#org43cebee">Toggle vertical -&gt; horizontal splits</a></li>
<li><a href="#org2b4188b">Transpose windows</a></li>
</ul>
</li>
<li><a href="#org6f6733a">Emacs Packages</a>
<ul>
<li><a href="#orgb261b4f">Ansi Color</a></li>
<li><a href="#org91ecd06">Auto-fill</a></li>
<li><a href="#org76b7b5b">Auto-revert</a></li>
<li><a href="#org4843f2a">Column Number</a></li>
<li><a href="#orgd83de62">Dabbrev</a></li>
<li><a href="#org5107cb5">Dired</a>
<ul>
<li><a href="#orgb95f247">Dired AUX</a></li>
<li><a href="#org561ffdb">Find Dired</a></li>
<li><a href="#orgc2346a3">Writeable Dired</a></li>
</ul>
</li>
<li><a href="#org8c5e3a8">Doc View</a></li>
<li><a href="#org1643f9d">Ediff</a></li>
<li><a href="#org0b26a5c">Eglot</a></li>
<li><a href="#orgeb83839">Eldoc</a></li>
<li><a href="#org0be56cc">Electric</a></li>
<li><a href="#orgaf2b0e9">ERC</a></li>
<li><a href="#org1740e75">Eshell</a></li>
<li><a href="#orgf30ddf3">Flymake</a></li>
<li><a href="#orgbd3cdca">Flyspell</a></li>
<li><a href="#org9470d6e">Gnus</a></li>
<li><a href="#org895c8cb">Hide/Show</a></li>
<li><a href="#org77318dc">Highlight line</a></li>
<li><a href="#org16b3925">Hippie Expand</a></li>
<li><a href="#orgbe1491c">Icomplete</a></li>
<li><a href="#org124d9f1">Imenu</a></li>
<li><a href="#org9814664">Line Numbers</a></li>
<li><a href="#org526c0a8">Minibuffer</a>
<ul>
<li><a href="#org498931b">Completion framework settings</a></li>
<li><a href="#org6dc9561">Misc Minibuffer settings</a></li>
<li><a href="#org60f8277">Save history mode</a></li>
</ul>
</li>
<li><a href="#org001d3bf">Occur</a></li>
<li><a href="#orgd1e72f0">Org</a></li>
<li><a href="#org4a8fc14">Pending delete</a></li>
<li><a href="#org02e5d4a">Prettify Symbols</a></li>
<li><a href="#orgd241b26">Project</a></li>
<li><a href="#org47e5cc3">Python</a></li>
<li><a href="#org821bdee">Recentf</a></li>
<li><a href="#orgf2d743f">Saveplace</a></li>
<li><a href="#org1e1f317">Semantic</a></li>
<li><a href="#orgd64c995">Shell Script</a></li>
<li><a href="#org4643a12">Show paren</a></li>
<li><a href="#orgc2d10ff">Size Indication</a></li>
<li><a href="#orgcd77d97">Subword</a></li>
<li><a href="#org6bdae8d">Term</a>
<ul>
<li><a href="#org80ff630">ANSI Term launcher</a></li>
<li><a href="#orgc7ef225">Set term coding system to UTF-8</a></li>
<li><a href="#orgf2559eb">Switch to ANSI Term</a></li>
<li><a href="#orgd28b364">Term Advise</a></li>
</ul>
</li>
<li><a href="#orgd4cbe00">Tramp</a></li>
<li><a href="#orgf6498f3">Version Control</a></li>
<li><a href="#org9808e1a">View mode</a></li>
<li><a href="#org7bd778f">Whitespace</a></li>
<li><a href="#org7bf6432">Windmove</a></li>
<li><a href="#org3721702">Window Divider</a></li>
<li><a href="#org5f98d89">Winner mode</a></li>
</ul>
</li>
<li><a href="#org24cab38">MELPA Packages</a>
<ul>
<li><a href="#orgd660674">Ansible</a></li>
<li><a href="#org683768b">Async</a></li>
<li><a href="#org2da1c9f">Blacken</a></li>
<li><a href="#org4dc9ce0">Default Text Scale</a></li>
<li><a href="#org623530a">Diminish</a></li>
<li><a href="#orge2d23a6">Docker</a></li>
<li><a href="#org8439bb6">Exec path from shell</a></li>
<li><a href="#org72ed58d">Flycheck</a></li>
<li><a href="#orga0f583c">Git</a>
<ul>
<li><a href="#orgcd28249">Gitlab CI</a></li>
<li><a href="#org7f35aff">Git Timemachine</a></li>
<li><a href="#org01b4505">Magit</a></li>
</ul>
</li>
<li><a href="#org45f64f0">Go mode</a></li>
<li><a href="#org0a663a0">Hungry delete</a></li>
<li><a href="#orga2d71d4">JSON</a></li>
<li><a href="#org25f9367">Markdown</a></li>
<li><a href="#org5d2b158">Org</a>
<ul>
<li><a href="#orgdab49d2">htmlize</a></li>
</ul>
</li>
<li><a href="#org08fe245">Powershell</a></li>
<li><a href="#org8f41226">Restclient</a></li>
<li><a href="#org0a28cbc">systemd</a></li>
<li><a href="#org4201457">Terraform</a></li>
<li><a href="#org535df81">Trashed</a></li>
<li><a href="#org06f4d08">Web Mode</a></li>
<li><a href="#orgf85224b">Which Key</a></li>
<li><a href="#orgaa1ef37">Writeable Grep</a></li>
<li><a href="#orgb937cd4">YAML</a></li>
<li><a href="#org990eb2b">Yasnippet</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
A fairly standard <a href="https://en.wikipedia.org/wiki/Literate_programming">literate</a> Emacs configuration using <a href="https://orgmode.org/">Org mode</a>. <b>Emacs 29+ ONLY</b>.
</p>

<p>
To install, evaluate the code block below with <code>C-c C-c</code> in an Emacs buffer:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-tangle) (load init-file) (ts-ensure-byte-compiled-init)
</pre>
</div>

<p>
This will tangle all the code blocks below into <code>~/.emacs.d/init.el</code>, compile
that file and load it, installing a <a href="#org24cab38">plethora of packages</a> along the way.
</p>

<p>
Be sure to back up your current <code>~/.emacs.d</code> with something like <code>mv
~/.emacs.d{,.bak}</code>.
</p>

<div id="outline-container-orgcf7b6cc" class="outline-2">
<h2 id="orgcf7b6cc">use-package bootstrap</h2>
<div class="outline-text-2" id="text-orgcf7b6cc">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #989898;">;; </span><span style="color: #989898;">Allow loading from the package cache.</span>
(<span style="color: #b6a0ff;">setq</span> package-quickstart t)
<span style="color: #989898;">;; </span><span style="color: #989898;">Don't write (package-initialize) to my init file!</span>
(<span style="color: #b6a0ff;">setq</span> package--init-file-ensured t)
<span style="color: #989898;">;; </span><span style="color: #989898;">Turn on ahead-of-time native compilation when installing a package.</span>
(<span style="color: #b6a0ff;">setq</span> package-native-compile t)
<span style="color: #989898;">;; </span><span style="color: #989898;">Setup up archives</span>
(<span style="color: #b6a0ff;">setq</span> package-archives
      '((<span style="color: #79a8ff;">"melpa"</span> . <span style="color: #79a8ff;">"https://melpa.org/packages/"</span>)
        (<span style="color: #79a8ff;">"gnu"</span> . <span style="color: #79a8ff;">"https://elpa.gnu.org/packages/"</span>)))
(<span style="color: #b6a0ff;">setq</span> use-package-enable-imenu-support t
      use-package-always-defer t
      use-package-verbose t)
(<span style="color: #b6a0ff;">require</span> '<span style="color: #00bcff;">use-package</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0940f87" class="outline-2">
<h2 id="org0940f87">Settings</h2>
<div class="outline-text-2" id="text-org0940f87">
</div>
<div id="outline-container-orgb254242" class="outline-3">
<h3 id="orgb254242">Auto-save</h3>
<div class="outline-text-3" id="text-orgb254242">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> auto-save-file-name-transforms '((<span style="color: #79a8ff;">".*"</span> <span style="color: #79a8ff;">"~/.emacs.d/auto-save-list/"</span> t)))
(<span style="color: #b6a0ff;">setq</span> auto-save-timeout 5)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9f8320" class="outline-3">
<h3 id="orgc9f8320">Backups</h3>
<div class="outline-text-3" id="text-orgc9f8320">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> backup-directory-alist '((<span style="color: #79a8ff;">"."</span> . <span style="color: #79a8ff;">"~/.emacs.d/backups"</span>)))
(<span style="color: #b6a0ff;">setq</span> backup-by-copying t) <span style="color: #989898;">;; </span><span style="color: #989898;">copy files, don't rename them.</span>
(<span style="color: #b6a0ff;">setq</span> delete-old-versions t)
(<span style="color: #b6a0ff;">setq</span> kept-new-versions 12)
(<span style="color: #b6a0ff;">setq</span> kept-old-versions 12)
</pre>
</div>
</div>
</div>
