index.html

<div id="outline-container-org5a745be" class="outline-3">
<h3 id="org5a745be">Bell</h3>
<div class="outline-text-3" id="text-org5a745be">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> ring-bell-function 'ignore)
(<span style="color: #b6a0ff;">setq</span> visible-bell 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ac22be" class="outline-3">
<h3 id="org5ac22be">Bookmarks</h3>
<div class="outline-text-3" id="text-org5ac22be">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> bookmark-save-flag 1) <span style="color: #989898;">;; </span><span style="color: #989898;">always save bookmarks to file</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org776c418" class="outline-3">
<h3 id="org776c418">Clipboard</h3>
<div class="outline-text-3" id="text-org776c418">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> select-enable-clipboard t)
<span style="color: #989898;">;; </span><span style="color: #989898;">(setq select-enable-primary t) ;; breaks standard yank meaning that following</span>
<span style="color: #989898;">;; </span><span style="color: #989898;">doesn't work as expected:</span>
(delete-selection-mode t)
(<span style="color: #b6a0ff;">setq</span> x-select-enable-clipboard-manager nil)
(<span style="color: #b6a0ff;">setq</span> save-interprogram-paste-before-kill t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d60500" class="outline-3">
<h3 id="org9d60500">Code Style</h3>
<div class="outline-text-3" id="text-org9d60500">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> c-default-style <span style="color: #79a8ff;">"bsd"</span>)
(<span style="color: #b6a0ff;">setq</span> c-basic-offset 4)
(<span style="color: #b6a0ff;">setq</span> css-indent-offset 2)
(<span style="color: #b6a0ff;">setq</span> js-indent-level 2)

<span style="color: #989898;">;; </span><span style="color: #989898;">If indent-tabs-mode is t, it may use tab, resulting in mixed spaces and tabs</span>
(<span style="color: #b6a0ff;">setq-default</span> indent-tabs-mode nil)

<span style="color: #989898;">;; </span><span style="color: #989898;">make tab key do indent first then completion.</span>
(<span style="color: #b6a0ff;">setq-default</span> tab-always-indent 'complete)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9f694e9" class="outline-3">
<h3 id="org9f694e9">Compilation Scroll Output</h3>
<div class="outline-text-3" id="text-org9f694e9">
<p>
Place point after complilation error
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> compilation-scroll-output 'first-error)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf61e0d2" class="outline-3">
<h3 id="orgf61e0d2">Customize settings file</h3>
<div class="outline-text-3" id="text-orgf61e0d2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> custom-file (expand-file-name <span style="color: #79a8ff;">"custom.el"</span> user-emacs-directory))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a9f655" class="outline-3">
<h3 id="org9a9f655">Delete all on backspace</h3>
<div class="outline-text-3" id="text-org9a9f655">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> backward-delete-char-untabify-method 'all)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6e7354" class="outline-3">
<h3 id="orgd6e7354">Emacsclient executable</h3>
<div class="outline-text-3" id="text-orgd6e7354">
<p>
Only tangled on Windows.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #989898;">;; </span><span style="color: #989898;">https://emacs.stackexchange.com/a/31061</span>
(<span style="color: #b6a0ff;">when</span> (equal system-type 'windows-nt)
  (<span style="color: #b6a0ff;">if</span> (file-readable-p <span style="color: #79a8ff;">"C:/Program Files/Emacs/x86_64/bin/emacsclient.exe"</span>)
      (<span style="color: #b6a0ff;">setq-default</span> with-editor-emacsclient-executable <span style="color: #79a8ff;">"C:/Program Files/Emacs/x86_64/bin/emacsclient.exe"</span>)
    (<span style="color: #b6a0ff;">setq-default</span> with-editor-emacsclient-executable nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf455004" class="outline-3">
<h3 id="orgf455004">Enable all advanced features</h3>
<div class="outline-text-3" id="text-orgf455004">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> disabled-command-function nil) <span style="color: #989898;">;; </span><span style="color: #989898;">enable all "advanced" features</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc4bacd" class="outline-3">
<h3 id="orgfc4bacd">Encoding</h3>
<div class="outline-text-3" id="text-orgfc4bacd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq-default</span> buffer-file-coding-system 'utf-8-unix)
(<span style="color: #b6a0ff;">setq-default</span> default-buffer-file-coding-system 'utf-8-unix)
(<span style="color: #b6a0ff;">setq</span> coding-system-for-read 'utf-8-unix)
(<span style="color: #b6a0ff;">setq</span> coding-system-for-write 'utf-8-unix)
(set-language-environment <span style="color: #79a8ff;">"UTF-8"</span>)
(set-default-coding-systems 'utf-8-unix)
(prefer-coding-system 'utf-8-unix)
</pre>
</div>
</div>
</div>

<div id="outline-container-org59d76b4" class="outline-3">
<h3 id="org59d76b4">Encryption</h3>
<div class="outline-text-3" id="text-org59d76b4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> epa-file-cache-passphrase-for-symmetric-encryption t)
(<span style="color: #b6a0ff;">setf</span> epg-pinentry-mode 'loopback)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2fb1960" class="outline-3">
<h3 id="org2fb1960">Final newline</h3>
<div class="outline-text-3" id="text-org2fb1960">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> require-final-newline t) <span style="color: #989898;">;; </span><span style="color: #989898;">useful for crontab</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9f8e59" class="outline-3">
<h3 id="orgf9f8e59">History</h3>
<div class="outline-text-3" id="text-orgf9f8e59">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> history-length t)
(<span style="color: #b6a0ff;">setq</span> history-delete-duplicates t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e00539" class="outline-3">
<h3 id="org6e00539">Initial startup</h3>
<div class="outline-text-3" id="text-org6e00539">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> inhibit-startup-screen t)
(<span style="color: #b6a0ff;">setq</span> initial-scratch-message nil)
(<span style="color: #b6a0ff;">setq</span> initial-major-mode 'fundamental-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org36a534a" class="outline-3">
<h3 id="org36a534a">Kill Ring Duplicates</h3>
<div class="outline-text-3" id="text-org36a534a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> kill-do-not-save-duplicates t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgce26edf" class="outline-3">
<h3 id="orgce26edf">More extensive apropos</h3>
<div class="outline-text-3" id="text-orgce26edf">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> apropos-do-all t) <span style="color: #989898;">;; </span><span style="color: #989898;">doesn't seem to be documented anywhere..</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb41af97" class="outline-3">
<h3 id="orgb41af97">More Messages</h3>
<div class="outline-text-3" id="text-orgb41af97">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> message-log-max 10000)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9873dba" class="outline-3">
<h3 id="org9873dba">Mouse yank at point</h3>
<div class="outline-text-3" id="text-org9873dba">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> mouse-yank-at-point t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3188f39" class="outline-3">
<h3 id="org3188f39">Native Compilation</h3>
<div class="outline-text-3" id="text-org3188f39">
<p>
Compile <code>elc</code> files as needed, in a deferred/async manner.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">when</span> (fboundp 'native-compile-async)
  (<span style="color: #b6a0ff;">setq</span> comp-deferred-compilation t
        comp-deferred-compilation-black-list '(<span style="color: #79a8ff;">"/mu4e.*\\.el$"</span>)))
</pre>
</div>

<p>
Dealing with system-wide packages:
</p>

<p>
Some packages like for example mu4e are located in /usr and need root
permissions to be compiled, for them you can run
</p>

<div class="org-src-container">
<pre class="src src-shell">sudo emacs -Q -batch -L . -f batch-native-compile *.el
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9d38ea" class="outline-3">
<h3 id="orga9d38ea">No lockfiles</h3>
<div class="outline-text-3" id="text-orga9d38ea">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> create-lockfiles nil) <span style="color: #989898;">;; </span><span style="color: #989898;">prevent creation of .#myfile.ext</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d5e3d8" class="outline-3">
<h3 id="org3d5e3d8">Passwords</h3>
<div class="outline-text-3" id="text-org3d5e3d8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> password-cache t) <span style="color: #989898;">; </span><span style="color: #989898;">enable password caching</span>
(<span style="color: #b6a0ff;">setq</span> password-cache-expiry 3600) <span style="color: #989898;">; </span><span style="color: #989898;">for one hour (time in secs)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd1240f6" class="outline-3">
<h3 id="orgd1240f6">Pop mark on repeat</h3>
<div class="outline-text-3" id="text-orgd1240f6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> set-mark-command-repeat-pop t) <span style="color: #989898;">;; </span><span style="color: #989898;">repeating C-SPC after popping, pops it</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org05f232c" class="outline-3">
<h3 id="org05f232c">Prefer newer over compiled</h3>
<div class="outline-text-3" id="text-org05f232c">
<p>
If init.elc is older, use newer <code>init.el</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> load-prefer-newer t) <span style="color: #989898;">;; </span><span style="color: #989898;">if init.elc is older, use newer init.el</span>
</pre>
</div>
</div>
</div>
