README.org
** Preferred programs

#+begin_src emacs-lisp
  (when (executable-find "rg") (setq grep-program "rg"))
  (when (executable-find "fd") (setq find-program "fd"))
  (when (executable-find "aspell") (setq ispell-program-name "aspell"))
#+end_src

*** Windows Find

First install GnuWin32 binaries from [[http://gnuwin32.sourceforge.net/packages.html][here]].

Or if you want all the GNU tools on your Windows box - use [[https://sourceforge.net/projects/getgnuwin32/files/getgnuwin32/][this]].

#+begin_src emacs-lisp :tangle (if (eq system-type 'windows-nt) init-file "no")
  (setq find-program "C:/Program Files (x86)/GnuWin32/bin/find.exe")
  (setq grep-program "C:/Program Files (x86)/GnuWin32/bin/grep.exe")
  (setq xargs-program "C:/Program Files (x86)/GnuWin32/bin/xargs.exe")
#+end_src

** Repeat on final keystroke

#+begin_src emacs-lisp
  (setq repeat-on-final-keystroke t)
#+end_src

** Safe Local Variables

This variables are added to the end of this file.

#+begin_src emacs-lisp
  (setq safe-local-variable-values
        '((eval setq org-confirm-babel-evaluate 'nil)
          (eval setq early-init (expand-file-name "early-init.el" user-emacs-directory))
          (eval setq init-file (expand-file-name "init.el" user-emacs-directory))
          (eval add-hook 'after-save-hook 'org-html-export-to-html nil t)
          (eval add-hook 'after-save-hook 'org-latex-export-to-pdf nil t)
          (eval add-hook 'after-save-hook 'org-twbs-export-to-pdf nil t)
          (eval add-hook 'after-save-hook 'org-babel-tangle nil t)
          (eval add-hook 'after-save-hook (lambda nil (org-export-to-file 'html "index.html") (org-latex-export-to-pdf)) nil t)
          (after-save-hook : (lambda nil (org-export-to-file 'html "index.html") (org-latex-export-to-pdf)))
          (after-save-hook (lambda nil (org-export-to-file 'html "index.html") (org-latex-export-to-pdf)))
          (org-html-validation-link)))
#+end_src

** Scrolling

#+begin_src emacs-lisp
  (setq scroll-step 4)
  (setq scroll-margin 2)
  (setq scroll-conservatively 4)
  (setq scroll-preserve-screen-position t)
#+end_src

#+begin_quote
When enabled, and if your mouse supports it, you can scroll the display up or
down at pixel resolution, according to what your mouse wheel reports. Unlike
pixel-scroll-mode, this mode scrolls the display pixel-by-pixel, as opposed to
only animating line-by-line scrolls.
#+end_quote

#+begin_src emacs-lisp :tangle (if (version< emacs-version "29") "no" init-file)
  (pixel-scroll-precision-mode)
#+end_src

** Sentence End Spaces

#+begin_src emacs-lisp
  (setq sentence-end-double-space nil)
#+end_src

** Sort Fold Case

#+begin_src emacs-lisp
  (setq sort-fold-case t)
#+end_src

** Truncate Lines

#+begin_src emacs-lisp
  (set-default 'truncate-lines t)
#+end_src

** Undo limits

#+begin_src emacs-lisp
  (setq undo-limit 80000000)
  (setq undo-strong-limit 90000000)
#+end_src

** Undo save

#+begin_src emacs-lisp
  (add-to-list 'desktop-locals-to-save 'buffer-undo-list)
#+end_src

** Uniquify

#+begin_src emacs-lisp
  (setq uniquify-buffer-name-style 'forward)
  (setq uniquify-strip-common-suffix t)
  (setq uniquify-after-kill-buffer-p t)
#+end_src

** User info

#+begin_src emacs-lisp
  (setq user-full-name "Toby Slight")
  (setq user-mail-address "tslight@pm.me")
#+end_src

** Windows

#+begin_src emacs-lisp
  (setq split-width-threshold 200)
  (setq split-height-threshold 100)
  (setq auto-window-vscroll nil)
#+end_src

** Logging stuff

https://www.reddit.com/r/emacs/comments/l42oep/suppress_nativecomp_warnings_buffer/

#+begin_src emacs-lisp
  (setq warning-minimum-level :error)
  (setq warning-suppress-types '((comp) (comp) (comp)))
  (setq comp-async-report-warnings-errors 'nil)
  (setq native-comp-async-report-warnings-errors 'nil)
#+end_src

** Yes or no

#+begin_src emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p) ;; never have to type full word
  (setq confirm-kill-emacs 'y-or-n-p)
#+end_src

* Keybindings
** Buffers

#+begin_src emacs-lisp
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+end_src

** Editing

#+begin_src emacs-lisp
  (global-set-key (kbd "C-z") 'zap-up-to-char) ; suspend is still bound to C-x C-z
  (global-set-key (kbd "M-z") 'zap-to-char)
#+end_src

Remap some default to saner options

#+begin_src emacs-lisp
  (global-set-key (kbd "M-;") 'comment-line)         ; comment-dwim by default
  (global-set-key (kbd "C-M-;") 'comment-dwim)       ; unbound by default
  (global-set-key (kbd "C-x C-;") 'comment-box)      ; comment-line by default
#+end_src

Always do what I mean!

#+begin_src emacs-lisp
  (global-set-key [remap capitalize-word] 'capitalize-dwim)
  (global-set-key [remap downcase-word] 'downcase-dwim)
  (global-set-key [remap upcase-word] 'upcase-dwim)
#+end_src

