index.html

<div id="outline-container-orgedee6c5" class="outline-3">
<h3 id="orgedee6c5">Preferred programs</h3>
<div class="outline-text-3" id="text-orgedee6c5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">when</span> (executable-find <span style="color: #79a8ff;">"rg"</span>) (<span style="color: #b6a0ff;">setq</span> grep-program <span style="color: #79a8ff;">"rg"</span>))
(<span style="color: #b6a0ff;">when</span> (executable-find <span style="color: #79a8ff;">"fd"</span>) (<span style="color: #b6a0ff;">setq</span> find-program <span style="color: #79a8ff;">"fd"</span>))
(<span style="color: #b6a0ff;">when</span> (executable-find <span style="color: #79a8ff;">"aspell"</span>) (<span style="color: #b6a0ff;">setq</span> ispell-program-name <span style="color: #79a8ff;">"aspell"</span>))
</pre>
</div>
</div>

<div id="outline-container-org229a31d" class="outline-4">
<h4 id="org229a31d">Windows Find</h4>
<div class="outline-text-4" id="text-org229a31d">
<p>
First install GnuWin32 binaries from <a href="http://gnuwin32.sourceforge.net/packages.html">here</a>.
</p>

<p>
Or if you want all the GNU tools on your Windows box - use <a href="https://sourceforge.net/projects/getgnuwin32/files/getgnuwin32/">this</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> find-program <span style="color: #79a8ff;">"C:/Program Files (x86)/GnuWin32/bin/find.exe"</span>)
(<span style="color: #b6a0ff;">setq</span> grep-program <span style="color: #79a8ff;">"C:/Program Files (x86)/GnuWin32/bin/grep.exe"</span>)
(<span style="color: #b6a0ff;">setq</span> xargs-program <span style="color: #79a8ff;">"C:/Program Files (x86)/GnuWin32/bin/xargs.exe"</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7eca34a" class="outline-3">
<h3 id="org7eca34a">Repeat on final keystroke</h3>
<div class="outline-text-3" id="text-org7eca34a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> repeat-on-final-keystroke t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org83f3bcf" class="outline-3">
<h3 id="org83f3bcf">Safe Local Variables</h3>
<div class="outline-text-3" id="text-org83f3bcf">
<p>
This variables are added to the end of this file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> safe-local-variable-values
      '((eval setq org-confirm-babel-evaluate 'nil)
        (eval setq early-init (expand-file-name <span style="color: #79a8ff;">"early-init.el"</span> user-emacs-directory))
        (eval setq init-file (expand-file-name <span style="color: #79a8ff;">"init.el"</span> user-emacs-directory))
        (eval add-hook 'after-save-hook 'org-html-export-to-html nil t)
        (eval add-hook 'after-save-hook 'org-latex-export-to-pdf nil t)
        (eval add-hook 'after-save-hook 'org-twbs-export-to-pdf nil t)
        (eval add-hook 'after-save-hook 'org-babel-tangle nil t)
        (eval add-hook 'after-save-hook (<span style="color: #b6a0ff;">lambda</span> nil (org-export-to-file 'html <span style="color: #79a8ff;">"index.html"</span>) (org-latex-export-to-pdf)) nil t)
        (after-save-hook : (<span style="color: #b6a0ff;">lambda</span> nil (org-export-to-file 'html <span style="color: #79a8ff;">"index.html"</span>) (org-latex-export-to-pdf)))
        (after-save-hook (<span style="color: #b6a0ff;">lambda</span> nil (org-export-to-file 'html <span style="color: #79a8ff;">"index.html"</span>) (org-latex-export-to-pdf)))
        (org-html-validation-link)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ca9f37" class="outline-3">
<h3 id="org7ca9f37">Scrolling</h3>
<div class="outline-text-3" id="text-org7ca9f37">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> scroll-step 4)
(<span style="color: #b6a0ff;">setq</span> scroll-margin 2)
(<span style="color: #b6a0ff;">setq</span> scroll-conservatively 4)
(<span style="color: #b6a0ff;">setq</span> scroll-preserve-screen-position t)
</pre>
</div>

<blockquote>
<p>
When enabled, and if your mouse supports it, you can scroll the display up or
down at pixel resolution, according to what your mouse wheel reports. Unlike
pixel-scroll-mode, this mode scrolls the display pixel-by-pixel, as opposed to
only animating line-by-line scrolls.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(pixel-scroll-precision-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org20361d6" class="outline-3">
<h3 id="org20361d6">Sentence End Spaces</h3>
<div class="outline-text-3" id="text-org20361d6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> sentence-end-double-space nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-org120bcd0" class="outline-3">
<h3 id="org120bcd0">Sort Fold Case</h3>
<div class="outline-text-3" id="text-org120bcd0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> sort-fold-case t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1367b0d" class="outline-3">
<h3 id="org1367b0d">Truncate Lines</h3>
<div class="outline-text-3" id="text-org1367b0d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-default 'truncate-lines t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org47a9161" class="outline-3">
<h3 id="org47a9161">Undo limits</h3>
<div class="outline-text-3" id="text-org47a9161">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> undo-limit 80000000)
(<span style="color: #b6a0ff;">setq</span> undo-strong-limit 90000000)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4129d9" class="outline-3">
<h3 id="orgd4129d9">Undo save</h3>
<div class="outline-text-3" id="text-orgd4129d9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'desktop-locals-to-save 'buffer-undo-list)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb843db0" class="outline-3">
<h3 id="orgb843db0">Uniquify</h3>
<div class="outline-text-3" id="text-orgb843db0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> uniquify-buffer-name-style 'forward)
(<span style="color: #b6a0ff;">setq</span> uniquify-strip-common-suffix t)
(<span style="color: #b6a0ff;">setq</span> uniquify-after-kill-buffer-p t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8d24017" class="outline-3">
<h3 id="org8d24017">User info</h3>
<div class="outline-text-3" id="text-org8d24017">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> user-full-name <span style="color: #79a8ff;">"Toby Slight"</span>)
(<span style="color: #b6a0ff;">setq</span> user-mail-address <span style="color: #79a8ff;">"tslight@pm.me"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org59b013c" class="outline-3">
<h3 id="org59b013c">Windows</h3>
<div class="outline-text-3" id="text-org59b013c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> split-width-threshold 200)
(<span style="color: #b6a0ff;">setq</span> split-height-threshold 100)
(<span style="color: #b6a0ff;">setq</span> auto-window-vscroll nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7bdae7" class="outline-3">
<h3 id="orge7bdae7">Logging stuff</h3>
<div class="outline-text-3" id="text-orge7bdae7">
<p>
<a href="https://www.reddit.com/r/emacs/comments/l42oep/suppress_nativecomp_warnings_buffer/">https://www.reddit.com/r/emacs/comments/l42oep/suppress_nativecomp_warnings_buffer/</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> warning-minimum-level <span style="color: #f78fe7;">:error</span>)
(<span style="color: #b6a0ff;">setq</span> warning-suppress-types '((comp) (comp) (comp)))
(<span style="color: #b6a0ff;">setq</span> comp-async-report-warnings-errors 'nil)
(<span style="color: #b6a0ff;">setq</span> native-comp-async-report-warnings-errors 'nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-org847bf0f" class="outline-3">
<h3 id="org847bf0f">Yes or no</h3>
<div class="outline-text-3" id="text-org847bf0f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(fset 'yes-or-no-p 'y-or-n-p) <span style="color: #989898;">;; </span><span style="color: #989898;">never have to type full word</span>
(<span style="color: #b6a0ff;">setq</span> confirm-kill-emacs 'y-or-n-p)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge9c76ec" class="outline-2">
<h2 id="orge9c76ec">Keybindings</h2>
<div class="outline-text-2" id="text-orge9c76ec">
</div>
<div id="outline-container-org01225ee" class="outline-3">
<h3 id="org01225ee">Buffers</h3>
<div class="outline-text-3" id="text-org01225ee">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #79a8ff;">"C-x C-b"</span>) 'ibuffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-org19e100a" class="outline-3">
<h3 id="org19e100a">Editing</h3>
<div class="outline-text-3" id="text-org19e100a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #79a8ff;">"C-z"</span>) 'zap-up-to-char) <span style="color: #989898;">; </span><span style="color: #989898;">suspend is still bound to C-x C-z</span>
(global-set-key (kbd <span style="color: #79a8ff;">"M-z"</span>) 'zap-to-char)
</pre>
</div>

<p>
Remap some default to saner options
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #79a8ff;">"M-;"</span>) 'comment-line)         <span style="color: #989898;">; </span><span style="color: #989898;">comment-dwim by default</span>
(global-set-key (kbd <span style="color: #79a8ff;">"C-M-;"</span>) 'comment-dwim)       <span style="color: #989898;">; </span><span style="color: #989898;">unbound by default</span>
(global-set-key (kbd <span style="color: #79a8ff;">"C-x C-;"</span>) 'comment-box)      <span style="color: #989898;">; </span><span style="color: #989898;">comment-line by default</span>
</pre>
</div>

<p>
Always do what I mean!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key [remap capitalize-word] 'capitalize-dwim)
(global-set-key [remap downcase-word] 'downcase-dwim)
(global-set-key [remap upcase-word] 'upcase-dwim)
</pre>
</div>
</div>
</div>
