README.org
** Frames

#+begin_src emacs-lisp
  (global-set-key (kbd "C-<f10>") 'toggle-frame-maximized)
  (global-set-key (kbd "C-<f11>") 'toggle-frame-fullscreen)
  (global-set-key (kbd "C-s-f") 'toggle-frame-fullscreen)
  (global-set-key (kbd "C-s-m") 'toggle-frame-maximized)
#+end_src

** Menubar

#+begin_src emacs-lisp
  (global-set-key (kbd "S-<f10>") 'menu-bar-mode)
#+end_src

** Special mode

#+begin_src emacs-lisp
  ;; for help modes, and simple/special modes
  (define-key special-mode-map "n" #'forward-button)
  (define-key special-mode-map "p" #'backward-button)
  (define-key special-mode-map "f" #'forward-button)
  (define-key special-mode-map "b" #'backward-button)
  (define-key special-mode-map "n" #'widget-forward)
  (define-key special-mode-map "p" #'widget-backward)
  (define-key special-mode-map "f" #'widget-forward)
  (define-key special-mode-map "b" #'widget-backward)
#+end_src

* Theme/UI
** Disable themes

#+begin_src emacs-lisp
  (defadvice load-theme (before theme-dont-propagate activate)
    "Disable theme before loading new one."
    (mapc #'disable-theme custom-enabled-themes))
#+end_src

** Maximize on startup

#+begin_src emacs-lisp
  (setq default-frame-alist '((undecorated . t)
                              (fullscreen . maximized)
                              (vertical-scroll-bars . nil)))
  (setq frame-resize-pixelwise t) ;; jwm resize fix
#+end_src

** Setup Frame for Emacsclient

#+begin_src emacs-lisp
  (defun ts-setup-emacs-nw ()
    "Change some settings to make Emacs more terminal friendly."
    (xterm-mouse-mode 1)
    (mouse-avoidance-mode 'banish)
    (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
    (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
    (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
    (global-set-key [mouse-4] '(lambda () (interactive) (scroll-down 1)))
    (global-set-key [mouse-5] '(lambda () (interactive) (scroll-up 1))))
#+end_src

#+begin_src emacs-lisp
  (defun ts-setup-emacs-gui ()
    "Change some settings that are only applicable to graphical Emacs."
    (cond ((eq system-type 'windows-nt) (set-frame-font "Cascadia Mono 11" nil t))
          ((eq system-type 'darwin) (set-frame-font "Monaco 12" nil t))
          ((eq system-type 'gnu/linux) (set-frame-font "Monospace 11" nil t))
          (t (set-frame-font "Monospace 11" nil t))))
#+end_src

#+begin_src emacs-lisp
  (defun ts-after-make-frame (frame)
    "Add custom settings after making the FRAME."
    (select-frame frame)
    (load-theme 'modus-vivendi)
    (if (display-graphic-p)
        (ts-setup-emacs-gui)
      (ts-setup-emacs-nw)))
#+end_src

#+begin_src emacs-lisp
  (if (daemonp)
      (add-hook 'after-make-frame-functions #'ts-after-make-frame(selected-frame))
    (ts-after-make-frame(selected-frame)))
#+end_src

** Turn off UI elements

#+begin_src emacs-lisp
  (if (not (eq system-type 'darwin))
      (if (fboundp 'menu-bar-mode) (menu-bar-mode -1)))
  (if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
  (if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
  (if (fboundp 'tooltip-mode) (tooltip-mode -1))
  (if (fboundp 'set-horizontal-scroll-bar-mode)
      (set-horizontal-scroll-bar-mode nil))
#+end_src

* Buffer Functions
** Encoding

#+begin_src emacs-lisp
  (defun ts-convert-to-unix-coding-system ()
    "Change the current buffer's file encoding to unix."
    (interactive)
    (let ((coding-str (symbol-name buffer-file-coding-system)))
      (when (string-match "-\\(?:dos\\|mac\\)$" coding-str)
        (set-buffer-file-coding-system 'unix))))

  (global-set-key (kbd "C-x RET u") 'ts-convert-to-unix-coding-system)

  (defun ts-hide-dos-eol ()
    "Do not show ^M in files containing mixed UNIX and DOS line endings."
    (interactive)
    (setq buffer-display-table (make-display-table))
    (aset buffer-display-table ?\^M []))

  (add-hook 'find-file-hook 'ts-hide-dos-eol)
#+end_src

** Indent Buffer

#+begin_src emacs-lisp
  (defun ts-indent-buffer ()
    "Indent the contents of a buffer."
    (interactive)
    (indent-region (point-min) (point-max)))

  (global-set-key (kbd "M-i") 'ts-indent-buffer)
#+end_src

** Kill this buffer

#+begin_src emacs-lisp
  (defun ts-kill-this-buffer ()
    "Kill the current buffer - `kill-this-buffer' is unreliable."
    (interactive)
    (kill-buffer (current-buffer)))

  (global-set-key (kbd "C-x k") 'ts-kill-this-buffer)
#+end_src

** Last buffer

#+begin_src emacs-lisp
  (defun ts-last-buffer ()
    "Switch back and forth between two buffers easily."
    (interactive)
    (switch-to-buffer (other-buffer (current-buffer) 1)))

  (global-set-key (kbd "C-c b") 'ts-last-buffer)
#+end_src

