index.html

<div id="outline-container-orge503841" class="outline-3">
<h3 id="orge503841">Frames</h3>
<div class="outline-text-3" id="text-orge503841">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #79a8ff;">"C-&lt;f10&gt;"</span>) 'toggle-frame-maximized)
(global-set-key (kbd <span style="color: #79a8ff;">"C-&lt;f11&gt;"</span>) 'toggle-frame-fullscreen)
(global-set-key (kbd <span style="color: #79a8ff;">"C-s-f"</span>) 'toggle-frame-fullscreen)
(global-set-key (kbd <span style="color: #79a8ff;">"C-s-m"</span>) 'toggle-frame-maximized)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfa27dbb" class="outline-3">
<h3 id="orgfa27dbb">Menubar</h3>
<div class="outline-text-3" id="text-orgfa27dbb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #79a8ff;">"S-&lt;f10&gt;"</span>) 'menu-bar-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org70d37f5" class="outline-3">
<h3 id="org70d37f5">Special mode</h3>
<div class="outline-text-3" id="text-org70d37f5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #989898;">;; </span><span style="color: #989898;">for help modes, and simple/special modes</span>
(define-key special-mode-map <span style="color: #79a8ff;">"n"</span> #'forward-button)
(define-key special-mode-map <span style="color: #79a8ff;">"p"</span> #'backward-button)
(define-key special-mode-map <span style="color: #79a8ff;">"f"</span> #'forward-button)
(define-key special-mode-map <span style="color: #79a8ff;">"b"</span> #'backward-button)
(define-key special-mode-map <span style="color: #79a8ff;">"n"</span> #'widget-forward)
(define-key special-mode-map <span style="color: #79a8ff;">"p"</span> #'widget-backward)
(define-key special-mode-map <span style="color: #79a8ff;">"f"</span> #'widget-forward)
(define-key special-mode-map <span style="color: #79a8ff;">"b"</span> #'widget-backward)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1a1f803" class="outline-2">
<h2 id="org1a1f803">Theme/UI</h2>
<div class="outline-text-2" id="text-org1a1f803">
</div>
<div id="outline-container-org0758d28" class="outline-3">
<h3 id="org0758d28">Disable themes</h3>
<div class="outline-text-3" id="text-org0758d28">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defadvice</span> <span style="color: #feacd0;">load-theme</span> (before theme-dont-propagate activate)
  <span style="color: #9ac8e0;">"Disable theme before loading new one."</span>
  (mapc #'disable-theme custom-enabled-themes))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd42ab4" class="outline-3">
<h3 id="orgcd42ab4">Maximize on startup</h3>
<div class="outline-text-3" id="text-orgcd42ab4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> default-frame-alist '((undecorated . t)
                            (fullscreen . maximized)
                            (vertical-scroll-bars . nil)))
<span style="color: #989898;">;; </span><span style="color: #989898;">(setq frame-resize-pixelwise t) ;; jwm resize fix</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org21cf3d2" class="outline-3">
<h3 id="org21cf3d2">Setup Frame for Emacsclient</h3>
<div class="outline-text-3" id="text-org21cf3d2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-setup-emacs-nw</span> ()
  <span style="color: #9ac8e0;">"Change some settings to make Emacs more terminal friendly."</span>
  (xterm-mouse-mode 1)
  (mouse-avoidance-mode 'banish)
  (<span style="color: #b6a0ff;">setq</span> mouse-wheel-follow-mouse 't) <span style="color: #989898;">;; </span><span style="color: #989898;">scroll window under mouse</span>
  (<span style="color: #b6a0ff;">setq</span> mouse-wheel-progressive-speed nil) <span style="color: #989898;">;; </span><span style="color: #989898;">don't accelerate scrolling</span>
  (<span style="color: #b6a0ff;">setq</span> mouse-wheel-scroll-amount '(1 ((shift) . 1))) <span style="color: #989898;">;; </span><span style="color: #989898;">one line at a time</span>
  (global-set-key [mouse-4] '(lambda () (<span style="color: #b6a0ff;">interactive</span>) (scroll-down 1)))
  (global-set-key [mouse-5] '(lambda () (<span style="color: #b6a0ff;">interactive</span>) (scroll-up 1))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-setup-emacs-gui</span> ()
  <span style="color: #9ac8e0;">"Change some settings that are only applicable to graphical Emacs."</span>
  (<span style="color: #b6a0ff;">cond</span> ((eq system-type 'windows-nt) (set-frame-font <span style="color: #79a8ff;">"Cascadia Mono 11"</span> nil t))
        ((eq system-type 'darwin) (set-frame-font <span style="color: #79a8ff;">"Monaco 12"</span> nil t))
        ((eq system-type 'gnu/linux) (set-frame-font <span style="color: #79a8ff;">"Monospace 11"</span> nil t))
        (t (set-frame-font <span style="color: #79a8ff;">"Monospace 11"</span> nil t))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-after-make-frame</span> (frame)
  <span style="color: #9ac8e0;">"Add custom settings after making the FRAME."</span>
  (select-frame frame)
  (load-theme 'modus-vivendi)
  (<span style="color: #b6a0ff;">if</span> (display-graphic-p)
      (ts-setup-emacs-gui)
    (ts-setup-emacs-nw)))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">if</span> (daemonp)
    (add-hook 'after-make-frame-functions #'ts-after-make-frame(selected-frame))
  (ts-after-make-frame(selected-frame)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org61f62d4" class="outline-3">
<h3 id="org61f62d4">Turn off UI elements</h3>
<div class="outline-text-3" id="text-org61f62d4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">if</span> (not (eq system-type 'darwin))
    (<span style="color: #b6a0ff;">if</span> (fboundp 'menu-bar-mode) (menu-bar-mode -1)))
(<span style="color: #b6a0ff;">if</span> (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
(<span style="color: #b6a0ff;">if</span> (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(<span style="color: #b6a0ff;">if</span> (fboundp 'tooltip-mode) (tooltip-mode -1))
(<span style="color: #b6a0ff;">if</span> (fboundp 'set-horizontal-scroll-bar-mode)
    (set-horizontal-scroll-bar-mode nil))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0d2b358" class="outline-2">
<h2 id="org0d2b358">Buffer Functions</h2>
<div class="outline-text-2" id="text-org0d2b358">
</div>
<div id="outline-container-org6dedc42" class="outline-3">
<h3 id="org6dedc42">Encoding</h3>
<div class="outline-text-3" id="text-org6dedc42">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-convert-to-unix-coding-system</span> ()
  <span style="color: #9ac8e0;">"Change the current buffer's file encoding to unix."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> ((coding-str (symbol-name buffer-file-coding-system)))
    (<span style="color: #b6a0ff;">when</span> (string-match <span style="color: #79a8ff;">"-</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(?:</span><span style="color: #79a8ff;">dos</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">|</span><span style="color: #79a8ff;">mac</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">$"</span> coding-str)
      (set-buffer-file-coding-system 'unix))))

(global-set-key (kbd <span style="color: #79a8ff;">"C-x RET u"</span>) 'ts-convert-to-unix-coding-system)

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-hide-dos-eol</span> ()
  <span style="color: #9ac8e0;">"Do not show ^M in files containing mixed UNIX and DOS line endings."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">setq</span> buffer-display-table (make-display-table))
  (aset buffer-display-table ?\^M []))

(add-hook 'find-file-hook 'ts-hide-dos-eol)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0948389" class="outline-3">
<h3 id="org0948389">Indent Buffer</h3>
<div class="outline-text-3" id="text-org0948389">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-indent-buffer</span> ()
  <span style="color: #9ac8e0;">"Indent the contents of a buffer."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (indent-region (point-min) (point-max)))

(global-set-key (kbd <span style="color: #79a8ff;">"M-i"</span>) 'ts-indent-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-org329dfa2" class="outline-3">
<h3 id="org329dfa2">Kill this buffer</h3>
<div class="outline-text-3" id="text-org329dfa2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-kill-this-buffer</span> ()
  <span style="color: #9ac8e0;">"Kill the current buffer - `</span><span style="color: #00bcff;">kill-this-buffer</span><span style="color: #9ac8e0;">' is unreliable."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (kill-buffer (current-buffer)))

(global-set-key (kbd <span style="color: #79a8ff;">"C-x k"</span>) 'ts-kill-this-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7225318" class="outline-3">
<h3 id="org7225318">Last buffer</h3>
<div class="outline-text-3" id="text-org7225318">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-last-buffer</span> ()
  <span style="color: #9ac8e0;">"Switch back and forth between two buffers easily."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (switch-to-buffer (other-buffer (current-buffer) 1)))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c b"</span>) 'ts-last-buffer)
</pre>
</div>
</div>
</div>
