README.org
** Nuke buffers

#+begin_src emacs-lisp
  (defun ts-nuke-buffers ()
    "Kill all buffers, leaving *scratch* only."
    (interactive)
    (mapc
     (lambda (buffer)
       (kill-buffer buffer))
     (buffer-list))
    (if current-prefix-arg
        (delete-other-windows)))

  (global-set-key (kbd "C-c M-n") 'ts-nuke-buffers)
#+end_src

** Remove stuff from a buffer

#+begin_src emacs-lisp
  (defun ts-remove-from-buffer (string)
    "Remove all occurences of STRING from the whole buffer."
    (interactive "sString to remove: ")
    (save-match-data
      (save-excursion
        (let ((count 0))
          (goto-char (point-min))
          (while (re-search-forward string (point-max) t)
            (setq count (+ count 1))
            (replace-match "" nil nil))
          (message (format "%d %s removed from buffer." count string))))))

  (defun ts-remove-character-number (number)
    "Remove all occurences of a control character NUMBER.
    Excluding ^I (tabs) and ^J (newline)."
    (if (and (>= number 0) (<= number 31)
             (not (= number 9)) (not (= number 10)))
        (let ((character (string number)))
          (ts-remove-from-buffer character))))

  (defun ts-remove-all-ctrl-characters ()
    "Remove all occurences of all control characters.
    Excluding ^I (tabs) and ^J (newlines)."
    (interactive)
    (mapcar (lambda (n)
              (ts-remove-character-number n))
            (number-sequence 0 31)))

  (defun ts-remove-ctrl-m ()
    "Remove all ^M occurrences from EOL in a buffer."
    (interactive)
    (ts-remove-from-buffer "$"))

  (global-set-key (kbd "C-c k") 'ts-remove-from-buffer)
#+end_src

** Save buffers silently

#+begin_src emacs-lisp
  (defun ts-save-buffers-silently ()
    "Save all open buffers without prompting."
    (interactive)
    (save-some-buffers t)
    (message "Saved all buffers :-)"))

  (global-set-key (kbd "C-c s") 'ts-save-buffers-silently)
#+end_src

* Editing Functions
** Aligning symbols

Some handy functions to make aligning symbols less painful.

#+begin_src emacs-lisp
  (defun ts-align-symbol (begin end symbol)
    "Align any SYMBOL in region (between BEGIN and END)."
    (interactive "r\nsEnter align symbol: ")
    (align-regexp begin end (concat "\\(\\s-*\\)" symbol) 1 1))

  (global-set-key (kbd "C-c a") 'ts-align-symbol)

  (defun ts-align-numbers (begin end)
    "Align numbers in region (between BEGIN and END)."
    (interactive "r")
    (ts-align-symbol begin end "[0-9]+"))

  (global-set-key (kbd "C-c #") 'ts-align-numbers)

  (defadvice align-regexp (around align-regexp-with-spaces activate)
    "Force alignment commands to use spaces, not tabs."
    (let ((indent-tabs-mode nil))
      ad-do-it))
#+end_src

** Beginning of line

#+begin_src emacs-lisp
  (defun ts-move-beginning-of-line ()
    "Move point back to indentation.

  If there is any non blank characters to the left of the cursor.
  Otherwise point moves to beginning of line."
    (interactive)
    (if (= (point) (save-excursion (back-to-indentation) (point)))
        (beginning-of-line)
      (back-to-indentation)))

  (global-set-key [remap move-beginning-of-line] 'ts-move-beginning-of-line)
#+end_src

** Change numbers

Increment or decrement numbers at the point.

#+begin_src emacs-lisp
  (defun ts--change-number (&optional arg)
    "Increment the number forward from point by 'arg'."
    (interactive "p*")
    (save-excursion
      (save-match-data
        (let (inc-by field-width answer)
          (setq inc-by (if arg arg 1))
          (skip-chars-backward "0123456789")
          (when (re-search-forward "[0-9]+" nil t)
            (setq field-width (- (match-end 0) (match-beginning 0)))
            (setq answer (+ (string-to-number (match-string 0) 10) inc-by))
            (when (< answer 0)
              (setq answer (+ (expt 10 field-width) answer)))
            (replace-match (format (concat "%0" (int-to-string field-width) "d")
                                   answer)))))))

  (defun ts-change-number (inc)
    "Adjust the height of the default face by INC.

  INC may be passed as a numeric prefix argument."
    (interactive "p")
    (let ((ev last-command-event)
          (echo-keystrokes nil))
      (let* ((base (event-basic-type ev))
             (step
              (pcase base
                ((or ?+ ?=) inc)
                (?- (- inc))
                (?0 0)
                (_ inc))))
        (ts--change-number step)
        ;; (unless (zerop step)
        (message "Use +,-,0 for further adjustment")
        (set-transient-map
         (let ((map (make-sparse-keymap)))
           (dolist (mods '(() (control)))
             (dolist (key '(?- ?+ ?= ?0)) ;; = is often unshifted +.
               (define-key map (vector (append mods (list key)))
                           (lambda () (interactive) (ts-change-number (abs inc))))))
           map)))))

  (global-set-key (kbd "C-c +") 'ts-change-number)
  (global-set-key (kbd "C-c -") 'ts-change-number)
#+end_src

