index.html

<div id="outline-container-org4a396fe" class="outline-3">
<h3 id="org4a396fe">Nuke buffers</h3>
<div class="outline-text-3" id="text-org4a396fe">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-nuke-buffers</span> ()
  <span style="color: #9ac8e0;">"Kill all buffers, leaving *scratch* only."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (mapc
   (<span style="color: #b6a0ff;">lambda</span> (buffer)
     (kill-buffer buffer))
   (buffer-list))
  (<span style="color: #b6a0ff;">if</span> current-prefix-arg
      (delete-other-windows)))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c M-n"</span>) 'ts-nuke-buffers)
</pre>
</div>
</div>
</div>

<div id="outline-container-org45bd5bf" class="outline-3">
<h3 id="org45bd5bf">Remove stuff from a buffer</h3>
<div class="outline-text-3" id="text-org45bd5bf">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-remove-from-buffer</span> (string)
  <span style="color: #9ac8e0;">"Remove all occurences of STRING from the whole buffer."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"sString to remove: "</span>)
  (<span style="color: #b6a0ff;">save-match-data</span>
    (<span style="color: #b6a0ff;">save-excursion</span>
      (<span style="color: #b6a0ff;">let</span> ((count 0))
        (goto-char (point-min))
        (<span style="color: #b6a0ff;">while</span> (re-search-forward string (point-max) t)
          (<span style="color: #b6a0ff;">setq</span> count (+ count 1))
          (replace-match <span style="color: #79a8ff;">""</span> nil nil))
        (message (format <span style="color: #79a8ff;">"%d %s removed from buffer."</span> count string))))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-remove-character-number</span> (number)
  <span style="color: #9ac8e0;">"Remove all occurences of a control character NUMBER.</span>
<span style="color: #9ac8e0;">  Excluding ^I (tabs) and ^J (newline)."</span>
  (<span style="color: #b6a0ff;">if</span> (<span style="color: #b6a0ff;">and</span> (&gt;= number 0) (&lt;= number 31)
           (not (= number 9)) (not (= number 10)))
      (<span style="color: #b6a0ff;">let</span> ((character (string number)))
        (ts-remove-from-buffer character))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-remove-all-ctrl-characters</span> ()
  <span style="color: #9ac8e0;">"Remove all occurences of all control characters.</span>
<span style="color: #9ac8e0;">  Excluding ^I (tabs) and ^J (newlines)."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (mapcar (<span style="color: #b6a0ff;">lambda</span> (n)
            (ts-remove-character-number n))
          (number-sequence 0 31)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-remove-ctrl-m</span> ()
  <span style="color: #9ac8e0;">"Remove all ^M occurrences from EOL in a buffer."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (ts-remove-from-buffer <span style="color: #79a8ff;">"$"</span>))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c k"</span>) 'ts-remove-from-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f14012" class="outline-3">
<h3 id="org7f14012">Save buffers silently</h3>
<div class="outline-text-3" id="text-org7f14012">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-save-buffers-silently</span> ()
  <span style="color: #9ac8e0;">"Save all open buffers without prompting."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (save-some-buffers t)
  (message <span style="color: #79a8ff;">"Saved all buffers :-)"</span>))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c s"</span>) 'ts-save-buffers-silently)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgafc5e9f" class="outline-2">
<h2 id="orgafc5e9f">Editing Functions</h2>
<div class="outline-text-2" id="text-orgafc5e9f">
</div>
<div id="outline-container-org43c3349" class="outline-3">
<h3 id="org43c3349">Aligning symbols</h3>
<div class="outline-text-3" id="text-org43c3349">
<p>
Some handy functions to make aligning symbols less painful.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-align-symbol</span> (begin end symbol)
  <span style="color: #9ac8e0;">"Align any SYMBOL in region (between BEGIN and END)."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"r\nsEnter align symbol: "</span>)
  (align-regexp begin end (concat <span style="color: #79a8ff;">"</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">\\s-*</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">"</span> symbol) 1 1))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c a"</span>) 'ts-align-symbol)

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-align-numbers</span> (begin end)
  <span style="color: #9ac8e0;">"Align numbers in region (between BEGIN and END)."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"r"</span>)
  (ts-align-symbol begin end <span style="color: #79a8ff;">"[0-9]+"</span>))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c #"</span>) 'ts-align-numbers)

(<span style="color: #b6a0ff;">defadvice</span> <span style="color: #feacd0;">align-regexp</span> (around align-regexp-with-spaces activate)
  <span style="color: #9ac8e0;">"Force alignment commands to use spaces, not tabs."</span>
  (<span style="color: #b6a0ff;">let</span> ((indent-tabs-mode nil))
    ad-do-it))
</pre>
</div>
</div>
</div>

<div id="outline-container-org52643dc" class="outline-3">
<h3 id="org52643dc">Beginning of line</h3>
<div class="outline-text-3" id="text-org52643dc">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-move-beginning-of-line</span> ()
  <span style="color: #9ac8e0;">"Move point back to indentation.</span>

<span style="color: #9ac8e0;">If there is any non blank characters to the left of the cursor.</span>
<span style="color: #9ac8e0;">Otherwise point moves to beginning of line."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">if</span> (= (point) (<span style="color: #b6a0ff;">save-excursion</span> (back-to-indentation) (point)))
      (beginning-of-line)
    (back-to-indentation)))

(global-set-key [remap move-beginning-of-line] 'ts-move-beginning-of-line)
</pre>
</div>
</div>
</div>

<div id="outline-container-org02f3555" class="outline-3">
<h3 id="org02f3555">Change numbers</h3>
<div class="outline-text-3" id="text-org02f3555">
<p>
Increment or decrement numbers at the point.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts--change-number</span> (<span style="color: #6ae4b9;">&amp;optional</span> arg)
  <span style="color: #9ac8e0;">"Increment the number forward from point by '</span><span style="color: #00bcff;">arg</span><span style="color: #9ac8e0;">'."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"p*"</span>)
  (<span style="color: #b6a0ff;">save-excursion</span>
    (<span style="color: #b6a0ff;">save-match-data</span>
      (<span style="color: #b6a0ff;">let</span> (inc-by field-width answer)
        (<span style="color: #b6a0ff;">setq</span> inc-by (<span style="color: #b6a0ff;">if</span> arg arg 1))
        (skip-chars-backward <span style="color: #79a8ff;">"0123456789"</span>)
        (<span style="color: #b6a0ff;">when</span> (re-search-forward <span style="color: #79a8ff;">"[0-9]+"</span> nil t)
          (<span style="color: #b6a0ff;">setq</span> field-width (- (match-end 0) (match-beginning 0)))
          (<span style="color: #b6a0ff;">setq</span> answer (+ (string-to-number (match-string 0) 10) inc-by))
          (<span style="color: #b6a0ff;">when</span> (&lt; answer 0)
            (<span style="color: #b6a0ff;">setq</span> answer (+ (expt 10 field-width) answer)))
          (replace-match (format (concat <span style="color: #79a8ff;">"%0"</span> (int-to-string field-width) <span style="color: #79a8ff;">"d"</span>)
                                 answer)))))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-change-number</span> (inc)
  <span style="color: #9ac8e0;">"Adjust the height of the default face by INC.</span>

<span style="color: #9ac8e0;">INC may be passed as a numeric prefix argument."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"p"</span>)
  (<span style="color: #b6a0ff;">let</span> ((ev last-command-event)
        (echo-keystrokes nil))
    (<span style="color: #b6a0ff;">let*</span> ((base (event-basic-type ev))
           (step
            (<span style="color: #b6a0ff;">pcase</span> base
              ((<span style="color: #b6a0ff;">or</span> ?+ ?=) inc)
              (?- (- inc))
              (?0 0)
              (_ inc))))
      (ts--change-number step)
      <span style="color: #989898;">;; </span><span style="color: #989898;">(unless (zerop step)</span>
      (message <span style="color: #79a8ff;">"Use +,-,0 for further adjustment"</span>)
      (set-transient-map
       (<span style="color: #b6a0ff;">let</span> ((map (make-sparse-keymap)))
         (<span style="color: #b6a0ff;">dolist</span> (mods '(() (control)))
           (<span style="color: #b6a0ff;">dolist</span> (key '(?- ?+ ?= ?0)) <span style="color: #989898;">;; </span><span style="color: #989898;">= is often unshifted +.</span>
             (define-key map (vector (append mods (list key)))
                         (<span style="color: #b6a0ff;">lambda</span> () (<span style="color: #b6a0ff;">interactive</span>) (ts-change-number (abs inc))))))
         map)))))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c +"</span>) 'ts-change-number)
(global-set-key (kbd <span style="color: #79a8ff;">"C-c -"</span>) 'ts-change-number)
</pre>
</div>
</div>
</div>
