README.org
** Delete inside delimiters

#+begin_src emacs-lisp
  (defun ts-delete-inside-delimiters (arg)
    "Deletes the text within parentheses, brackets or quotes.
  With prefix ARG, delete delimiters too."
    (interactive "P")
    ;; Search for a match on the same line, don't delete across lines
    (search-backward-regexp "[[{(<\"\']" (line-beginning-position))
    (forward-char)
    (let ((lstart (point)))
      (search-forward-regexp "[]})>\"\']" (line-end-position))
      (backward-char)
      (if arg
          (kill-region (- lstart 1) (+ (point) 1))
        (kill-region lstart (point)))))

  (global-set-key (kbd "C-c d") 'ts-delete-inside-delimiters)
#+end_src

** Generate a numbered list

#+begin_src emacs-lisp
  (defun ts-generate-numbered-list (start end char)
    "Create a numbered list from START to END.  Using CHAR as punctuation."
    (interactive "nStart number:\nnEnd number:\nsCharacter:")
    (let ((x start))
      (while (<= x end)
        (insert (concat (number-to-string x) char))
        (newline)
        (setq x (+ x 1)))))
#+end_src

** Kill Region

#+begin_src emacs-lisp
  (defun ts-kill-region (arg)
    "Cut region or current ARG lines to kill ring."
    (interactive "p")
    (let (p1 p2)
      (if (use-region-p)
          (progn (setq p1 (region-beginning))
                 (setq p2 (region-end)))
        (progn (setq p1 (line-beginning-position))
               (setq p2 (line-beginning-position (+ arg 1)))))
      (kill-region p1 p2)))

  (global-set-key [remap kill-region] 'ts-kill-region)
#+end_src

** Kill Ring Save

#+begin_src emacs-lisp
  (defun ts-kill-ring-save (arg)
    "Copy region or current ARG lines to kill ring."
    (interactive "p")
    (let (p1 p2)
      (if (use-region-p)
          (progn (setq p1 (region-beginning))
                 (setq p2 (region-end)))
        (progn (setq p1 (line-beginning-position))
               (setq p2 (line-beginning-position (+ arg 1)))))
      (kill-ring-save p1 p2)
      (goto-char p2)))

  (global-set-key [remap kill-ring-save] 'ts-kill-ring-save)
#+end_src

** Kill Ring Save Whole Buffer

#+begin_src emacs-lisp
  (defun ts-kill-ring-save-whole-buffer ()
    "Save the entire contents of the buffer to the kill ring."
    (interactive)
    (kill-ring-save (point-min) (point-max))
    (message "Saved whole buffer to kill ring :-)"))

  (global-set-key (kbd "C-c h") 'ts-kill-ring-save-whole-buffer)
#+end_src

** Moving lines

#+begin_src emacs-lisp
  (defmacro save-column (&rest body)
    `(let ((column (current-column)))
       (unwind-protect (progn ,@body) (move-to-column column))))
  (put 'save-column 'lisp-indent-function 0)

  (defun move-line-up ()
    (interactive)
    (save-column (transpose-lines 1) (forward-line -2)))

  (defun move-line-down ()
    (interactive)
    (save-column (forward-line 1) (transpose-lines 1) (forward-line -1)))

  (global-set-key (kbd "M-p") 'move-line-up)
  (global-set-key (kbd "M-n") 'move-line-down)
#+end_src

** Sort Words

#+begin_src emacs-lisp
  (defun ts-sort-words (reverse beg end)
    "Sort words in region alphabetically, in REVERSE if negative.

  Prefixed with negative \\[universal-argument], sorts in reverse.

  The variable `sort-fold-case' determines whether alphabetic case
  affects the sort order.

  See `sort-regexp-fields'."
    (interactive "*P\nr")
    (sort-regexp-fields reverse "\\w+" "\\&" beg end))
#+end_src

** Surround stuff

#+begin_src emacs-lisp
  (defun ts-surround (begin end open close)
    "Put OPEN at BEGIN and CLOSE at END of the region.
  If you omit CLOSE, it will reuse OPEN, unless OPEN is a (,{,<,[,
  in which case CLOSE will be the matching pair."
    (interactive  "r\nsStart: \nsEnd: ")
    (save-excursion
      (goto-char end)
      (cond ((string= open "(") (insert ")"))
            ((string= open "[") (insert "]"))
            ((string= open "<") (insert ">"))
            ((string= open "{") (insert "}"))
            ((string= open "") (insert open))
            (t (insert close)))
      (goto-char begin)
      (insert open)))

  (global-set-key (kbd "M-s M-s") 'ts-surround)
#+end_src

** XML pretty print

#+begin_src emacs-lisp
  (defun ts-xml-pretty-print ()
    "Reformat and indent XML."
    (interactive)
    (save-excursion
      (sgml-pretty-print (point-min) (point-max))
      (indent-region (point-min) (point-max))))
#+end_src

* File Functions
