index.html

<div id="outline-container-orge19a8a3" class="outline-3">
<h3 id="orge19a8a3">Delete inside delimiters</h3>
<div class="outline-text-3" id="text-orge19a8a3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-delete-inside-delimiters</span> (arg)
  <span style="color: #9ac8e0;">"Deletes the text within parentheses, brackets or quotes.</span>
<span style="color: #9ac8e0;">With prefix ARG, delete delimiters too."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"P"</span>)
  <span style="color: #989898;">;; </span><span style="color: #989898;">Search for a match on the same line, don't delete across lines</span>
  (search-backward-regexp <span style="color: #79a8ff;">"[[{(&lt;\"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">']"</span> (line-beginning-position))
  (forward-char)
  (<span style="color: #b6a0ff;">let</span> ((lstart (point)))
    (search-forward-regexp <span style="color: #79a8ff;">"[]})&gt;\"</span><span style="color: #fec43f;">\</span><span style="color: #79a8ff;">']"</span> (line-end-position))
    (backward-char)
    (<span style="color: #b6a0ff;">if</span> arg
        (kill-region (- lstart 1) (+ (point) 1))
      (kill-region lstart (point)))))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c d"</span>) 'ts-delete-inside-delimiters)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9af9f1e" class="outline-3">
<h3 id="org9af9f1e">Generate a numbered list</h3>
<div class="outline-text-3" id="text-org9af9f1e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-generate-numbered-list</span> (start end char)
  <span style="color: #9ac8e0;">"Create a numbered list from START to END.  Using CHAR as punctuation."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"nStart number:\nnEnd number:\nsCharacter:"</span>)
  (<span style="color: #b6a0ff;">let</span> ((x start))
    (<span style="color: #b6a0ff;">while</span> (&lt;= x end)
      (insert (concat (number-to-string x) char))
      (newline)
      (<span style="color: #b6a0ff;">setq</span> x (+ x 1)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org72cb888" class="outline-3">
<h3 id="org72cb888">Kill Region</h3>
<div class="outline-text-3" id="text-org72cb888">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-kill-region</span> (arg)
  <span style="color: #9ac8e0;">"Cut region or current ARG lines to kill ring."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"p"</span>)
  (<span style="color: #b6a0ff;">let</span> (p1 p2)
    (<span style="color: #b6a0ff;">if</span> (use-region-p)
        (<span style="color: #b6a0ff;">progn</span> (<span style="color: #b6a0ff;">setq</span> p1 (region-beginning))
               (<span style="color: #b6a0ff;">setq</span> p2 (region-end)))
      (<span style="color: #b6a0ff;">progn</span> (<span style="color: #b6a0ff;">setq</span> p1 (line-beginning-position))
             (<span style="color: #b6a0ff;">setq</span> p2 (line-beginning-position (+ arg 1)))))
    (kill-region p1 p2)))

(global-set-key [remap kill-region] 'ts-kill-region)
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e4bd7b" class="outline-3">
<h3 id="org1e4bd7b">Kill Ring Save</h3>
<div class="outline-text-3" id="text-org1e4bd7b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-kill-ring-save</span> (arg)
  <span style="color: #9ac8e0;">"Copy region or current ARG lines to kill ring."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"p"</span>)
  (<span style="color: #b6a0ff;">let</span> (p1 p2)
    (<span style="color: #b6a0ff;">if</span> (use-region-p)
        (<span style="color: #b6a0ff;">progn</span> (<span style="color: #b6a0ff;">setq</span> p1 (region-beginning))
               (<span style="color: #b6a0ff;">setq</span> p2 (region-end)))
      (<span style="color: #b6a0ff;">progn</span> (<span style="color: #b6a0ff;">setq</span> p1 (line-beginning-position))
             (<span style="color: #b6a0ff;">setq</span> p2 (line-beginning-position (+ arg 1)))))
    (kill-ring-save p1 p2)
    (goto-char p2)))

(global-set-key [remap kill-ring-save] 'ts-kill-ring-save)
</pre>
</div>
</div>
</div>

<div id="outline-container-org744c937" class="outline-3">
<h3 id="org744c937">Kill Ring Save Whole Buffer</h3>
<div class="outline-text-3" id="text-org744c937">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-kill-ring-save-whole-buffer</span> ()
  <span style="color: #9ac8e0;">"Save the entire contents of the buffer to the kill ring."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (kill-ring-save (point-min) (point-max))
  (message <span style="color: #79a8ff;">"Saved whole buffer to kill ring :-)"</span>))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c h"</span>) 'ts-kill-ring-save-whole-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ddd0da" class="outline-3">
<h3 id="org9ddd0da">Moving lines</h3>
<div class="outline-text-3" id="text-org9ddd0da">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defmacro</span> <span style="color: #feacd0;">save-column</span> (<span style="color: #6ae4b9;">&amp;rest</span> body)
  `(<span style="color: #b6a0ff;">let</span> ((column (current-column)))
     (<span style="color: #b6a0ff;">unwind-protect</span> (<span style="color: #b6a0ff;">progn</span> ,@body) (move-to-column column))))
(put 'save-column 'lisp-indent-function 0)

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">move-line-up</span> ()
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">save-column</span> (transpose-lines 1) (forward-line -2)))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">move-line-down</span> ()
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">save-column</span> (forward-line 1) (transpose-lines 1) (forward-line -1)))

(global-set-key (kbd <span style="color: #79a8ff;">"M-p"</span>) 'move-line-up)
(global-set-key (kbd <span style="color: #79a8ff;">"M-n"</span>) 'move-line-down)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7c5d1f" class="outline-3">
<h3 id="orgd7c5d1f">Sort Words</h3>
<div class="outline-text-3" id="text-orgd7c5d1f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-sort-words</span> (reverse beg end)
  <span style="color: #9ac8e0;">"Sort words in region alphabetically, in REVERSE if negative.</span>

<span style="color: #9ac8e0;">Prefixed with negative \\[</span><span style="color: #00bcff;">universal-argument</span><span style="color: #9ac8e0;">], sorts in reverse.</span>

<span style="color: #9ac8e0;">The variable `</span><span style="color: #00bcff;">sort-fold-case</span><span style="color: #9ac8e0;">' determines whether alphabetic case</span>
<span style="color: #9ac8e0;">affects the sort order.</span>

<span style="color: #9ac8e0;">See `</span><span style="color: #00bcff;">sort-regexp-fields</span><span style="color: #9ac8e0;">'."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"*P\nr"</span>)
  (sort-regexp-fields reverse <span style="color: #79a8ff;">"\\w+"</span> <span style="color: #79a8ff;">"\\&amp;"</span> beg end))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1256d8d" class="outline-3">
<h3 id="org1256d8d">Surround stuff</h3>
<div class="outline-text-3" id="text-org1256d8d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-surround</span> (begin end open close)
  <span style="color: #9ac8e0;">"Put OPEN at BEGIN and CLOSE at END of the region.</span>
<span style="color: #9ac8e0;">If you omit CLOSE, it will reuse OPEN, unless OPEN is a (,{,&lt;,[,</span>
<span style="color: #9ac8e0;">in which case CLOSE will be the matching pair."</span>
  (<span style="color: #b6a0ff;">interactive</span>  <span style="color: #79a8ff;">"r\nsStart: \nsEnd: "</span>)
  (<span style="color: #b6a0ff;">save-excursion</span>
    (goto-char end)
    (<span style="color: #b6a0ff;">cond</span> ((string= open <span style="color: #79a8ff;">"("</span>) (insert <span style="color: #79a8ff;">")"</span>))
          ((string= open <span style="color: #79a8ff;">"["</span>) (insert <span style="color: #79a8ff;">"]"</span>))
          ((string= open <span style="color: #79a8ff;">"&lt;"</span>) (insert <span style="color: #79a8ff;">"&gt;"</span>))
          ((string= open <span style="color: #79a8ff;">"{"</span>) (insert <span style="color: #79a8ff;">"}"</span>))
          ((string= open <span style="color: #79a8ff;">""</span>) (insert open))
          (t (insert close)))
    (goto-char begin)
    (insert open)))

(global-set-key (kbd <span style="color: #79a8ff;">"M-s M-s"</span>) 'ts-surround)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdba582c" class="outline-3">
<h3 id="orgdba582c">XML pretty print</h3>
<div class="outline-text-3" id="text-orgdba582c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-xml-pretty-print</span> ()
  <span style="color: #9ac8e0;">"Reformat and indent XML."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">save-excursion</span>
    (sgml-pretty-print (point-min) (point-max))
    (indent-region (point-min) (point-max))))
</pre>
</div>
</div>
</div>
</div>
