README.org
** Delete this file

#+begin_src emacs-lisp
  (defun ts-delete-this-file ()
    "Delete the current file, and kill the buffer."
    (interactive)
    (or (buffer-file-name) (error "No file is currently being edited"))
    (when (yes-or-no-p (format "Really delete '%s'?"
                               (file-name-nondirectory buffer-file-name)))
      (delete-file (buffer-file-name) t)
      (kill-this-buffer)))

  (global-set-key (kbd "C-c f d") 'ts-delete-this-file)
#+end_src

** Make backup of current file

#+begin_src emacs-lisp
  (defun ts-make-backup ()
    "Make a backup copy of current file or dired marked files.

  If in dired, backup current file or marked files."
    (interactive)
    (let (($fname (buffer-file-name)))
      (if $fname
          (let (($backup-name
                 (concat $fname "." (format-time-string "%y%m%d%H%M") ".bak")))
            (copy-file $fname $backup-name t)
            (message (concat "Backup saved at: " $backup-name)))
        (if (string-equal major-mode "dired-mode")
            (progn
              (mapc (lambda ($x)
                      (let (($backup-name
                             (concat $x "." (format-time-string "%y%m%d%H%M") ".bak")))
                        (copy-file $x $backup-name t)))
                    (dired-get-marked-files))
              (message "marked files backed up"))
          (user-error "Buffer not file nor dired")))))
#+end_src

#+begin_src emacs-lisp
  (defun ts-make-backup-and-save ()
    "Backup of current file and save, or backup dired marked files.
  For detail, see `ts-make-backup'."
    (interactive)
    (if (buffer-file-name)
        (progn
          (ts-make-backup)
          (when (buffer-modified-p)
            (save-buffer)))
      (progn
        (ts-make-backup))))

  (global-set-key (kbd "C-c f b") 'ts-make-backup-and-save)
#+end_src

** Open current file as root

#+begin_src emacs-lisp
  (defun ts-sudoedit (&optional arg)
    "Open current or ARG file as root."
    (interactive "P")
    (if (or arg (not buffer-file-name))
        (find-file (concat "/sudo:root@localhost:"
                           (read-file-name "Find file (as root): ")))
      (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))

  (global-set-key (kbd "C-c f s") 'ts-sudoedit)
#+end_src

** Rename file and buffer

#+begin_src emacs-lisp
  (defun ts-rename-this-file-and-buffer (new-name)
    "Renames both current buffer and file it's visiting to NEW-NAME."
    (interactive "FNew name: ")
    (let ((name (buffer-name))
          (filename (buffer-file-name)))
      (unless filename
        (error "Buffer '%s' is not visiting a file!" name))
      (if (get-buffer new-name)
          (message "A buffer named '%s' already exists!" new-name)
        (progn
          (when (file-exists-p filename)
            (rename-file filename new-name 1))
          (rename-buffer new-name)
          (set-visited-file-name new-name)))))

  (global-set-key (kbd "C-c f r") 'ts-rename-this-file-and-buffer)
#+end_src

** Yank current file contents to kill ring

Very useful for copying ssh public keys...

#+begin_src emacs-lisp
  (defun ts-copy-file-contents-to-clipboard (file)
    "Copy a file's contents to the clipboard."
    (interactive "f")
    (with-current-buffer (find-file-noselect file)
      (kill-new (buffer-substring-no-properties (point-min) (point-max))))
    (message "Copied contents of %s to the clipboard" file))

  (global-set-key (kbd "C-c f h") 'ts-copy-file-contents-to-clipboard)
#+end_src

** Yank current file name to kill ring

#+begin_src emacs-lisp
  (defun ts-copy-file-name-to-clipboard (arg)
    "Copy the current buffer file name to the clipboard.
  With prefix ARG, omit path."
    (interactive "P")
    (let ((filename (if (equal major-mode 'dired-mode)
                        (if arg
                            (file-name-nondirectory
                             (directory-file-name
                              (file-name-directory default-directory)))
                          default-directory)
                      (if arg
                          (file-name-nondirectory buffer-file-name)
                        (buffer-file-name)))))
      (when filename
        (kill-new filename)
        (message "Copied '%s' to the clipboard." filename))))

  (global-set-key (kbd "C-c f w") 'ts-copy-file-name-to-clipboard)
#+end_src

* Miscellaneous
** Byte compile and load on save

#+begin_src emacs-lisp
  (defun ts-byte-compile-and-load ()
    "Byte compile Emacs Lisp files and load if ARG."
    (when (and buffer-file-name
               (equal (file-name-extension buffer-file-name) "el")
               (equal major-mode 'emacs-lisp-mode))
      (byte-compile-file buffer-file-name)
      (message "Compiled %s :-)" buffer-file-name)
      (load (file-name-sans-extension buffer-file-name))
      (message "Loaded %s :-)" buffer-file-name)))

  (add-hook 'after-save-hook 'ts-byte-compile-and-load)
#+end_src

