index.html

<div id="outline-container-orgb79490c" class="outline-2">
<h2 id="orgb79490c">File Functions</h2>
<div class="outline-text-2" id="text-orgb79490c">
</div>
<div id="outline-container-org93f669f" class="outline-3">
<h3 id="org93f669f">Delete this file</h3>
<div class="outline-text-3" id="text-org93f669f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-delete-this-file</span> ()
  <span style="color: #9ac8e0;">"Delete the current file, and kill the buffer."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">or</span> (buffer-file-name) (<span style="color: #fec43f;">error</span> <span style="color: #79a8ff;">"No file is currently being edited"</span>))
  (<span style="color: #b6a0ff;">when</span> (yes-or-no-p (format <span style="color: #79a8ff;">"Really delete '</span><span style="color: #00bcff;">%s</span><span style="color: #79a8ff;">'?"</span>
                             (file-name-nondirectory buffer-file-name)))
    (delete-file (buffer-file-name) t)
    (kill-this-buffer)))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c f d"</span>) 'ts-delete-this-file)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb50cde9" class="outline-3">
<h3 id="orgb50cde9">Make backup of current file</h3>
<div class="outline-text-3" id="text-orgb50cde9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-make-backup</span> ()
  <span style="color: #9ac8e0;">"Make a backup copy of current file or dired marked files.</span>

<span style="color: #9ac8e0;">If in dired, backup current file or marked files."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> (($fname (buffer-file-name)))
    (<span style="color: #b6a0ff;">if</span> $fname
        (<span style="color: #b6a0ff;">let</span> (($backup-name
               (concat $fname <span style="color: #79a8ff;">"."</span> (format-time-string <span style="color: #79a8ff;">"%y%m%d%H%M"</span>) <span style="color: #79a8ff;">".bak"</span>)))
          (copy-file $fname $backup-name t)
          (message (concat <span style="color: #79a8ff;">"Backup saved at: "</span> $backup-name)))
      (<span style="color: #b6a0ff;">if</span> (string-equal major-mode <span style="color: #79a8ff;">"dired-mode"</span>)
          (<span style="color: #b6a0ff;">progn</span>
            (mapc (<span style="color: #b6a0ff;">lambda</span> ($x)
                    (<span style="color: #b6a0ff;">let</span> (($backup-name
                           (concat $x <span style="color: #79a8ff;">"."</span> (format-time-string <span style="color: #79a8ff;">"%y%m%d%H%M"</span>) <span style="color: #79a8ff;">".bak"</span>)))
                      (copy-file $x $backup-name t)))
                  (dired-get-marked-files))
            (message <span style="color: #79a8ff;">"marked files backed up"</span>))
        (<span style="color: #fec43f;">user-error</span> <span style="color: #79a8ff;">"Buffer not file nor dired"</span>)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-make-backup-and-save</span> ()
  <span style="color: #9ac8e0;">"Backup of current file and save, or backup dired marked files.</span>
<span style="color: #9ac8e0;">For detail, see `</span><span style="color: #00bcff;">ts-make-backup</span><span style="color: #9ac8e0;">'."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">if</span> (buffer-file-name)
      (<span style="color: #b6a0ff;">progn</span>
        (ts-make-backup)
        (<span style="color: #b6a0ff;">when</span> (buffer-modified-p)
          (save-buffer)))
    (<span style="color: #b6a0ff;">progn</span>
      (ts-make-backup))))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c f b"</span>) 'ts-make-backup-and-save)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9893e46" class="outline-3">
<h3 id="org9893e46">Open current file as root</h3>
<div class="outline-text-3" id="text-org9893e46">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-sudoedit</span> (<span style="color: #6ae4b9;">&amp;optional</span> arg)
  <span style="color: #9ac8e0;">"Open current or ARG file as root."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"P"</span>)
  (<span style="color: #b6a0ff;">if</span> (<span style="color: #b6a0ff;">or</span> arg (not buffer-file-name))
      (find-file (concat <span style="color: #79a8ff;">"/sudo:root@localhost:"</span>
                         (read-file-name <span style="color: #79a8ff;">"Find file (as root): "</span>)))
    (find-alternate-file (concat <span style="color: #79a8ff;">"/sudo:root@localhost:"</span> buffer-file-name))))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c f s"</span>) 'ts-sudoedit)
</pre>
</div>
</div>
</div>

<div id="outline-container-org44f2e6b" class="outline-3">
<h3 id="org44f2e6b">Rename file and buffer</h3>
<div class="outline-text-3" id="text-org44f2e6b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-rename-this-file-and-buffer</span> (new-name)
  <span style="color: #9ac8e0;">"Renames both current buffer and file it's visiting to NEW-NAME."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"FNew name: "</span>)
  (<span style="color: #b6a0ff;">let</span> ((name (buffer-name))
        (filename (buffer-file-name)))
    (<span style="color: #b6a0ff;">unless</span> filename
      (<span style="color: #fec43f;">error</span> <span style="color: #79a8ff;">"Buffer '</span><span style="color: #00bcff;">%s</span><span style="color: #79a8ff;">' is not visiting a file!"</span> name))
    (<span style="color: #b6a0ff;">if</span> (get-buffer new-name)
        (message <span style="color: #79a8ff;">"A buffer named '</span><span style="color: #00bcff;">%s</span><span style="color: #79a8ff;">' already exists!"</span> new-name)
      (<span style="color: #b6a0ff;">progn</span>
        (<span style="color: #b6a0ff;">when</span> (file-exists-p filename)
          (rename-file filename new-name 1))
        (rename-buffer new-name)
        (set-visited-file-name new-name)))))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c f r"</span>) 'ts-rename-this-file-and-buffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-org35db538" class="outline-3">
<h3 id="org35db538">Yank current file contents to kill ring</h3>
<div class="outline-text-3" id="text-org35db538">
<p>
Very useful for copying ssh public keys&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-copy-file-contents-to-clipboard</span> (file)
  <span style="color: #9ac8e0;">"Copy a file's contents to the clipboard."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"f"</span>)
  (<span style="color: #b6a0ff;">with-current-buffer</span> (find-file-noselect file)
    (kill-new (buffer-substring-no-properties (point-min) (point-max))))
  (message <span style="color: #79a8ff;">"Copied contents of %s to the clipboard"</span> file))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c f h"</span>) 'ts-copy-file-contents-to-clipboard)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9441b54" class="outline-3">
<h3 id="org9441b54">Yank current file name to kill ring</h3>
<div class="outline-text-3" id="text-org9441b54">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-copy-file-name-to-clipboard</span> (arg)
  <span style="color: #9ac8e0;">"Copy the current buffer file name to the clipboard.</span>
<span style="color: #9ac8e0;">With prefix ARG, omit path."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"P"</span>)
  (<span style="color: #b6a0ff;">let</span> ((filename (<span style="color: #b6a0ff;">if</span> (equal major-mode 'dired-mode)
                      (<span style="color: #b6a0ff;">if</span> arg
                          (file-name-nondirectory
                           (directory-file-name
                            (file-name-directory default-directory)))
                        default-directory)
                    (<span style="color: #b6a0ff;">if</span> arg
                        (file-name-nondirectory buffer-file-name)
                      (buffer-file-name)))))
    (<span style="color: #b6a0ff;">when</span> filename
      (kill-new filename)
      (message <span style="color: #79a8ff;">"Copied '</span><span style="color: #00bcff;">%s</span><span style="color: #79a8ff;">' to the clipboard."</span> filename))))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c f w"</span>) 'ts-copy-file-name-to-clipboard)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8c81705" class="outline-2">
<h2 id="org8c81705">Miscellaneous</h2>
<div class="outline-text-2" id="text-org8c81705">
</div>
<div id="outline-container-org29a0b34" class="outline-3">
<h3 id="org29a0b34">Byte compile and load on save</h3>
<div class="outline-text-3" id="text-org29a0b34">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-byte-compile-and-load</span> ()
  <span style="color: #9ac8e0;">"Byte compile Emacs Lisp files and load if ARG."</span>
  (<span style="color: #b6a0ff;">when</span> (<span style="color: #b6a0ff;">and</span> buffer-file-name
             (equal (file-name-extension buffer-file-name) <span style="color: #79a8ff;">"el"</span>)
             (equal major-mode 'emacs-lisp-mode))
    (byte-compile-file buffer-file-name)
    (message <span style="color: #79a8ff;">"Compiled %s :-)"</span> buffer-file-name)
    (load (file-name-sans-extension buffer-file-name))
    (message <span style="color: #79a8ff;">"Loaded %s :-)"</span> buffer-file-name)))

(add-hook 'after-save-hook 'ts-byte-compile-and-load)
</pre>
</div>
</div>
</div>
