README.org
** Ensure init files are byte compiled

This block will byte compile ~early-init.el~ and ~init.el~ if an existing
~.elc~ file is not up to date with their contents.

#+begin_src emacs-lisp
  (defun ts-ensure-byte-compiled-init ()
    "Run `byte-recompile-file' on config files with 'nil' FORCE and ARG 0.
  This means we don't compile if .elc is up to date but we always
  create a new .elc file if it doesn't already exist."
    (autoload 'byte-recompile-file "bytecomp")
    (if (file-readable-p (expand-file-name "early-init.el" user-emacs-directory))
        (byte-recompile-file (expand-file-name "early-init.el" user-emacs-directory) 'nil 0))
    (byte-recompile-file (expand-file-name "init.el" user-emacs-directory) 'nil 0))

  (add-hook 'after-init-hook 'ts-ensure-byte-compiled-init)
#+end_src

** Recompile config

#+begin_src emacs-lisp
  (defvar ts-files-to-recompile '("early-init.el" "init.el")
    "Files under `user-emacs-directory' that we use for configuration.")

  (defun ts-recompile-config ()
    "Recompile everything in Emacs configuration."
    (interactive)
    (mapc (lambda (file)
            (let ((path (expand-file-name file user-emacs-directory)))
              (when (file-readable-p path)
                (byte-recompile-file path t 0)
                (load (file-name-sans-extension path))
                (message "Re-compiled & loaded %s :-)" path))))
          ts-files-to-recompile))
#+end_src

** Tangle config

#+begin_src emacs-lisp
  (defun ts-tangle-config ()
    "Re-tangle my org mode configuration file."
    (interactive)
    (autoload 'org-babel-tangle-file "ob-tangle")
    (org-babel-tangle-file "~/src/emacs/README.org"))
#+end_src

* Window Functions
** Better scrolling of other windows

This is better, since I don't need to send prefix to ~scroll-other-window~.

#+begin_src emacs-lisp
  (defun ts-scroll-other-window (arg)
    "Scroll up other window when called with prefix."
    (interactive "P")
    (if arg (scroll-other-window-down) (scroll-other-window)))

  (global-set-key [remap scroll-other-window] 'ts-scroll-other-window)
#+end_src

** Kill buffer other window

#+begin_src emacs-lisp
  (defun ts-kill-buffer-other-window ()
    "Kill the buffer in the last used window."
    (interactive)
    ;; Window selection is used because point goes to a different window if more
    ;; than 2 windows are present
    (let ((current-window (selected-window))
          (other-window (get-mru-window t t t)))
      (select-window other-window)
      (kill-this-buffer)
      (select-window current-window)))

  (global-set-key (kbd "C-c w k") 'ts-kill-buffer-other-window)
#+end_src

** Switch to the previous window

This is basically ~other-window~ backwards.

#+begin_src emacs-lisp
  (defun ts-prev-window ()
    "Go the previously used window, excluding other frames."
    (interactive)
    (other-window -1))

  (global-set-key (kbd "C-x O") 'ts-prev-window)
#+end_src

** Toggle focus to last window

#+begin_src emacs-lisp
  (defun ts-last-window ()
    "Switch back and forth between two windows easily."
    (interactive)
    (let ((win (get-mru-window t t t)))
      (unless win (error "Last window not found"))
      (let ((frame (window-frame win)))
        (raise-frame frame)
        (select-frame frame)
        (select-window win))))

  (global-set-key (kbd "C-c w w") 'ts-last-window)
#+end_src

** Toggle maximize window

#+begin_src emacs-lisp
  (defun ts-toggle-maximize-window ()
    "Temporarily maximize a window."
    (interactive)
    (if (= 1 (length (window-list)))
        (jump-to-register '_)
      (progn
        (window-configuration-to-register '_)
        (delete-other-windows))))

  (global-set-key (kbd "C-c z") 'ts-toggle-maximize-window)
#+end_src

** Toggle vertical -> horizontal splits

#+begin_src emacs-lisp
  (defun ts-toggle-split ()
    "Switch window split from horizontally to vertically.
  Or vice versa. Change right window to bottom, or change bottom
  window to right."
    (interactive)
    (autoload 'windmove-find-other-window "windmove" nil t)
    (let ((done))
      (dolist (dirs '((right . down) (down . right)))
        (unless done
          (let* ((win (selected-window))
                 (nextdir (car dirs))
                 (neighbour-dir (cdr dirs))
                 (next-win (windmove-find-other-window nextdir win))
                 (neighbour1 (windmove-find-other-window neighbour-dir win))
                 (neighbour2 (if next-win
                                 (with-selected-window next-win
                                   (windmove-find-other-window
                                    neighbour-dir next-win)))))
            (setq done (and (eq neighbour1 neighbour2)
                            (not (eq (minibuffer-window) next-win))))
            (if done
                (let* ((other-buf (window-buffer next-win)))
                  (delete-window next-win)
                  (if (eq nextdir 'right)
                      (split-window-vertically)
                    (split-window-horizontally))
                  (set-window-buffer
                   (windmove-find-other-window neighbour-dir)
                   other-buf))))))))

  (global-set-key (kbd "C-c w s") 'ts-toggle-split)
#+end_src

