index.html

<div id="outline-container-org9263a7a" class="outline-3">
<h3 id="org9263a7a">Ensure init files are byte compiled</h3>
<div class="outline-text-3" id="text-org9263a7a">
<p>
This block will byte compile <code>early-init.el</code> and <code>init.el</code> if an existing
<code>.elc</code> file is not up to date with their contents.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-ensure-byte-compiled-init</span> ()
  <span style="color: #9ac8e0;">"Run `</span><span style="color: #00bcff;">byte-recompile-file</span><span style="color: #9ac8e0;">' on config files with '</span><span style="color: #00bcff;">nil</span><span style="color: #9ac8e0;">' FORCE and ARG 0.</span>
<span style="color: #9ac8e0;">This means we don't compile if .elc is up to date but we always</span>
<span style="color: #9ac8e0;">create a new .elc file if it doesn't already exist."</span>
  (autoload 'byte-recompile-file <span style="color: #79a8ff;">"bytecomp"</span>)
  (<span style="color: #b6a0ff;">if</span> (file-readable-p (expand-file-name <span style="color: #79a8ff;">"early-init.el"</span> user-emacs-directory))
      (byte-recompile-file (expand-file-name <span style="color: #79a8ff;">"early-init.el"</span> user-emacs-directory) 'nil 0))
  (byte-recompile-file (expand-file-name <span style="color: #79a8ff;">"init.el"</span> user-emacs-directory) 'nil 0))

(add-hook 'after-init-hook 'ts-ensure-byte-compiled-init)
</pre>
</div>
</div>
</div>

<div id="outline-container-org22aef4f" class="outline-3">
<h3 id="org22aef4f">Recompile config</h3>
<div class="outline-text-3" id="text-org22aef4f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defvar</span> <span style="color: #00d3d0;">ts-files-to-recompile</span> '(<span style="color: #79a8ff;">"early-init.el"</span> <span style="color: #79a8ff;">"init.el"</span>)
  <span style="color: #9ac8e0;">"Files under `</span><span style="color: #00bcff;">user-emacs-directory</span><span style="color: #9ac8e0;">' that we use for configuration."</span>)

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-recompile-config</span> ()
  <span style="color: #9ac8e0;">"Recompile everything in Emacs configuration."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (mapc (<span style="color: #b6a0ff;">lambda</span> (file)
          (<span style="color: #b6a0ff;">let</span> ((path (expand-file-name file user-emacs-directory)))
            (<span style="color: #b6a0ff;">when</span> (file-readable-p path)
              (byte-recompile-file path t 0)
              (load (file-name-sans-extension path))
              (message <span style="color: #79a8ff;">"Re-compiled &amp; loaded %s :-)"</span> path))))
        ts-files-to-recompile))
</pre>
</div>
</div>
</div>

<div id="outline-container-org768f66b" class="outline-3">
<h3 id="org768f66b">Tangle config</h3>
<div class="outline-text-3" id="text-org768f66b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-tangle-config</span> ()
  <span style="color: #9ac8e0;">"Re-tangle my org mode configuration file."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (autoload 'org-babel-tangle-file <span style="color: #79a8ff;">"ob-tangle"</span>)
  (org-babel-tangle-file <span style="color: #79a8ff;">"~/src/emacs/README.org"</span>))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6edaabc" class="outline-2">
<h2 id="org6edaabc">Window Functions</h2>
<div class="outline-text-2" id="text-org6edaabc">
</div>
<div id="outline-container-org7f2d39e" class="outline-3">
<h3 id="org7f2d39e">Better scrolling of other windows</h3>
<div class="outline-text-3" id="text-org7f2d39e">
<p>
This is better, since I don't need to send prefix to <code>scroll-other-window</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-scroll-other-window</span> (arg)
  <span style="color: #9ac8e0;">"Scroll up other window when called with prefix."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"P"</span>)
  (<span style="color: #b6a0ff;">if</span> arg (scroll-other-window-down) (scroll-other-window)))

(global-set-key [remap scroll-other-window] 'ts-scroll-other-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-org24a8b46" class="outline-3">
<h3 id="org24a8b46">Kill buffer other window</h3>
<div class="outline-text-3" id="text-org24a8b46">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-kill-buffer-other-window</span> ()
  <span style="color: #9ac8e0;">"Kill the buffer in the last used window."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  <span style="color: #989898;">;; </span><span style="color: #989898;">Window selection is used because point goes to a different window if more</span>
  <span style="color: #989898;">;; </span><span style="color: #989898;">than 2 windows are present</span>
  (<span style="color: #b6a0ff;">let</span> ((current-window (selected-window))
        (other-window (get-mru-window t t t)))
    (select-window other-window)
    (kill-this-buffer)
    (select-window current-window)))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c w k"</span>) 'ts-kill-buffer-other-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-org07725e6" class="outline-3">
<h3 id="org07725e6">Switch to the previous window</h3>
<div class="outline-text-3" id="text-org07725e6">
<p>
This is basically <code>other-window</code> backwards.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-prev-window</span> ()
  <span style="color: #9ac8e0;">"Go the previously used window, excluding other frames."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (other-window -1))

(global-set-key (kbd <span style="color: #79a8ff;">"C-x O"</span>) 'ts-prev-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4b2d127" class="outline-3">
<h3 id="org4b2d127">Toggle focus to last window</h3>
<div class="outline-text-3" id="text-org4b2d127">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-last-window</span> ()
  <span style="color: #9ac8e0;">"Switch back and forth between two windows easily."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> ((win (get-mru-window t t t)))
    (<span style="color: #b6a0ff;">unless</span> win (<span style="color: #fec43f;">error</span> <span style="color: #79a8ff;">"Last window not found"</span>))
    (<span style="color: #b6a0ff;">let</span> ((frame (window-frame win)))
      (raise-frame frame)
      (select-frame frame)
      (select-window win))))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c w w"</span>) 'ts-last-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfe403ef" class="outline-3">
<h3 id="orgfe403ef">Toggle maximize window</h3>
<div class="outline-text-3" id="text-orgfe403ef">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-toggle-maximize-window</span> ()
  <span style="color: #9ac8e0;">"Temporarily maximize a window."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">if</span> (= 1 (length (window-list)))
      (jump-to-register '_)
    (<span style="color: #b6a0ff;">progn</span>
      (window-configuration-to-register '_)
      (delete-other-windows))))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c z"</span>) 'ts-toggle-maximize-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-org43cebee" class="outline-3">
<h3 id="org43cebee">Toggle vertical -&gt; horizontal splits</h3>
<div class="outline-text-3" id="text-org43cebee">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-toggle-split</span> ()
  <span style="color: #9ac8e0;">"Switch window split from horizontally to vertically.</span>
<span style="color: #9ac8e0;">Or vice versa. Change right window to bottom, or change bottom</span>
<span style="color: #9ac8e0;">window to right."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (autoload 'windmove-find-other-window <span style="color: #79a8ff;">"windmove"</span> nil t)
  (<span style="color: #b6a0ff;">let</span> ((done))
    (<span style="color: #b6a0ff;">dolist</span> (dirs '((right . down) (down . right)))
      (<span style="color: #b6a0ff;">unless</span> done
        (<span style="color: #b6a0ff;">let*</span> ((win (selected-window))
               (nextdir (car dirs))
               (neighbour-dir (cdr dirs))
               (next-win (windmove-find-other-window nextdir win))
               (neighbour1 (windmove-find-other-window neighbour-dir win))
               (neighbour2 (<span style="color: #b6a0ff;">if</span> next-win
                               (<span style="color: #b6a0ff;">with-selected-window</span> next-win
                                 (windmove-find-other-window
                                  neighbour-dir next-win)))))
          (<span style="color: #b6a0ff;">setq</span> done (<span style="color: #b6a0ff;">and</span> (eq neighbour1 neighbour2)
                          (not (eq (minibuffer-window) next-win))))
          (<span style="color: #b6a0ff;">if</span> done
              (<span style="color: #b6a0ff;">let*</span> ((other-buf (window-buffer next-win)))
                (delete-window next-win)
                (<span style="color: #b6a0ff;">if</span> (eq nextdir 'right)
                    (split-window-vertically)
                  (split-window-horizontally))
                (set-window-buffer
                 (windmove-find-other-window neighbour-dir)
                 other-buf))))))))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c w s"</span>) 'ts-toggle-split)
</pre>
</div>
</div>
</div>
