README.org
** Transpose windows

#+begin_src emacs-lisp
  (defun ts-transpose-windows (arg)
    "Transpose windows.  Use prefix ARG to transpose in the other direction."
    (interactive "P")
    (if (not (> (count-windows) 1))
        (message "You can't rotate a single window!")
      (let* ((rotate-times (prefix-numeric-value arg))
             (direction (if (or (< rotate-times 0) (equal arg '(4)))
                            'reverse 'identity)))
        (dotimes (_ (abs rotate-times))
          (dotimes (i (- (count-windows) 1))
            (let* ((w1 (elt (funcall direction (window-list)) i))
                   (w2 (elt (funcall direction (window-list)) (+ i 1)))
                   (b1 (window-buffer w1))
                   (b2 (window-buffer w2))
                   (s1 (window-start w1))
                   (s2 (window-start w2))
                   (p1 (window-point w1))
                   (p2 (window-point w2)))
              (set-window-buffer-start-and-point w1 b2 s2 p2)
              (set-window-buffer-start-and-point w2 b1 s1 p1)))))))

  (define-key ctl-x-4-map "t" 'ts-transpose-windows)
#+end_src

* Emacs Packages
** Ansi Color

#+begin_src emacs-lisp
  (add-to-list 'comint-output-filter-functions 'ansi-color-process-output)
  (defun colorize-compilation-buffer ()
    "ANSI color in compilation buffer."
    (ansi-color-apply-on-region compilation-filter-start (point)))
  (add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
  (add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
#+end_src

#+begin_src emacs-lisp
  (defun ts-display-ansi-colors ()
    (interactive)
    (ansi-color-apply-on-region (point-min) (point-max)))
#+end_src

Make sure we show colors when we run commands with ~M-!~

#+begin_src emacs-lisp
  (defadvice display-message-or-buffer (before ansi-color activate)
    "Process ANSI color codes in shell output."
    (let ((buf (ad-get-arg 0)))
      (and (bufferp buf)
           (string= (buffer-name buf) "*Shell Command Output*")
           (with-current-buffer buf
             (ansi-color-apply-on-region (point-min) (point-max))))))
#+end_src

** Auto-fill

#+begin_src emacs-lisp
  (use-package auto-fill-mode
    :config
    (setq-default fill-column 79)
    (defun ts-fill-or-unfill ()
      "Like `fill-paragraph', but unfill if used twice."
      (interactive)
      (let ((fill-column
             (if (eq last-command 'ts-fill-or-unfill)
                 (progn (setq this-command nil)
                        (point-max))
               fill-column)))
        (call-interactively #'fill-paragraph)))

    (defun ts-unfill-region (beg end)
      "Unfill the region from BEG to END.
  Joining text paragraphs into a single logical line. This is
  useful, e.g., for use with function `visual-line-mode'."
      (interactive "*r")
      (let ((fill-column (point-max)))
        (fill-region beg end)))
    :bind
    ([remap fill-paragraph] . ts-fill-or-unfill)
    ("C-M-q" . ts-unfill-region)
    :hook
    (org-mode . auto-fill-mode)
    (text-mode . auto-fill-mode))
#+end_src

** Auto-revert

#+begin_src emacs-lisp
  (use-package auto-revert :hook (after-init . global-auto-revert-mode))
#+end_src

** Column Number

#+begin_src emacs-lisp
  (use-package column-number-mode :hook (after-init . column-number-mode))
#+end_src

** Dabbrev

#+begin_src emacs-lisp
  (use-package dabbrev
    :config
    (setq abbrev-file-name (concat user-emacs-directory "abbrevs"))
    (setq save-abbrevs 'silently)
    (setq abbrev-suggest t)
    (setq dabbrev-abbrev-char-regexp "\\sw\\|\\s_")
    (setq dabbrev-abbrev-skip-leading-regexp "[$*/=']")
    (setq dabbrev-backward-only nil)
    (setq dabbrev-case-distinction 'case-replace)
    (setq dabbrev-case-fold-search t)
    (setq dabbrev-case-replace 'case-replace)
    (setq dabbrev-check-other-buffers t)
    (setq dabbrev-eliminate-newlines t)
    (setq dabbrev-upcase-means-case-search t))
#+end_src

