index.html

<div id="outline-container-org2b4188b" class="outline-3">
<h3 id="org2b4188b">Transpose windows</h3>
<div class="outline-text-3" id="text-org2b4188b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-transpose-windows</span> (arg)
  <span style="color: #9ac8e0;">"Transpose windows.  Use prefix ARG to transpose in the other direction."</span>
  (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"P"</span>)
  (<span style="color: #b6a0ff;">if</span> (not (&gt; (count-windows) 1))
      (message <span style="color: #79a8ff;">"You can't rotate a single window!"</span>)
    (<span style="color: #b6a0ff;">let*</span> ((rotate-times (prefix-numeric-value arg))
           (direction (<span style="color: #b6a0ff;">if</span> (<span style="color: #b6a0ff;">or</span> (&lt; rotate-times 0) (equal arg '(4)))
                          'reverse 'identity)))
      (<span style="color: #b6a0ff;">dotimes</span> (_ (abs rotate-times))
        (<span style="color: #b6a0ff;">dotimes</span> (i (- (count-windows) 1))
          (<span style="color: #b6a0ff;">let*</span> ((w1 (elt (funcall direction (window-list)) i))
                 (w2 (elt (funcall direction (window-list)) (+ i 1)))
                 (b1 (window-buffer w1))
                 (b2 (window-buffer w2))
                 (s1 (window-start w1))
                 (s2 (window-start w2))
                 (p1 (window-point w1))
                 (p2 (window-point w2)))
            (set-window-buffer-start-and-point w1 b2 s2 p2)
            (set-window-buffer-start-and-point w2 b1 s1 p1)))))))

(define-key ctl-x-4-map <span style="color: #79a8ff;">"t"</span> 'ts-transpose-windows)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6f6733a" class="outline-2">
<h2 id="org6f6733a">Emacs Packages</h2>
<div class="outline-text-2" id="text-org6f6733a">
</div>
<div id="outline-container-orgb261b4f" class="outline-3">
<h3 id="orgb261b4f">Ansi Color</h3>
<div class="outline-text-3" id="text-orgb261b4f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'comint-output-filter-functions 'ansi-color-process-output)
(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">colorize-compilation-buffer</span> ()
  <span style="color: #9ac8e0;">"ANSI color in compilation buffer."</span>
  (ansi-color-apply-on-region compilation-filter-start (point)))
(add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-display-ansi-colors</span> ()
  (<span style="color: #b6a0ff;">interactive</span>)
  (ansi-color-apply-on-region (point-min) (point-max)))
</pre>
</div>

<p>
Make sure we show colors when we run commands with <code>M-!</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defadvice</span> <span style="color: #feacd0;">display-message-or-buffer</span> (before ansi-color activate)
  <span style="color: #9ac8e0;">"Process ANSI color codes in shell output."</span>
  (<span style="color: #b6a0ff;">let</span> ((buf (ad-get-arg 0)))
    (<span style="color: #b6a0ff;">and</span> (bufferp buf)
         (string= (buffer-name buf) <span style="color: #79a8ff;">"*Shell Command Output*"</span>)
         (<span style="color: #b6a0ff;">with-current-buffer</span> buf
           (ansi-color-apply-on-region (point-min) (point-max))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org91ecd06" class="outline-3">
<h3 id="org91ecd06">Auto-fill</h3>
<div class="outline-text-3" id="text-org91ecd06">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">auto-fill-mode</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq-default</span> fill-column 79)
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-fill-or-unfill</span> ()
    <span style="color: #9ac8e0;">"Like `</span><span style="color: #00bcff;">fill-paragraph</span><span style="color: #9ac8e0;">', but unfill if used twice."</span>
    (<span style="color: #b6a0ff;">interactive</span>)
    (<span style="color: #b6a0ff;">let</span> ((fill-column
           (<span style="color: #b6a0ff;">if</span> (eq last-command 'ts-fill-or-unfill)
               (<span style="color: #b6a0ff;">progn</span> (<span style="color: #b6a0ff;">setq</span> this-command nil)
                      (point-max))
             fill-column)))
      (call-interactively #'fill-paragraph)))

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-unfill-region</span> (beg end)
    <span style="color: #9ac8e0;">"Unfill the region from BEG to END.</span>
<span style="color: #9ac8e0;">Joining text paragraphs into a single logical line. This is</span>
<span style="color: #9ac8e0;">useful, e.g., for use with function `</span><span style="color: #00bcff;">visual-line-mode</span><span style="color: #9ac8e0;">'."</span>
    (<span style="color: #b6a0ff;">interactive</span> <span style="color: #79a8ff;">"*r"</span>)
    (<span style="color: #b6a0ff;">let</span> ((fill-column (point-max)))
      (fill-region beg end)))
  <span style="color: #f78fe7;">:bind</span>
  ([remap fill-paragraph] . ts-fill-or-unfill)
  (<span style="color: #79a8ff;">"C-M-q"</span> . ts-unfill-region)
  <span style="color: #f78fe7;">:hook</span>
  (org-mode . auto-fill-mode)
  (text-mode . auto-fill-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org76b7b5b" class="outline-3">
<h3 id="org76b7b5b">Auto-revert</h3>
<div class="outline-text-3" id="text-org76b7b5b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">auto-revert</span> <span style="color: #f78fe7;">:hook</span> (after-init . global-auto-revert-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4843f2a" class="outline-3">
<h3 id="org4843f2a">Column Number</h3>
<div class="outline-text-3" id="text-org4843f2a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">column-number-mode</span> <span style="color: #f78fe7;">:hook</span> (after-init . column-number-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd83de62" class="outline-3">
<h3 id="orgd83de62">Dabbrev</h3>
<div class="outline-text-3" id="text-orgd83de62">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">dabbrev</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> abbrev-file-name (concat user-emacs-directory <span style="color: #79a8ff;">"abbrevs"</span>))
  (<span style="color: #b6a0ff;">setq</span> save-abbrevs 'silently)
  (<span style="color: #b6a0ff;">setq</span> abbrev-suggest t)
  (<span style="color: #b6a0ff;">setq</span> dabbrev-abbrev-char-regexp <span style="color: #79a8ff;">"\\sw</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">|</span><span style="color: #79a8ff;">\\s_"</span>)
  (<span style="color: #b6a0ff;">setq</span> dabbrev-abbrev-skip-leading-regexp <span style="color: #79a8ff;">"[$*/=']"</span>)
  (<span style="color: #b6a0ff;">setq</span> dabbrev-backward-only nil)
  (<span style="color: #b6a0ff;">setq</span> dabbrev-case-distinction 'case-replace)
  (<span style="color: #b6a0ff;">setq</span> dabbrev-case-fold-search t)
  (<span style="color: #b6a0ff;">setq</span> dabbrev-case-replace 'case-replace)
  (<span style="color: #b6a0ff;">setq</span> dabbrev-check-other-buffers t)
  (<span style="color: #b6a0ff;">setq</span> dabbrev-eliminate-newlines t)
  (<span style="color: #b6a0ff;">setq</span> dabbrev-upcase-means-case-search t))
</pre>
</div>
</div>
</div>
