README.org
** Dired

#+begin_src emacs-lisp
  (use-package dired
    :config
    (defun ts-dired-get-size ()
      "Get cumlative size of marked or current item."
      (interactive)
      (let ((files (dired-get-marked-files)))
        (with-temp-buffer
          (apply 'call-process "/usr/bin/du" nil t nil "-sch" files)
          (message "Size of all marked files: %s"
                   (progn
                     (re-search-backward "\\(^[0-9.,]+[A-Za-z]+\\).*total$")
                     (match-string 1))))))

    (defun ts-dired-beginning-of-buffer ()
      "Go to first file in directory."
      (interactive)
      (goto-char (point-min))
      (dired-next-line 2))

    (defun ts-dired-end-of-buffer ()
      "Go to last file in directory."
      (interactive)
      (goto-char (point-max))
      (dired-next-line -1))

    (defun ts-dired-up-directory ()
      (interactive)
      (find-alternate-file ".."))

    (autoload 'dired-omit-mode "dired-x" nil t)
    (autoload 'dired-omit-files "dired-x" nil t)

    (when (eq system-type 'darwin) (setq dired-listing-switches "-alh"))
    (when (eq system-type 'berkeley-unix) (setq dired-listing-switches "-alhpL"))
    (when (eq system-type 'gnu/linux) (setq dired-listing-switches "-AGFhlv"))

    (setq dired-omit-files "\\`[.]?#\\|\\`[.][.]?\\'\\|^\\..+$"
          dired-dwim-target t
          delete-by-moving-to-trash t
          dired-use-ls-dired nil
          dired-recursive-copies 'always
          dired-recursive-deletes 'always)

    :bind (:map dired-mode-map
                (")" . dired-omit-mode)
                ("<" . ts-dired-beginning-of-buffer)
                (">" . ts-dired-end-of-buffer)
                ("?" . ts-dired-get-size)
                ("b" . ts-dired-up-directory)
                ("c" . dired-do-compress-to)
                ("f" . 'dired-find-alternate-file)))
#+end_src

*** Dired AUX

#+begin_src emacs-lisp
  (use-package dired-aux
    :after dired
    :config
    (setq dired-isearch-filenames 'dwim)
    (setq dired-create-destination-dirs 'ask)
    (setq dired-vc-rename-file t))
#+end_src

*** Find Dired

#+begin_src emacs-lisp
  (use-package find-dired
    :config
    (setq find-ls-option '("-ls" . "-AGFhlv"))
    (setq find-name-arg "-iname"))
#+end_src

*** Writeable Dired

#+begin_src emacs-lisp
  (use-package wdired
    :config
    (setq wdired-allow-to-change-permissions t)
    (setq wdired-create-parent-directories t))
#+end_src

** Doc View

#+begin_src emacs-lisp
  (use-package doc-view-mode
    :config
    (setq doc-view-continuous t)
    (setq doc-view-resolution 300))
#+end_src

** Ediff

#+begin_src emacs-lisp
  (use-package ediff
    :config
    (setq ediff-diff-options "-w")
    (setq ediff-keep-variants nil)
    (setq ediff-make-buffers-readonly-at-startup nil)
    (setq ediff-merge-revisions-with-ancestor t)
    (setq ediff-show-clashes-only t)
    (setq ediff-split-window-function 'split-window-horizontally)
    (setq ediff-window-setup-function 'ediff-setup-windows-plain)
    ;; https://emacs.stackexchange.com/a/24602
    (defun disable-y-or-n-p (orig-fun &rest args)
      "Advise ORIG-FUN with ARGS so it dynamically rebinds `y-or-n-p'."
      (cl-letf (((symbol-function 'y-or-n-p) (lambda () t)))
        (apply orig-fun args)))
    (advice-add 'ediff-quit :around #'disable-y-or-n-p)
    :hook
    (ediff-after-quit-hook-internal . winner-undo))
#+end_src

** Eglot

Emacs Polyglot: an Emacs LSP client that stays out of your way.

https://github.com/joaotavora/eglot

The Language Server Protocol (LSP) defines the protocol used between an editor
or IDE and a language server that provides language features like auto
complete, go to definition, find all references etc. The goal of the Language
Server Index Format (LSIF, pronounced like "else if") is to support rich code
navigation in development tools or a Web UI without needing a local copy of the
source code.

https://microsoft.github.io/language-server-protocol/

#+begin_src shell :tangle no
  pip install python-lsp-server
  go install golang.org/x/tools/gopls@latest
  npm install -g typescript-language-server typescript
  npm install -g bash-language-server
  npm install -g dockerfile-language-server-nodejs
#+end_src

#+begin_src emacs-lisp
  (use-package eglot
    :hook
    (prog-mode . eglot-ensure)
    (shell-script-mode . eglot-ensure))
#+end_src

** Eldoc

#+begin_src emacs-lisp
  (add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
  (add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
  (add-hook 'lisp-mode-hook 'eldoc-mode)
#+end_src

** Electric

#+begin_src emacs-lisp
  (add-hook 'after-init-hook 'electric-indent-mode)
  ;; (add-hook 'text-mode-hook 'electric-quote-mode)
  (add-hook 'after-init-hook 'electric-pair-mode)
#+end_src

