index.html

<div id="outline-container-org5107cb5" class="outline-3">
<h3 id="org5107cb5">Dired</h3>
<div class="outline-text-3" id="text-org5107cb5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">dired</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-dired-get-size</span> ()
    <span style="color: #9ac8e0;">"Get cumlative size of marked or current item."</span>
    (<span style="color: #b6a0ff;">interactive</span>)
    (<span style="color: #b6a0ff;">let</span> ((files (dired-get-marked-files)))
      (<span style="color: #b6a0ff;">with-temp-buffer</span>
        (apply 'call-process <span style="color: #79a8ff;">"/usr/bin/du"</span> nil t nil <span style="color: #79a8ff;">"-sch"</span> files)
        (message <span style="color: #79a8ff;">"Size of all marked files: %s"</span>
                 (<span style="color: #b6a0ff;">progn</span>
                   (re-search-backward <span style="color: #79a8ff;">"</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">(</span><span style="color: #79a8ff;">^[0-9.,]+[A-Za-z]+</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">)</span><span style="color: #79a8ff;">.*total$"</span>)
                   (match-string 1))))))

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-dired-beginning-of-buffer</span> ()
    <span style="color: #9ac8e0;">"Go to first file in directory."</span>
    (<span style="color: #b6a0ff;">interactive</span>)
    (goto-char (point-min))
    (dired-next-line 2))

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-dired-end-of-buffer</span> ()
    <span style="color: #9ac8e0;">"Go to last file in directory."</span>
    (<span style="color: #b6a0ff;">interactive</span>)
    (goto-char (point-max))
    (dired-next-line -1))

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-dired-up-directory</span> ()
    (<span style="color: #b6a0ff;">interactive</span>)
    (find-alternate-file <span style="color: #79a8ff;">".."</span>))

  (autoload 'dired-omit-mode <span style="color: #79a8ff;">"dired-x"</span> nil t)
  (autoload 'dired-omit-files <span style="color: #79a8ff;">"dired-x"</span> nil t)

  (<span style="color: #b6a0ff;">when</span> (eq system-type 'darwin) (<span style="color: #b6a0ff;">setq</span> dired-listing-switches <span style="color: #79a8ff;">"-alh"</span>))
  (<span style="color: #b6a0ff;">when</span> (eq system-type 'berkeley-unix) (<span style="color: #b6a0ff;">setq</span> dired-listing-switches <span style="color: #79a8ff;">"-alhpL"</span>))
  (<span style="color: #b6a0ff;">when</span> (eq system-type 'gnu/linux) (<span style="color: #b6a0ff;">setq</span> dired-listing-switches <span style="color: #79a8ff;">"-AGFhlv"</span>))

  (<span style="color: #b6a0ff;">setq</span> dired-omit-files <span style="color: #79a8ff;">"\\`[.]?#</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">|</span><span style="color: #79a8ff;">\\`[.][.]?\\'</span><span style="color: #feacd0;">\\</span><span style="color: #00c06f;">|</span><span style="color: #79a8ff;">^\\..+$"</span>
        dired-dwim-target t
        delete-by-moving-to-trash t
        dired-use-ls-dired nil
        dired-recursive-copies 'always
        dired-recursive-deletes 'always)

  <span style="color: #f78fe7;">:bind</span> (<span style="color: #f78fe7;">:map</span> dired-mode-map
              (<span style="color: #79a8ff;">")"</span> . dired-omit-mode)
              (<span style="color: #79a8ff;">"&lt;"</span> . ts-dired-beginning-of-buffer)
              (<span style="color: #79a8ff;">"&gt;"</span> . ts-dired-end-of-buffer)
              (<span style="color: #79a8ff;">"?"</span> . ts-dired-get-size)
              (<span style="color: #79a8ff;">"b"</span> . ts-dired-up-directory)
              (<span style="color: #79a8ff;">"c"</span> . dired-do-compress-to)
              (<span style="color: #79a8ff;">"f"</span> . 'dired-find-alternate-file)))
</pre>
</div>
</div>

<div id="outline-container-orgb95f247" class="outline-4">
<h4 id="orgb95f247">Dired AUX</h4>
<div class="outline-text-4" id="text-orgb95f247">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">dired-aux</span>
  <span style="color: #f78fe7;">:after</span> dired
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> dired-isearch-filenames 'dwim)
  (<span style="color: #b6a0ff;">setq</span> dired-create-destination-dirs 'ask)
  (<span style="color: #b6a0ff;">setq</span> dired-vc-rename-file t))
</pre>
</div>
</div>
</div>

<div id="outline-container-org561ffdb" class="outline-4">
<h4 id="org561ffdb">Find Dired</h4>
<div class="outline-text-4" id="text-org561ffdb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">find-dired</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> find-ls-option '(<span style="color: #79a8ff;">"-ls"</span> . <span style="color: #79a8ff;">"-AGFhlv"</span>))
  (<span style="color: #b6a0ff;">setq</span> find-name-arg <span style="color: #79a8ff;">"-iname"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc2346a3" class="outline-4">
<h4 id="orgc2346a3">Writeable Dired</h4>
<div class="outline-text-4" id="text-orgc2346a3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">wdired</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> wdired-allow-to-change-permissions t)
  (<span style="color: #b6a0ff;">setq</span> wdired-create-parent-directories t))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8c5e3a8" class="outline-3">
<h3 id="org8c5e3a8">Doc View</h3>
<div class="outline-text-3" id="text-org8c5e3a8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">doc-view-mode</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> doc-view-continuous t)
  (<span style="color: #b6a0ff;">setq</span> doc-view-resolution 300))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1643f9d" class="outline-3">
<h3 id="org1643f9d">Ediff</h3>
<div class="outline-text-3" id="text-org1643f9d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">ediff</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> ediff-diff-options <span style="color: #79a8ff;">"-w"</span>)
  (<span style="color: #b6a0ff;">setq</span> ediff-keep-variants nil)
  (<span style="color: #b6a0ff;">setq</span> ediff-make-buffers-readonly-at-startup nil)
  (<span style="color: #b6a0ff;">setq</span> ediff-merge-revisions-with-ancestor t)
  (<span style="color: #b6a0ff;">setq</span> ediff-show-clashes-only t)
  (<span style="color: #b6a0ff;">setq</span> ediff-split-window-function 'split-window-horizontally)
  (<span style="color: #b6a0ff;">setq</span> ediff-window-setup-function 'ediff-setup-windows-plain)
  <span style="color: #989898;">;; </span><span style="color: #989898;">https://emacs.stackexchange.com/a/24602</span>
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">disable-y-or-n-p</span> (orig-fun <span style="color: #6ae4b9;">&amp;rest</span> args)
    <span style="color: #9ac8e0;">"Advise ORIG-FUN with ARGS so it dynamically rebinds `</span><span style="color: #00bcff;">y-or-n-p</span><span style="color: #9ac8e0;">'."</span>
    (<span style="color: #b6a0ff;">cl-letf</span> (((symbol-function 'y-or-n-p) (<span style="color: #b6a0ff;">lambda</span> () t)))
      (apply orig-fun args)))
  (advice-add 'ediff-quit <span style="color: #f78fe7;">:around</span> #'disable-y-or-n-p)
  <span style="color: #f78fe7;">:hook</span>
  (ediff-after-quit-hook-internal . winner-undo))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b26a5c" class="outline-3">
<h3 id="org0b26a5c">Eglot</h3>
<div class="outline-text-3" id="text-org0b26a5c">
<p>
Emacs Polyglot: an Emacs LSP client that stays out of your way.
</p>

<p>
<a href="https://github.com/joaotavora/eglot">https://github.com/joaotavora/eglot</a>
</p>

<p>
The Language Server Protocol (LSP) defines the protocol used between an editor
or IDE and a language server that provides language features like auto
complete, go to definition, find all references etc. The goal of the Language
Server Index Format (LSIF, pronounced like "else if") is to support rich code
navigation in development tools or a Web UI without needing a local copy of the
source code.
</p>

<p>
<a href="https://microsoft.github.io/language-server-protocol/">https://microsoft.github.io/language-server-protocol/</a>
</p>

<div class="org-src-container">
<pre class="src src-shell">pip install python-lsp-server
go install golang.org/x/tools/gopls@latest
npm install -g typescript-language-server typescript
npm install -g bash-language-server
npm install -g dockerfile-language-server-nodejs
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">eglot</span>
  <span style="color: #f78fe7;">:hook</span>
  (prog-mode . eglot-ensure)
  (shell-script-mode . eglot-ensure))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb83839" class="outline-3">
<h3 id="orgeb83839">Eldoc</h3>
<div class="outline-text-3" id="text-orgeb83839">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
(add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
(add-hook 'lisp-mode-hook 'eldoc-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0be56cc" class="outline-3">
<h3 id="org0be56cc">Electric</h3>
<div class="outline-text-3" id="text-org0be56cc">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'electric-indent-mode)
<span style="color: #989898;">;; </span><span style="color: #989898;">(add-hook 'text-mode-hook 'electric-quote-mode)</span>
(add-hook 'after-init-hook 'electric-pair-mode)
</pre>
</div>
</div>
</div>
