README.org
** ERC

#+begin_src emacs-lisp
  (use-package erc
    :config
    (setq erc-autojoin-channels-alist '(("freenode.net" "#emacs")))
    (setq erc-fill-column 80)
    (setq erc-hide-list '("JOIN" "PART" "QUIT"))
    (setq erc-input-line-position -2)
    (setq erc-keywords '("knowayback"))
    (setq erc-nick "knowayback")
    (setq erc-prompt-for-password t)
    (setq erc-track-enable-keybindings t))
#+end_src

** Eshell

#+begin_src emacs-lisp
  (use-package eshell
    :config
    (defun ts-eshell-prompt ()
      "Custom eshell prompt."
      (concat
       (propertize (user-login-name) 'face `(:foreground "green" ))
       (propertize "@" 'face `(:foreground "yellow"))
       (propertize (system-name) `face `(:foreground "green"))
       (propertize ":" 'face `(:foreground "yellow"))
       (if (string= (eshell/pwd) (getenv "HOME"))
           (propertize "~" 'face `(:foreground "magenta"))
         (propertize (eshell/basename (eshell/pwd)) 'face `(:foreground "magenta")))
       "\n"
       (if (= (user-uid) 0)
           (propertize "#" 'face `(:foreground "red"))
         (propertize "$" 'face `(:foreground "yellow")))
       (propertize " " 'face `(:foreground "white"))))
    ;; https://www.emacswiki.org/emacs/EshellPrompt
    (setq eshell-cd-on-directory t
          eshell-destroy-buffer-when-process-dies t
          eshell-highlight-prompt nil
          eshell-hist-ignoredups t
          eshell-history-size 4096
          eshell-ls-use-colors t
          eshell-prefer-lisp-functions t
          eshell-prefer-lisp-variables t
          eshell-prompt-regexp "^[^#$\n]*[#$] "
          eshell-prompt-function 'ts-eshell-prompt
          eshell-review-quick-commands nil
          eshell-save-history-on-exit t
          eshell-smart-space-goes-to-end t
          eshell-where-to-jump 'begin)
    (add-to-list 'eshell-modules-list 'eshell-tramp)
    :bind
    ("C-c e" . eshell)
    :hook
    (eshell-preoutput-filter-functions . ansi-color-apply))
#+end_src

** Flymake

#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook 'flymake-mode)
#+end_src

** Flyspell

Don't bother using this on Windows as I can rather be bothered to install
[[http://aspell.net/win32/][Aspell]] for Windows.

#+begin_src emacs-lisp :tangle (if (eq system-type 'windows-nt) "no" init-file)
  (unless (eq system-type 'windows-nt)
    (add-hook 'text-mode-hook 'flyspell-mode)
    (add-hook 'org-mode-hook 'flyspell-mode)
    (add-hook 'prog-mode-hook 'flyspell-prog-mode))
#+end_src

** Gnus

#+begin_src emacs-lisp
  (use-package gnus
    :config
    (setq gnus-init-file "~/.emacs.d/init.el")
    (setq gnus-home-directory "~/.emacs.d/")
    (setq message-directory "~/.emacs.d/mail")
    (setq gnus-directory "~/.emacs.d/news")
    (setq nnfolder-directory "~/.emacs.d/mail/archive")
    (setq gnus-use-full-window nil)
    (setq gnus-select-method '(nntp "news.gwene.org"))
    ;; (setq gnus-secondary-select-methods '((nntp "news.gnus.org")))
    (setq gnus-summary-thread-gathering-function 'gnus-gather-threads-by-subject)
    (setq gnus-thread-hide-subtree t)
    (setq gnus-thread-ignore-subject t)
    :commands (gnus))
#+end_src

** Hide/Show

#+begin_src emacs-lisp
  (add-hook 'shell-script-mode-hook 'hs-minor-mode)
  (add-hook 'prog-mode-hook 'hs-minor-mode)
#+end_src

** Highlight line

#+begin_src emacs-lisp
  (add-hook 'dired-mode-hook 'hl-line-mode)
  (add-hook 'org-mode-hook 'hl-line-mode)
  (add-hook 'prog-mode-hook 'hl-line-mode)
  (add-hook 'shell-script-mode-hook 'hl-line-mode)
  (add-hook 'text-mode-hook 'hl-line-mode)
#+end_src

