index.html

<div id="outline-container-orgaf2b0e9" class="outline-3">
<h3 id="orgaf2b0e9">ERC</h3>
<div class="outline-text-3" id="text-orgaf2b0e9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">erc</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> erc-autojoin-channels-alist '((<span style="color: #79a8ff;">"freenode.net"</span> <span style="color: #79a8ff;">"#emacs"</span>)))
  (<span style="color: #b6a0ff;">setq</span> erc-fill-column 80)
  (<span style="color: #b6a0ff;">setq</span> erc-hide-list '(<span style="color: #79a8ff;">"JOIN"</span> <span style="color: #79a8ff;">"PART"</span> <span style="color: #79a8ff;">"QUIT"</span>))
  (<span style="color: #b6a0ff;">setq</span> erc-input-line-position -2)
  (<span style="color: #b6a0ff;">setq</span> erc-keywords '(<span style="color: #79a8ff;">"knowayback"</span>))
  (<span style="color: #b6a0ff;">setq</span> erc-nick <span style="color: #79a8ff;">"knowayback"</span>)
  (<span style="color: #b6a0ff;">setq</span> erc-prompt-for-password t)
  (<span style="color: #b6a0ff;">setq</span> erc-track-enable-keybindings t))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1740e75" class="outline-3">
<h3 id="org1740e75">Eshell</h3>
<div class="outline-text-3" id="text-org1740e75">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">eshell</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-eshell-prompt</span> ()
    <span style="color: #9ac8e0;">"Custom eshell prompt."</span>
    (concat
     (propertize (user-login-name) 'face `(<span style="color: #f78fe7;">:foreground</span> <span style="color: #79a8ff;">"green"</span> ))
     (propertize <span style="color: #79a8ff;">"@"</span> 'face `(<span style="color: #f78fe7;">:foreground</span> <span style="color: #79a8ff;">"yellow"</span>))
     (propertize (system-name) `face `(<span style="color: #f78fe7;">:foreground</span> <span style="color: #79a8ff;">"green"</span>))
     (propertize <span style="color: #79a8ff;">":"</span> 'face `(<span style="color: #f78fe7;">:foreground</span> <span style="color: #79a8ff;">"yellow"</span>))
     (<span style="color: #b6a0ff;">if</span> (string= (eshell/pwd) (getenv <span style="color: #79a8ff;">"HOME"</span>))
         (propertize <span style="color: #79a8ff;">"~"</span> 'face `(<span style="color: #f78fe7;">:foreground</span> <span style="color: #79a8ff;">"magenta"</span>))
       (propertize (eshell/basename (eshell/pwd)) 'face `(<span style="color: #f78fe7;">:foreground</span> <span style="color: #79a8ff;">"magenta"</span>)))
     <span style="color: #79a8ff;">"\n"</span>
     (<span style="color: #b6a0ff;">if</span> (= (user-uid) 0)
         (propertize <span style="color: #79a8ff;">"#"</span> 'face `(<span style="color: #f78fe7;">:foreground</span> <span style="color: #79a8ff;">"red"</span>))
       (propertize <span style="color: #79a8ff;">"$"</span> 'face `(<span style="color: #f78fe7;">:foreground</span> <span style="color: #79a8ff;">"yellow"</span>)))
     (propertize <span style="color: #79a8ff;">" "</span> 'face `(<span style="color: #f78fe7;">:foreground</span> <span style="color: #79a8ff;">"white"</span>))))
  <span style="color: #989898;">;; </span><span style="color: #989898;">https://www.emacswiki.org/emacs/EshellPrompt</span>
  (<span style="color: #b6a0ff;">setq</span> eshell-cd-on-directory t
        eshell-destroy-buffer-when-process-dies t
        eshell-highlight-prompt nil
        eshell-hist-ignoredups t
        eshell-history-size 4096
        eshell-ls-use-colors t
        eshell-prefer-lisp-functions t
        eshell-prefer-lisp-variables t
        eshell-prompt-regexp <span style="color: #79a8ff;">"^[</span><span style="color: #ff5f59; font-weight: bold;">^</span><span style="color: #79a8ff;">#$\n]*[#$] "</span>
        eshell-prompt-function 'ts-eshell-prompt
        eshell-review-quick-commands nil
        eshell-save-history-on-exit t
        eshell-smart-space-goes-to-end t
        eshell-where-to-jump 'begin)
  (add-to-list 'eshell-modules-list 'eshell-tramp)
  <span style="color: #f78fe7;">:bind</span>
  (<span style="color: #79a8ff;">"C-c e"</span> . eshell)
  <span style="color: #f78fe7;">:hook</span>
  (eshell-preoutput-filter-functions . ansi-color-apply))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf30ddf3" class="outline-3">
<h3 id="orgf30ddf3">Flymake</h3>
<div class="outline-text-3" id="text-orgf30ddf3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'prog-mode-hook 'flymake-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd3cdca" class="outline-3">
<h3 id="orgbd3cdca">Flyspell</h3>
<div class="outline-text-3" id="text-orgbd3cdca">
<p>
Don't bother using this on Windows as I can rather be bothered to install
<a href="http://aspell.net/win32/">Aspell</a> for Windows.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">unless</span> (eq system-type 'windows-nt)
  (add-hook 'text-mode-hook 'flyspell-mode)
  (add-hook 'org-mode-hook 'flyspell-mode)
  (add-hook 'prog-mode-hook 'flyspell-prog-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9470d6e" class="outline-3">
<h3 id="org9470d6e">Gnus</h3>
<div class="outline-text-3" id="text-org9470d6e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">gnus</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> gnus-init-file <span style="color: #79a8ff;">"~/.emacs.d/init.el"</span>)
  (<span style="color: #b6a0ff;">setq</span> gnus-home-directory <span style="color: #79a8ff;">"~/.emacs.d/"</span>)
  (<span style="color: #b6a0ff;">setq</span> message-directory <span style="color: #79a8ff;">"~/.emacs.d/mail"</span>)
  (<span style="color: #b6a0ff;">setq</span> gnus-directory <span style="color: #79a8ff;">"~/.emacs.d/news"</span>)
  (<span style="color: #b6a0ff;">setq</span> nnfolder-directory <span style="color: #79a8ff;">"~/.emacs.d/mail/archive"</span>)
  (<span style="color: #b6a0ff;">setq</span> gnus-use-full-window nil)
  (<span style="color: #b6a0ff;">setq</span> gnus-select-method '(nntp <span style="color: #79a8ff;">"news.gwene.org"</span>))
  <span style="color: #989898;">;; </span><span style="color: #989898;">(setq gnus-secondary-select-methods '((nntp "news.gnus.org")))</span>
  (<span style="color: #b6a0ff;">setq</span> gnus-summary-thread-gathering-function 'gnus-gather-threads-by-subject)
  (<span style="color: #b6a0ff;">setq</span> gnus-thread-hide-subtree t)
  (<span style="color: #b6a0ff;">setq</span> gnus-thread-ignore-subject t)
  <span style="color: #f78fe7;">:commands</span> (gnus))
</pre>
</div>
</div>
</div>

<div id="outline-container-org895c8cb" class="outline-3">
<h3 id="org895c8cb">Hide/Show</h3>
<div class="outline-text-3" id="text-org895c8cb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'shell-script-mode-hook 'hs-minor-mode)
(add-hook 'prog-mode-hook 'hs-minor-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org77318dc" class="outline-3">
<h3 id="org77318dc">Highlight line</h3>
<div class="outline-text-3" id="text-org77318dc">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'dired-mode-hook 'hl-line-mode)
(add-hook 'org-mode-hook 'hl-line-mode)
(add-hook 'prog-mode-hook 'hl-line-mode)
(add-hook 'shell-script-mode-hook 'hl-line-mode)
(add-hook 'text-mode-hook 'hl-line-mode)
</pre>
</div>
</div>
</div>
