README.org
** Hippie Expand

#+begin_src emacs-lisp
  (defun ts-hippie-expand-completions (&optional hippie-expand-function)
    "Return the full list of completions generated by HIPPIE-EXPAND-FUNCTION.
  The optional argument can be generated with `make-hippie-expand-function'."
    (let ((this-command 'ts-hippie-expand-completions)
          (last-command last-command)
          (buffer-modified (buffer-modified-p))
          (hippie-expand-function (or hippie-expand-function 'hippie-expand)))
      (cl-flet ((ding)) ; avoid the (ding) when hippie-expand exhausts its options.
        (while (progn
                 (funcall hippie-expand-function nil)
                 (setq last-command 'ts-hippie-expand-completions)
                 (not (equal he-num -1)))))
      ;; Evaluating the completions modifies the buffer, however we will finish
      ;; up in the same state that we began.
      (set-buffer-modified-p buffer-modified)
      ;; Provide the options in the order in which they are normally generated.
      (delete he-search-string (reverse he-tried-table))))

  (defun ts-hippie-complete-with (hippie-expand-function)
    "Offer `completing-read' using the specified HIPPIE-EXPAND-FUNCTION."
    (let* ((options (ts-hippie-expand-completions hippie-expand-function))
           (selection (and options (completing-read "Completions: " options))))
      (if selection
          (he-substitute-string selection t)
        (message "No expansion found"))))

  (defun ts-hippie-expand-completing-read ()
    "Offer `completing-read' for the word at point."
    (interactive)
    (ts-hippie-complete-with 'hippie-expand))

  (global-set-key (kbd "M-/") 'hippie-expand)
  (global-set-key (kbd "C-M-/") 'ts-hippie-expand-completing-read)
#+end_src

** Icomplete

#+begin_src emacs-lisp
  (use-package icomplete
    :config
    (icomplete-vertical-mode)
    (setq icomplete-delay-completions-threshold 100)
    (setq icomplete-max-delay-chars 2)
    (setq icomplete-compute-delay 0.2)
    (setq icomplete-show-matches-on-no-input t)
    (setq icomplete-hide-common-prefix nil)
    (setq icomplete-prospects-height 1)
    (setq icomplete-separator (propertize " · " 'face 'shadow))
    (setq icomplete-with-completion-tables t)
    (setq icomplete-tidy-shadowed-file-names t)
    (setq icomplete-in-buffer t)
    (defun ts-icomplete-styles ()
      (setq-local completion-styles '(initials flex partial-completion substring basic)))
    :hook
    (after-init . fido-mode)
    (icomplete-minibuffer-setup . ts-icomplete-styles)
    :bind (:map icomplete-minibuffer-map
                ("C-j" . icomplete-fido-exit)
                ("M-j" . exit-minibuffer)
                ("C-n" . icomplete-forward-completions)
                ("C-p" . icomplete-backward-completions)
                ("C-s" . icomplete-forward-completions)
                ("C-r" . icomplete-backward-completions)
                ("<up>" . icomplete-backward-completions)
                ("<down>" . icomplete-forward-completions)
                ("<left>" . icomplete-backward-completions)
                ("<right>" . icomplete-forward-completions)))
#+end_src

** Imenu

#+begin_src emacs-lisp
  (use-package imenu
    :config
    (setq imenu-auto-rescan t)
    (setq imenu-auto-rescan-maxout 600000)
    (setq imenu-eager-completion-buffer t)
    (setq imenu-level-separator "/")
    (setq imenu-max-item-length 100)
    (setq imenu-space-replacement " ")
    (setq imenu-use-markers t)
    (setq imenu-use-popup-menu nil)
    :bind
    ("C-c i" . imenu))
#+end_src

** Line Numbers

#+begin_src emacs-lisp
  (setq display-line-numbers 'relative)
  (add-hook 'prog-mode-hook 'display-line-numbers-mode)
  (add-hook 'sh-script-hook 'display-line-numbers-mode)
#+end_src

** Minibuffer
*** Completion framework settings

#+begin_src emacs-lisp
  (setq completion-category-defaults nil)
  (setq completion-cycle-threshold 3)
  (setq completion-flex-nospace nil)
  (setq completion-ignore-case t)
  (setq completion-pcm-complete-word-inserts-delimiters t)
  (setq completion-pcm-word-delimiters "-_./:| ")
  (setq completion-show-help nil)
  (setq completions-detailed t)
  (setq completions-format 'one-column)
#+end_src

*** Misc Minibuffer settings

#+begin_src emacs-lisp
  (setq enable-recursive-minibuffers t)
  (setq file-name-shadow-mode 1)
  (setq minibuffer-depth-indicate-mode 1)
  (setq minibuffer-eldef-shorten-default t)
  (setq minibuffer-electric-default-mode 1)
  (setq read-answer-short t)
  (setq read-buffer-completion-ignore-case t)
  (setq read-file-name-completion-ignore-case t)
  (setq resize-mini-windows t)
#+end_src

*** Save history mode

#+begin_src emacs-lisp
  (use-package savehist
    :config
    (setq savehist-additional-variables '(kill-ring search-ring regexp-search-ring))
    (setq savehist-save-minibuffer-history 1)
    :hook (after-init . savehist-mode))
#+end_src

** Occur

#+begin_src emacs-lisp
  (add-hook 'occur-mode-hook 'hl-line-mode)
  (define-key occur-mode-map "t" 'toggle-truncate-lines)
#+end_src

