index.html

<div id="outline-container-org16b3925" class="outline-3">
<h3 id="org16b3925">Hippie Expand</h3>
<div class="outline-text-3" id="text-org16b3925">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-hippie-expand-completions</span> (<span style="color: #6ae4b9;">&amp;optional</span> hippie-expand-function)
  <span style="color: #9ac8e0;">"Return the full list of completions generated by HIPPIE-EXPAND-FUNCTION.</span>
<span style="color: #9ac8e0;">The optional argument can be generated with `</span><span style="color: #00bcff;">make-hippie-expand-function</span><span style="color: #9ac8e0;">'."</span>
  (<span style="color: #b6a0ff;">let</span> ((this-command 'ts-hippie-expand-completions)
        (last-command last-command)
        (buffer-modified (buffer-modified-p))
        (hippie-expand-function (<span style="color: #b6a0ff;">or</span> hippie-expand-function 'hippie-expand)))
    (<span style="color: #b6a0ff;">cl-flet</span> ((ding)) <span style="color: #989898;">; </span><span style="color: #989898;">avoid the (ding) when hippie-expand exhausts its options.</span>
      (<span style="color: #b6a0ff;">while</span> (<span style="color: #b6a0ff;">progn</span>
               (funcall hippie-expand-function nil)
               (<span style="color: #b6a0ff;">setq</span> last-command 'ts-hippie-expand-completions)
               (not (equal he-num -1)))))
    <span style="color: #989898;">;; </span><span style="color: #989898;">Evaluating the completions modifies the buffer, however we will finish</span>
    <span style="color: #989898;">;; </span><span style="color: #989898;">up in the same state that we began.</span>
    (set-buffer-modified-p buffer-modified)
    <span style="color: #989898;">;; </span><span style="color: #989898;">Provide the options in the order in which they are normally generated.</span>
    (delete he-search-string (reverse he-tried-table))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-hippie-complete-with</span> (hippie-expand-function)
  <span style="color: #9ac8e0;">"Offer `</span><span style="color: #00bcff;">completing-read</span><span style="color: #9ac8e0;">' using the specified HIPPIE-EXPAND-FUNCTION."</span>
  (<span style="color: #b6a0ff;">let*</span> ((options (ts-hippie-expand-completions hippie-expand-function))
         (selection (<span style="color: #b6a0ff;">and</span> options (completing-read <span style="color: #79a8ff;">"Completions: "</span> options))))
    (<span style="color: #b6a0ff;">if</span> selection
        (he-substitute-string selection t)
      (message <span style="color: #79a8ff;">"No expansion found"</span>))))

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-hippie-expand-completing-read</span> ()
  <span style="color: #9ac8e0;">"Offer `</span><span style="color: #00bcff;">completing-read</span><span style="color: #9ac8e0;">' for the word at point."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (ts-hippie-complete-with 'hippie-expand))

(global-set-key (kbd <span style="color: #79a8ff;">"M-/"</span>) 'hippie-expand)
(global-set-key (kbd <span style="color: #79a8ff;">"C-M-/"</span>) 'ts-hippie-expand-completing-read)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe1491c" class="outline-3">
<h3 id="orgbe1491c">Icomplete</h3>
<div class="outline-text-3" id="text-orgbe1491c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">icomplete</span>
  <span style="color: #f78fe7;">:config</span>
  (icomplete-vertical-mode)
  (<span style="color: #b6a0ff;">setq</span> icomplete-delay-completions-threshold 100)
  (<span style="color: #b6a0ff;">setq</span> icomplete-max-delay-chars 2)
  (<span style="color: #b6a0ff;">setq</span> icomplete-compute-delay 0.2)
  (<span style="color: #b6a0ff;">setq</span> icomplete-show-matches-on-no-input t)
  (<span style="color: #b6a0ff;">setq</span> icomplete-hide-common-prefix nil)
  (<span style="color: #b6a0ff;">setq</span> icomplete-prospects-height 1)
  (<span style="color: #b6a0ff;">setq</span> icomplete-separator (propertize <span style="color: #79a8ff;">" &#183; "</span> 'face 'shadow))
  (<span style="color: #b6a0ff;">setq</span> icomplete-with-completion-tables t)
  (<span style="color: #b6a0ff;">setq</span> icomplete-tidy-shadowed-file-names t)
  (<span style="color: #b6a0ff;">setq</span> icomplete-in-buffer t)
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-icomplete-styles</span> ()
    (<span style="color: #b6a0ff;">setq-local</span> completion-styles '(initials flex partial-completion substring basic)))
  <span style="color: #f78fe7;">:hook</span>
  (after-init . fido-mode)
  (icomplete-minibuffer-setup . ts-icomplete-styles)
  <span style="color: #f78fe7;">:bind</span> (<span style="color: #f78fe7;">:map</span> icomplete-minibuffer-map
              (<span style="color: #79a8ff;">"C-j"</span> . icomplete-fido-exit)
              (<span style="color: #79a8ff;">"M-j"</span> . exit-minibuffer)
              (<span style="color: #79a8ff;">"C-n"</span> . icomplete-forward-completions)
              (<span style="color: #79a8ff;">"C-p"</span> . icomplete-backward-completions)
              (<span style="color: #79a8ff;">"C-s"</span> . icomplete-forward-completions)
              (<span style="color: #79a8ff;">"C-r"</span> . icomplete-backward-completions)
              (<span style="color: #79a8ff;">"&lt;up&gt;"</span> . icomplete-backward-completions)
              (<span style="color: #79a8ff;">"&lt;down&gt;"</span> . icomplete-forward-completions)
              (<span style="color: #79a8ff;">"&lt;left&gt;"</span> . icomplete-backward-completions)
              (<span style="color: #79a8ff;">"&lt;right&gt;"</span> . icomplete-forward-completions)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org124d9f1" class="outline-3">
<h3 id="org124d9f1">Imenu</h3>
<div class="outline-text-3" id="text-org124d9f1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">imenu</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> imenu-auto-rescan t)
  (<span style="color: #b6a0ff;">setq</span> imenu-auto-rescan-maxout 600000)
  (<span style="color: #b6a0ff;">setq</span> imenu-eager-completion-buffer t)
  (<span style="color: #b6a0ff;">setq</span> imenu-level-separator <span style="color: #79a8ff;">"/"</span>)
  (<span style="color: #b6a0ff;">setq</span> imenu-max-item-length 100)
  (<span style="color: #b6a0ff;">setq</span> imenu-space-replacement <span style="color: #79a8ff;">" "</span>)
  (<span style="color: #b6a0ff;">setq</span> imenu-use-markers t)
  (<span style="color: #b6a0ff;">setq</span> imenu-use-popup-menu nil)
  <span style="color: #f78fe7;">:bind</span>
  (<span style="color: #79a8ff;">"C-c i"</span> . imenu))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9814664" class="outline-3">
<h3 id="org9814664">Line Numbers</h3>
<div class="outline-text-3" id="text-org9814664">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> display-line-numbers 'relative)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(add-hook 'sh-script-hook 'display-line-numbers-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org526c0a8" class="outline-3">
<h3 id="org526c0a8">Minibuffer</h3>
<div class="outline-text-3" id="text-org526c0a8">
</div>
<div id="outline-container-org498931b" class="outline-4">
<h4 id="org498931b">Completion framework settings</h4>
<div class="outline-text-4" id="text-org498931b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> completion-category-defaults nil)
(<span style="color: #b6a0ff;">setq</span> completion-cycle-threshold 3)
(<span style="color: #b6a0ff;">setq</span> completion-flex-nospace nil)
(<span style="color: #b6a0ff;">setq</span> completion-ignore-case t)
(<span style="color: #b6a0ff;">setq</span> completion-pcm-complete-word-inserts-delimiters t)
(<span style="color: #b6a0ff;">setq</span> completion-pcm-word-delimiters <span style="color: #79a8ff;">"-_./:| "</span>)
(<span style="color: #b6a0ff;">setq</span> completion-show-help nil)
(<span style="color: #b6a0ff;">setq</span> completions-detailed t)
(<span style="color: #b6a0ff;">setq</span> completions-format 'one-column)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6dc9561" class="outline-4">
<h4 id="org6dc9561">Misc Minibuffer settings</h4>
<div class="outline-text-4" id="text-org6dc9561">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> enable-recursive-minibuffers t)
(<span style="color: #b6a0ff;">setq</span> file-name-shadow-mode 1)
(<span style="color: #b6a0ff;">setq</span> minibuffer-depth-indicate-mode 1)
(<span style="color: #b6a0ff;">setq</span> minibuffer-eldef-shorten-default t)
(<span style="color: #b6a0ff;">setq</span> minibuffer-electric-default-mode 1)
(<span style="color: #b6a0ff;">setq</span> read-answer-short t)
(<span style="color: #b6a0ff;">setq</span> read-buffer-completion-ignore-case t)
(<span style="color: #b6a0ff;">setq</span> read-file-name-completion-ignore-case t)
(<span style="color: #b6a0ff;">setq</span> resize-mini-windows t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org60f8277" class="outline-4">
<h4 id="org60f8277">Save history mode</h4>
<div class="outline-text-4" id="text-org60f8277">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">savehist</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> savehist-additional-variables '(kill-ring search-ring regexp-search-ring))
  (<span style="color: #b6a0ff;">setq</span> savehist-save-minibuffer-history 1)
  <span style="color: #f78fe7;">:hook</span> (after-init . savehist-mode))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org001d3bf" class="outline-3">
<h3 id="org001d3bf">Occur</h3>
<div class="outline-text-3" id="text-org001d3bf">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'occur-mode-hook 'hl-line-mode)
(define-key occur-mode-map <span style="color: #79a8ff;">"t"</span> 'toggle-truncate-lines)
</pre>
</div>
</div>
</div>
