README.org
** Org

#+begin_src emacs-lisp
  (use-package org
    :config
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((awk . t)
       (C . t)
       (clojure . t)
       (css . t)
       (dot . t) ;; graphviz language
       (emacs-lisp . t)
       (gnuplot . t)
       (haskell . t)
       (java . t)
       (js . t)
       (latex . t)
       (lisp . t)
       (makefile . t)
       (ocaml . t)
       (perl . t)
       (python . t)
       (plantuml . t)
       (ruby . t)
       (scheme . t)
       (sed . t)
       (shell . t)
       (sql . t)
       (sqlite . t)))
    (setq org-capture-templates
          '(("t" "TODO Entry" entry (file+headline "~/org/todo.org" "Captured")
             "* TODO %?\n  %i\n  %a")
            ("j" "Journal Entry" entry (file+datetree "~/org/journal.org" "Captured")
             "* %?\nEntered on %U\n %i\n  %a")
            ("n" "Notes Entry" entry (file+datetree "~/org/notes.org" "Captured")
             "* %?\nEntered on %U\n %i\n  %a")))
    (setq org-latex-listings 'minted)
    (setq org-latex-pdf-process
          '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
            "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
            "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
    (add-to-list 'org-latex-packages-alist '("" "minted"))
    (setq org-startup-folded t) ; start in overview mode
    (setq org-directory "~/org")
    (setq org-agenda-files (file-expand-wildcards "~/org/*.org"))
    (setq org-default-notes-file "~/org/notes.org")
    (setq org-image-actual-width nil) ; try to get width from #+ATTR.* keyword
    (setf org-blank-before-new-entry '((heading . nil) (plain-list-item . nil)))
    (setq org-emphasis-regexp-components '(" \t('\"{" "- \t.,:!?;'\")}\\" " \t\r\n,\"'" "." 300))
    (setq org-confirm-babel-evaluate 'nil)
    (setq org-export-with-toc t)
    (setq org-indent-indentation-per-level 1)
    (setq org-list-allow-alphabetical t)
    (setq org-list-indent-offset 1)
    (setq org-return-follows-link t)
    (setq org-startup-indented t)
    (setq org-html-validation-link nil) ; don't add "validate" postamble
    (setq org-use-fast-todo-selection t)
    (setq org-goto-interface 'outline-path-completionp)
    (setq org-outline-path-complete-in-steps nil)
    (setq org-refile-use-outline-path 'file)
    (setq org-refile-allow-creating-parent-nodes 'confirm)
    (setq org-refile-targets '((nil :maxlevel . 9)))
    (setq org-special-ctrl-a/e 'reversed)
    (setq org-special-ctrl-k t)
    (setq org-special-ctrl-o t)
    (setq org-use-speed-commands t)
    (setq org-speed-commands-user '(("N" . org-down-element) ("P" . org-up-element)))
    (setq org-src-fontify-natively t)
    (setq org-src-tab-acts-natively t)
    (setq org-src-window-setup 'current-window)
    (setq org-structure-template-alist (append org-structure-template-alist
                                               '(("cl" . "src common-lisp")
                                                 ("el" . "src emacs-lisp")
                                                 ("go" . "src go")
                                                 ("ja" . "src java")
                                                 ("js" . "src javascript")
                                                 ("kr" . "src c")
                                                 ("py" . "src python")
                                                 ("sh" . "src shell")
                                                 ("sq" . "src sql")
                                                 ("tx" . "src text"))))
    :bind (:map org-mode-map ("C-c i" . org-goto))
    :hook (org-babel-post-tangle . emacs-lisp-byte-compile-and-load))
#+end_src

** Pending delete

#+begin_src emacs-lisp
  (add-hook 'after-init-hook 'pending-delete-mode 1) ;; remove selected region if typing
#+end_src

** Prettify Symbols

#+begin_src emacs-lisp
  (use-package prettify-symbols
    :config (setq prettify-symbols-unprettify-at-point 'right-edge)
    :hook (after-init . global-prettify-symbols-mode))
#+end_src

