index.html

<div id="outline-container-orgd1e72f0" class="outline-3">
<h3 id="orgd1e72f0">Org</h3>
<div class="outline-text-3" id="text-orgd1e72f0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">org</span>
  <span style="color: #f78fe7;">:config</span>
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((awk . t)
     (C . t)
     (clojure . t)
     (css . t)
     (dot . t) <span style="color: #989898;">;; </span><span style="color: #989898;">graphviz language</span>
     (emacs-lisp . t)
     (gnuplot . t)
     (haskell . t)
     (java . t)
     (js . t)
     (latex . t)
     (lisp . t)
     (makefile . t)
     (ocaml . t)
     (perl . t)
     (python . t)
     (plantuml . t)
     (ruby . t)
     (scheme . t)
     (sed . t)
     (shell . t)
     (sql . t)
     (sqlite . t)))
  (<span style="color: #b6a0ff;">setq</span> org-capture-templates
        '((<span style="color: #79a8ff;">"t"</span> <span style="color: #79a8ff;">"TODO Entry"</span> entry (file+headline <span style="color: #79a8ff;">"~/org/todo.org"</span> <span style="color: #79a8ff;">"Captured"</span>)
           <span style="color: #79a8ff;">"* TODO %?\n  %i\n  %a"</span>)
          (<span style="color: #79a8ff;">"j"</span> <span style="color: #79a8ff;">"Journal Entry"</span> entry (file+datetree <span style="color: #79a8ff;">"~/org/journal.org"</span> <span style="color: #79a8ff;">"Captured"</span>)
           <span style="color: #79a8ff;">"* %?\nEntered on %U\n %i\n  %a"</span>)
          (<span style="color: #79a8ff;">"n"</span> <span style="color: #79a8ff;">"Notes Entry"</span> entry (file+datetree <span style="color: #79a8ff;">"~/org/notes.org"</span> <span style="color: #79a8ff;">"Captured"</span>)
           <span style="color: #79a8ff;">"* %?\nEntered on %U\n %i\n  %a"</span>)))
  (<span style="color: #b6a0ff;">setq</span> org-latex-listings 'minted)
  (<span style="color: #b6a0ff;">setq</span> org-latex-pdf-process
        '(<span style="color: #79a8ff;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
          <span style="color: #79a8ff;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>
          <span style="color: #79a8ff;">"pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"</span>))
  (add-to-list 'org-latex-packages-alist '(<span style="color: #79a8ff;">""</span> <span style="color: #79a8ff;">"minted"</span>))
  (<span style="color: #b6a0ff;">setq</span> org-startup-folded t) <span style="color: #989898;">; </span><span style="color: #989898;">start in overview mode</span>
  (<span style="color: #b6a0ff;">setq</span> org-directory <span style="color: #79a8ff;">"~/org"</span>)
  (<span style="color: #b6a0ff;">setq</span> org-agenda-files (file-expand-wildcards <span style="color: #79a8ff;">"~/org/*.org"</span>))
  (<span style="color: #b6a0ff;">setq</span> org-default-notes-file <span style="color: #79a8ff;">"~/org/notes.org"</span>)
  (<span style="color: #b6a0ff;">setq</span> org-image-actual-width nil) <span style="color: #989898;">; </span><span style="color: #989898;">try to get width from #+ATTR.* keyword</span>
  (<span style="color: #b6a0ff;">setf</span> org-blank-before-new-entry '((heading . nil) (plain-list-item . nil)))
  (<span style="color: #b6a0ff;">setq</span> org-emphasis-regexp-components '(<span style="color: #79a8ff;">" \t('\"{"</span> <span style="color: #79a8ff;">"- \t.,:!?;'\")}\\"</span> <span style="color: #79a8ff;">" \t\r\n,\"'"</span> <span style="color: #79a8ff;">"."</span> 300))
  (<span style="color: #b6a0ff;">setq</span> org-confirm-babel-evaluate 'nil)
  (<span style="color: #b6a0ff;">setq</span> org-export-with-toc t)
  (<span style="color: #b6a0ff;">setq</span> org-indent-indentation-per-level 1)
  (<span style="color: #b6a0ff;">setq</span> org-list-allow-alphabetical t)
  (<span style="color: #b6a0ff;">setq</span> org-list-indent-offset 1)
  (<span style="color: #b6a0ff;">setq</span> org-return-follows-link t)
  (<span style="color: #b6a0ff;">setq</span> org-startup-indented t)
  (<span style="color: #b6a0ff;">setq</span> org-html-validation-link nil) <span style="color: #989898;">; </span><span style="color: #989898;">don't add "validate" postamble</span>
  (<span style="color: #b6a0ff;">setq</span> org-use-fast-todo-selection t)
  (<span style="color: #b6a0ff;">setq</span> org-goto-interface 'outline-path-completionp)
  (<span style="color: #b6a0ff;">setq</span> org-outline-path-complete-in-steps nil)
  (<span style="color: #b6a0ff;">setq</span> org-refile-use-outline-path 'file)
  (<span style="color: #b6a0ff;">setq</span> org-refile-allow-creating-parent-nodes 'confirm)
  (<span style="color: #b6a0ff;">setq</span> org-refile-targets '((nil <span style="color: #f78fe7;">:maxlevel</span> . 9)))
  (<span style="color: #b6a0ff;">setq</span> org-special-ctrl-a/e 'reversed)
  (<span style="color: #b6a0ff;">setq</span> org-special-ctrl-k t)
  (<span style="color: #b6a0ff;">setq</span> org-special-ctrl-o t)
  (<span style="color: #b6a0ff;">setq</span> org-use-speed-commands t)
  (<span style="color: #b6a0ff;">setq</span> org-speed-commands-user '((<span style="color: #79a8ff;">"N"</span> . org-down-element) (<span style="color: #79a8ff;">"P"</span> . org-up-element)))
  (<span style="color: #b6a0ff;">setq</span> org-src-fontify-natively t)
  (<span style="color: #b6a0ff;">setq</span> org-src-tab-acts-natively t)
  (<span style="color: #b6a0ff;">setq</span> org-src-window-setup 'current-window)
  (<span style="color: #b6a0ff;">setq</span> org-structure-template-alist (append org-structure-template-alist
                                             '((<span style="color: #79a8ff;">"cl"</span> . <span style="color: #79a8ff;">"src common-lisp"</span>)
                                               (<span style="color: #79a8ff;">"el"</span> . <span style="color: #79a8ff;">"src emacs-lisp"</span>)
                                               (<span style="color: #79a8ff;">"go"</span> . <span style="color: #79a8ff;">"src go"</span>)
                                               (<span style="color: #79a8ff;">"ja"</span> . <span style="color: #79a8ff;">"src java"</span>)
                                               (<span style="color: #79a8ff;">"js"</span> . <span style="color: #79a8ff;">"src javascript"</span>)
                                               (<span style="color: #79a8ff;">"kr"</span> . <span style="color: #79a8ff;">"src c"</span>)
                                               (<span style="color: #79a8ff;">"py"</span> . <span style="color: #79a8ff;">"src python"</span>)
                                               (<span style="color: #79a8ff;">"sh"</span> . <span style="color: #79a8ff;">"src shell"</span>)
                                               (<span style="color: #79a8ff;">"sq"</span> . <span style="color: #79a8ff;">"src sql"</span>)
                                               (<span style="color: #79a8ff;">"tx"</span> . <span style="color: #79a8ff;">"src text"</span>))))
  <span style="color: #f78fe7;">:bind</span> (<span style="color: #f78fe7;">:map</span> org-mode-map (<span style="color: #79a8ff;">"C-c i"</span> . org-goto))
  <span style="color: #f78fe7;">:hook</span> (org-babel-post-tangle . emacs-lisp-byte-compile-and-load))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a8fc14" class="outline-3">
<h3 id="org4a8fc14">Pending delete</h3>
<div class="outline-text-3" id="text-org4a8fc14">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'pending-delete-mode 1) <span style="color: #989898;">;; </span><span style="color: #989898;">remove selected region if typing</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org02e5d4a" class="outline-3">
<h3 id="org02e5d4a">Prettify Symbols</h3>
<div class="outline-text-3" id="text-org02e5d4a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">prettify-symbols</span>
  <span style="color: #f78fe7;">:config</span> (<span style="color: #b6a0ff;">setq</span> prettify-symbols-unprettify-at-point 'right-edge)
  <span style="color: #f78fe7;">:hook</span> (after-init . global-prettify-symbols-mode))
</pre>
</div>
</div>
</div>
