README.org
** Project

#+begin_src emacs-lisp
  (use-package project
    :config
    (setq ts-project-roots '("~"))
    (setq project-switch-commands
          '((?b "Buffer" project-switch-to-buffer)
            (?c "Compile" project-compile)
            (?d "Dired" project-dired)
            (?e "Eshell" project-eshell)
            (?f "File" project-find-file)
            (?g "Grep" project-find-regexp)
            (?q "Query replace" project-query-replace-regexp)
            (?r "Run command" project-async-shell-command)
            (?s "Search" project-search)
            (?v "VC dir" project-vc-dir)))

    (defun ts-project--git-repo-p (directory)
      "Return non-nil if there is a git repository in DIRECTORY."
      (and
       (file-directory-p (concat directory "/.git"))
       (file-directory-p (concat directory "/.git/info"))
       (file-directory-p (concat directory "/.git/objects"))
       (file-directory-p (concat directory "/.git/refs"))
       (file-regular-p (concat directory "/.git/HEAD"))))

    (defun ts-project--git-repos-recursive (directory maxdepth)
      "List git repos in under DIRECTORY recursively to MAXDEPTH."
      (let* ((git-repos '())
             (current-directory-list
              (directory-files directory t directory-files-no-dot-files-regexp)))
        ;; while we are in the current directory
        (if (ts-project--git-repo-p directory)
            (setq git-repos (cons (file-truename (expand-file-name directory)) git-repos)))
        (while current-directory-list
          (let ((f (car current-directory-list)))
            (cond ((and (file-directory-p f)
                        (file-readable-p f)
                        (> maxdepth 0)
                        (not (ts-project--git-repo-p f)))
                   (setq git-repos
                         (append git-repos
                                 (ts-project--git-repos-recursive f (- maxdepth 1)))))
                  ((ts-project--git-repo-p f)
                   (setq git-repos (cons
                                    (file-truename (expand-file-name f)) git-repos))))
            (setq current-directory-list (cdr current-directory-list))))
        (delete-dups git-repos)))

    (defun ts-project--list-projects ()
      "Produce list of projects in `ts-project-roots'."
      (let ((cands (delete-dups (mapcan (lambda (directory)
                                          (ts-project--git-repos-recursive
                                           (expand-file-name directory)
                                           10))
                                        ts-project-roots))))
        ;; needs to be a list of lists
        (mapcar (lambda (d)
                  (list (abbreviate-file-name d)))
                cands)))

    (defun ts-project-update-projects ()
      "Overwrite `project--list' using `ts-project--list-projects'.
        WARNING: This will destroy & replace the contents of `project-list-file'."
      (interactive)
      (autoload 'project--ensure-read-project-list "project" nil t)
      (project--ensure-read-project-list)
      (setq project--list (ts-project--list-projects))
      (project--write-project-list)
      (message "Updated project list in %s" project-list-file))

    :bind
    ("C-x pu" . ts-project-update-projects))
#+end_src

** Python

#+begin_src emacs-lisp
  (use-package python :config (setq python-fill-docstring-style 'django))
#+end_src

** Recentf

#+begin_src emacs-lisp
  (use-package recentf
    :config
    (setq recentf-exclude '(".gz"
                            ".xz"
                            ".zip"
                            "/elpa/"
                            "/ssh:"
                            "/sudo:"
                            "^/var/folders\\.*"
                            "COMMIT_EDITMSG\\'"
                            ".*-autoloads\\.el\\'"
                            "[/\\]\\.elpa/"))
    (setq recentf-max-menu-items 128)
    (setq recentf-max-saved-items 256)
    (defun ts--recentf-get-paths ()
      "Return de-duplicated and abbreviated `recentf-list'."
      (delete-dups (mapcar 'abbreviate-file-name recentf-list)))
    (defun ts-recentf-find-file ()
      "`find-file' using `recentf-list'."
      (interactive)
      (find-file (completing-read "Find file: " (ts--recentf-get-paths))))
    (defun ts-recentf-find-file-other-window ()
      "`find-file' using `recentf-list'."
      (interactive)
      (find-file-other-window
       (completing-read "Find file in other window: " (ts--recentf-get-paths))))
    (defun ts-recentf-find-file-other-frame ()
      "`find-file' using `recentf-list'."
      (interactive)
      (find-file-other-frame
       (completing-read "Find file in other frame: " (ts--recentf-get-paths))))
    :bind
    ("C-c r" . ts-recentf-find-file)
    ("C-c 4 r" . ts-recentf-find-file-other-window)
    ("C-c 5 r" . ts-recentf-find-file-other-frame)
    ("C-c C-r" . recentf-open-files)
    :hook
    (after-init . recentf-mode))
#+end_src

** Saveplace

#+begin_src emacs-lisp
  (use-package save-place
    :config (setq save-place-file (concat user-emacs-directory "saveplace.el"))
    :hook (after-init . save-place-mode))
#+end_src

