index.html

<div id="outline-container-orgd241b26" class="outline-3">
<h3 id="orgd241b26">Project</h3>
<div class="outline-text-3" id="text-orgd241b26">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">project</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> ts-project-roots '(<span style="color: #79a8ff;">"~"</span>))
  (<span style="color: #b6a0ff;">setq</span> project-switch-commands
        '((?b <span style="color: #79a8ff;">"Buffer"</span> project-switch-to-buffer)
          (?c <span style="color: #79a8ff;">"Compile"</span> project-compile)
          (?d <span style="color: #79a8ff;">"Dired"</span> project-dired)
          (?e <span style="color: #79a8ff;">"Eshell"</span> project-eshell)
          (?f <span style="color: #79a8ff;">"File"</span> project-find-file)
          (?g <span style="color: #79a8ff;">"Grep"</span> project-find-regexp)
          (?q <span style="color: #79a8ff;">"Query replace"</span> project-query-replace-regexp)
          (?r <span style="color: #79a8ff;">"Run command"</span> project-async-shell-command)
          (?s <span style="color: #79a8ff;">"Search"</span> project-search)
          (?v <span style="color: #79a8ff;">"VC dir"</span> project-vc-dir)))

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-project--git-repo-p</span> (directory)
    <span style="color: #9ac8e0;">"Return non-nil if there is a git repository in DIRECTORY."</span>
    (<span style="color: #b6a0ff;">and</span>
     (file-directory-p (concat directory <span style="color: #79a8ff;">"/.git"</span>))
     (file-directory-p (concat directory <span style="color: #79a8ff;">"/.git/info"</span>))
     (file-directory-p (concat directory <span style="color: #79a8ff;">"/.git/objects"</span>))
     (file-directory-p (concat directory <span style="color: #79a8ff;">"/.git/refs"</span>))
     (file-regular-p (concat directory <span style="color: #79a8ff;">"/.git/HEAD"</span>))))

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-project--git-repos-recursive</span> (directory maxdepth)
    <span style="color: #9ac8e0;">"List git repos in under DIRECTORY recursively to MAXDEPTH."</span>
    (<span style="color: #b6a0ff;">let*</span> ((git-repos '())
           (current-directory-list
            (directory-files directory t directory-files-no-dot-files-regexp)))
      <span style="color: #989898;">;; </span><span style="color: #989898;">while we are in the current directory</span>
      (<span style="color: #b6a0ff;">if</span> (ts-project--git-repo-p directory)
          (<span style="color: #b6a0ff;">setq</span> git-repos (cons (file-truename (expand-file-name directory)) git-repos)))
      (<span style="color: #b6a0ff;">while</span> current-directory-list
        (<span style="color: #b6a0ff;">let</span> ((f (car current-directory-list)))
          (<span style="color: #b6a0ff;">cond</span> ((<span style="color: #b6a0ff;">and</span> (file-directory-p f)
                      (file-readable-p f)
                      (&gt; maxdepth 0)
                      (not (ts-project--git-repo-p f)))
                 (<span style="color: #b6a0ff;">setq</span> git-repos
                       (append git-repos
                               (ts-project--git-repos-recursive f (- maxdepth 1)))))
                ((ts-project--git-repo-p f)
                 (<span style="color: #b6a0ff;">setq</span> git-repos (cons
                                  (file-truename (expand-file-name f)) git-repos))))
          (<span style="color: #b6a0ff;">setq</span> current-directory-list (cdr current-directory-list))))
      (delete-dups git-repos)))

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-project--list-projects</span> ()
    <span style="color: #9ac8e0;">"Produce list of projects in `</span><span style="color: #00bcff;">ts-project-roots</span><span style="color: #9ac8e0;">'."</span>
    (<span style="color: #b6a0ff;">let</span> ((cands (delete-dups (mapcan (<span style="color: #b6a0ff;">lambda</span> (directory)
                                        (ts-project--git-repos-recursive
                                         (expand-file-name directory)
                                         10))
                                      ts-project-roots))))
      <span style="color: #989898;">;; </span><span style="color: #989898;">needs to be a list of lists</span>
      (mapcar (<span style="color: #b6a0ff;">lambda</span> (d)
                (list (abbreviate-file-name d)))
              cands)))

  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-project-update-projects</span> ()
    <span style="color: #9ac8e0;">"Overwrite `</span><span style="color: #00bcff;">project--list</span><span style="color: #9ac8e0;">' using `</span><span style="color: #00bcff;">ts-project--list-projects</span><span style="color: #9ac8e0;">'.</span>
<span style="color: #9ac8e0;">      WARNING: This will destroy &amp; replace the contents of `</span><span style="color: #00bcff;">project-list-file</span><span style="color: #9ac8e0;">'."</span>
    (<span style="color: #b6a0ff;">interactive</span>)
    (autoload 'project--ensure-read-project-list <span style="color: #79a8ff;">"project"</span> nil t)
    (project--ensure-read-project-list)
    (<span style="color: #b6a0ff;">setq</span> project--list (ts-project--list-projects))
    (project--write-project-list)
    (message <span style="color: #79a8ff;">"Updated project list in %s"</span> project-list-file))

  <span style="color: #f78fe7;">:bind</span>
  (<span style="color: #79a8ff;">"C-x pu"</span> . ts-project-update-projects))
</pre>
</div>
</div>
</div>

<div id="outline-container-org47e5cc3" class="outline-3">
<h3 id="org47e5cc3">Python</h3>
<div class="outline-text-3" id="text-org47e5cc3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">python</span> <span style="color: #f78fe7;">:config</span> (<span style="color: #b6a0ff;">setq</span> python-fill-docstring-style 'django))
</pre>
</div>
</div>
</div>

<div id="outline-container-org821bdee" class="outline-3">
<h3 id="org821bdee">Recentf</h3>
<div class="outline-text-3" id="text-org821bdee">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">recentf</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> recentf-exclude '(<span style="color: #79a8ff;">".gz"</span>
                          <span style="color: #79a8ff;">".xz"</span>
                          <span style="color: #79a8ff;">".zip"</span>
                          <span style="color: #79a8ff;">"/elpa/"</span>
                          <span style="color: #79a8ff;">"/ssh:"</span>
                          <span style="color: #79a8ff;">"/sudo:"</span>
                          <span style="color: #79a8ff;">"^/var/folders\\.*"</span>
                          <span style="color: #79a8ff;">"COMMIT_EDITMSG\\'"</span>
                          <span style="color: #79a8ff;">".*-autoloads\\.el\\'"</span>
                          <span style="color: #79a8ff;">"[/\\]\\.elpa/"</span>))
  (<span style="color: #b6a0ff;">setq</span> recentf-max-menu-items 128)
  (<span style="color: #b6a0ff;">setq</span> recentf-max-saved-items 256)
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts--recentf-get-paths</span> ()
    <span style="color: #9ac8e0;">"Return de-duplicated and abbreviated `</span><span style="color: #00bcff;">recentf-list</span><span style="color: #9ac8e0;">'."</span>
    (delete-dups (mapcar 'abbreviate-file-name recentf-list)))
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-recentf-find-file</span> ()
    <span style="color: #9ac8e0;">"`</span><span style="color: #00bcff;">find-file</span><span style="color: #9ac8e0;">' using `</span><span style="color: #00bcff;">recentf-list</span><span style="color: #9ac8e0;">'."</span>
    (<span style="color: #b6a0ff;">interactive</span>)
    (find-file (completing-read <span style="color: #79a8ff;">"Find file: "</span> (ts--recentf-get-paths))))
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-recentf-find-file-other-window</span> ()
    <span style="color: #9ac8e0;">"`</span><span style="color: #00bcff;">find-file</span><span style="color: #9ac8e0;">' using `</span><span style="color: #00bcff;">recentf-list</span><span style="color: #9ac8e0;">'."</span>
    (<span style="color: #b6a0ff;">interactive</span>)
    (find-file-other-window
     (completing-read <span style="color: #79a8ff;">"Find file in other window: "</span> (ts--recentf-get-paths))))
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-recentf-find-file-other-frame</span> ()
    <span style="color: #9ac8e0;">"`</span><span style="color: #00bcff;">find-file</span><span style="color: #9ac8e0;">' using `</span><span style="color: #00bcff;">recentf-list</span><span style="color: #9ac8e0;">'."</span>
    (<span style="color: #b6a0ff;">interactive</span>)
    (find-file-other-frame
     (completing-read <span style="color: #79a8ff;">"Find file in other frame: "</span> (ts--recentf-get-paths))))
  <span style="color: #f78fe7;">:bind</span>
  (<span style="color: #79a8ff;">"C-c r"</span> . ts-recentf-find-file)
  (<span style="color: #79a8ff;">"C-c 4 r"</span> . ts-recentf-find-file-other-window)
  (<span style="color: #79a8ff;">"C-c 5 r"</span> . ts-recentf-find-file-other-frame)
  (<span style="color: #79a8ff;">"C-c C-r"</span> . recentf-open-files)
  <span style="color: #f78fe7;">:hook</span>
  (after-init . recentf-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf2d743f" class="outline-3">
<h3 id="orgf2d743f">Saveplace</h3>
<div class="outline-text-3" id="text-orgf2d743f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">save-place</span>
  <span style="color: #f78fe7;">:config</span> (<span style="color: #b6a0ff;">setq</span> save-place-file (concat user-emacs-directory <span style="color: #79a8ff;">"saveplace.el"</span>))
  <span style="color: #f78fe7;">:hook</span> (after-init . save-place-mode))
</pre>
</div>
</div>
</div>
