README.org
** Semantic

#+begin_src emacs-lisp
  (add-hook 'prog-mode-hook 'semantic-mode)
  ;; https://github.com/abo-abo/lispy/issues/473
  (advice-add 'semantic-idle-scheduler-function :around #'ignore)
#+end_src

** Shell Script

#+begin_src emacs-lisp
  (setq auto-mode-alist (append auto-mode-alist
                                '(("\\.sh\\'" . shell-script-mode)
                                  ("\\.bash.*\\'" . shell-script-mode)
                                  ("\\.zsh.*\\'" . shell-script-mode)
                                  ("\\.aliases\\'" . shell-script-mode)
                                  ("\\.functions\\'" . shell-script-mode)
                                  ("\\bashrc\\'" . shell-script-mode)
                                  ("\\kshrc\\'" . shell-script-mode)
                                  ("\\profile\\'" . shell-script-mode)
                                  ("\\zshenv\\'" . shell-script-mode)
                                  ("\\zprompt\\'" . shell-script-mode)
                                  ("\\zshrc\\'" . shell-script-mode)
                                  ("\\prompt_.*_setup\\'" . shell-script-mode))))

  (setq interpreter-mode-alist (append interpreter-mode-alist
                                       '(("bash" . shell-script-mode)
                                         ("ksh" . shell-script-mode)
                                         ("sh" . shell-script-mode)
                                         ("zsh" . shell-script-mode))))

  (with-eval-after-load 'sh-script
    (add-hook 'after-save-hook 'executable-make-buffer-file-executable-if-script-p)
    (message "Lazy loaded shell-script-mode :-)"))
#+end_src

** Show paren

#+begin_src emacs-lisp
  (use-package paren
    :config
    (setq show-paren-when-point-in-periphery t)
    (setq show-paren-when-point-inside-paren t)
    :hook (after-init . show-paren-mode))
#+end_src

** Size Indication

#+begin_src emacs-lisp :tangle no
  (add-hook 'after-init-hook 'size-indication-mode)
#+end_src

** Subword

#+begin_src emacs-lisp
  (add-hook 'after-init-hook 'global-subword-mode) ;; move by camel case, etc
#+end_src

** Term
*** ANSI Term launcher

#+begin_src emacs-lisp
  (defun ts-ansi-term ()
    "Opens shell from $SHELL environmental variable in `ansi-term'."
    (interactive)
    ;; https://emacs.stackexchange.com/a/48481
    (let ((switch-to-buffer-obey-display-actions))
      (ansi-term (getenv "SHELL"))))

  (global-set-key (kbd "C-c tt") 'ts-ansi-term)

  (defun ts-ansi-term-other-window ()
    "Opens default $SHELL `ansi-term' in another window."
    (interactive)
    (split-window-sensibly)
    (other-window 1)
    (ts-ansi-term))

  (global-set-key (kbd "C-c 4 tt") 'ts-ansi-term-other-window)
#+end_src

*** Set term coding system to UTF-8

#+begin_src emacs-lisp
  (add-hook 'term-exec (lambda () (set-process-coding-system 'utf-8-unix 'utf-8-unix)))
#+end_src

*** Switch to ANSI Term

#+begin_src emacs-lisp
  (defun ts-switch-to-ansi-term ()
    "Open an `ansi-term' if it doesn't already exist.
  Otherwise switch to current one."
    (interactive)
    (if (get-buffer "*ansi-term*")
        (switch-to-buffer "*ansi-term*")
      (ansi-term (getenv "SHELL"))))

  (global-set-key (kbd "C-c ts") 'ts-switch-to-ansi-term)

  (defun ts-switch-to-ansi-term-other-window()
    "Does what it states on the tin!"
    (interactive)
    (split-window-sensibly)
    (other-window 1)
    (ts-switch-to-ansi-term))

  (global-set-key (kbd "C-c 4 ts") 'ts-switch-to-ansi-term-other-window)
#+end_src

*** Term Advise

#+begin_src emacs-lisp
  (with-eval-after-load 'term
    (defadvice term-handle-exit (after term-kill-buffer-on-exit activate)
      "Kill term when shell exits."
      (kill-buffer))
    (setq term-buffer-maximum-size 200000)
    (message "Lazy loaded term :-)"))
#+end_src

** Time

#+begin_src emacs-lisp :tangle no
  (with-eval-after-load 'time
    (setq display-time-format "%H:%M %d/%m")
    (setq display-time-default-load-average 'nil))
  (add-hook 'after-init-hook 'display-time-mode)
#+end_src

** Tramp

#+begin_src emacs-lisp
  (with-eval-after-load 'tramp
    (setq tramp-backup-directory-alist backup-directory-alist)
    (setq tramp-default-method "ssh")
    (setf tramp-persistency-file-name (concat temporary-file-directory "tramp-" (user-login-name)))
    (message "Lazy loaded tramp :-)"))
#+end_src

** Version Control

[[https://protesilaos.com/dotemacs/#h:31deeff4-dfae-48d9-a906-1f3272f29bc9][Protesilaos Stavrou's VC reference]]

#+begin_src emacs-lisp
  (use-package vc
    :config
    (setq vc-follow-symlinks t)
    (setq vc-make-backup-files t)
    (setq version-control t)
    :bind ("C-x v d" . vc-dir-root))
#+end_src

** View mode

Provide pager-like keybindings. Makes navigating read-only buffers a breeze.
Move down and up with SPC and delete (backspace) or S-SPC, half a page down and
up with d and u, and isearch with s.

Prolific emacser Omar Antolin Camarena points out a built-in way to use
view-mode in all read-only buffers, including ones you set read-only with C-x
C-q.

#+begin_src emacs-lisp
  (setq view-read-only t)
#+end_src

