index.html

<div id="outline-container-org1e1f317" class="outline-3">
<h3 id="org1e1f317">Semantic</h3>
<div class="outline-text-3" id="text-org1e1f317">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'prog-mode-hook 'semantic-mode)
<span style="color: #989898;">;; </span><span style="color: #989898;">https://github.com/abo-abo/lispy/issues/473</span>
(advice-add 'semantic-idle-scheduler-function <span style="color: #f78fe7;">:around</span> #'ignore)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd64c995" class="outline-3">
<h3 id="orgd64c995">Shell Script</h3>
<div class="outline-text-3" id="text-orgd64c995">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> auto-mode-alist (append auto-mode-alist
                              '((<span style="color: #79a8ff;">"\\.sh\\'"</span> . shell-script-mode)
                                (<span style="color: #79a8ff;">"\\.bash.*\\'"</span> . shell-script-mode)
                                (<span style="color: #79a8ff;">"\\.zsh.*\\'"</span> . shell-script-mode)
                                (<span style="color: #79a8ff;">"\\.aliases\\'"</span> . shell-script-mode)
                                (<span style="color: #79a8ff;">"\\.functions\\'"</span> . shell-script-mode)
                                (<span style="color: #79a8ff;">"\\bashrc\\'"</span> . shell-script-mode)
                                (<span style="color: #79a8ff;">"\\kshrc\\'"</span> . shell-script-mode)
                                (<span style="color: #79a8ff;">"\\profile\\'"</span> . shell-script-mode)
                                (<span style="color: #79a8ff;">"\\zshenv\\'"</span> . shell-script-mode)
                                (<span style="color: #79a8ff;">"\\zprompt\\'"</span> . shell-script-mode)
                                (<span style="color: #79a8ff;">"\\zshrc\\'"</span> . shell-script-mode)
                                (<span style="color: #79a8ff;">"\\prompt_.*_setup\\'"</span> . shell-script-mode))))

(<span style="color: #b6a0ff;">setq</span> interpreter-mode-alist (append interpreter-mode-alist
                                     '((<span style="color: #79a8ff;">"bash"</span> . shell-script-mode)
                                       (<span style="color: #79a8ff;">"ksh"</span> . shell-script-mode)
                                       (<span style="color: #79a8ff;">"sh"</span> . shell-script-mode)
                                       (<span style="color: #79a8ff;">"zsh"</span> . shell-script-mode))))

(<span style="color: #b6a0ff;">with-eval-after-load</span> 'sh-script
  (add-hook 'after-save-hook 'executable-make-buffer-file-executable-if-script-p)
  (message <span style="color: #79a8ff;">"Lazy loaded shell-script-mode :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4643a12" class="outline-3">
<h3 id="org4643a12">Show paren</h3>
<div class="outline-text-3" id="text-org4643a12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">paren</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> show-paren-when-point-in-periphery t)
  (<span style="color: #b6a0ff;">setq</span> show-paren-when-point-inside-paren t)
  <span style="color: #f78fe7;">:hook</span> (after-init . show-paren-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc2d10ff" class="outline-3">
<h3 id="orgc2d10ff">Size Indication</h3>
<div class="outline-text-3" id="text-orgc2d10ff">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'size-indication-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd77d97" class="outline-3">
<h3 id="orgcd77d97">Subword</h3>
<div class="outline-text-3" id="text-orgcd77d97">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'after-init-hook 'global-subword-mode) <span style="color: #989898;">;; </span><span style="color: #989898;">move by camel case, etc</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6bdae8d" class="outline-3">
<h3 id="org6bdae8d">Term</h3>
<div class="outline-text-3" id="text-org6bdae8d">
</div>
<div id="outline-container-org80ff630" class="outline-4">
<h4 id="org80ff630">ANSI Term launcher</h4>
<div class="outline-text-4" id="text-org80ff630">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-ansi-term</span> ()
  <span style="color: #9ac8e0;">"Opens shell from $SHELL environmental variable in `</span><span style="color: #00bcff;">ansi-term</span><span style="color: #9ac8e0;">'."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  <span style="color: #989898;">;; </span><span style="color: #989898;">https://emacs.stackexchange.com/a/48481</span>
  (<span style="color: #b6a0ff;">let</span> ((switch-to-buffer-obey-display-actions))
    (ansi-term (getenv <span style="color: #79a8ff;">"SHELL"</span>))))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c tt"</span>) 'ts-ansi-term)

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-ansi-term-other-window</span> ()
  <span style="color: #9ac8e0;">"Opens default $SHELL `</span><span style="color: #00bcff;">ansi-term</span><span style="color: #9ac8e0;">' in another window."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (split-window-sensibly)
  (other-window 1)
  (ts-ansi-term))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c 4 tt"</span>) 'ts-ansi-term-other-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc7ef225" class="outline-4">
<h4 id="orgc7ef225">Set term coding system to UTF-8</h4>
<div class="outline-text-4" id="text-orgc7ef225">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'term-exec (<span style="color: #b6a0ff;">lambda</span> () (set-process-coding-system 'utf-8-unix 'utf-8-unix)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf2559eb" class="outline-4">
<h4 id="orgf2559eb">Switch to ANSI Term</h4>
<div class="outline-text-4" id="text-orgf2559eb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-switch-to-ansi-term</span> ()
  <span style="color: #9ac8e0;">"Open an `</span><span style="color: #00bcff;">ansi-term</span><span style="color: #9ac8e0;">' if it doesn't already exist.</span>
<span style="color: #9ac8e0;">Otherwise switch to current one."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">if</span> (get-buffer <span style="color: #79a8ff;">"*ansi-term*"</span>)
      (switch-to-buffer <span style="color: #79a8ff;">"*ansi-term*"</span>)
    (ansi-term (getenv <span style="color: #79a8ff;">"SHELL"</span>))))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c ts"</span>) 'ts-switch-to-ansi-term)

(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-switch-to-ansi-term-other-window</span>()
  <span style="color: #9ac8e0;">"Does what it states on the tin!"</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (split-window-sensibly)
  (other-window 1)
  (ts-switch-to-ansi-term))

(global-set-key (kbd <span style="color: #79a8ff;">"C-c 4 ts"</span>) 'ts-switch-to-ansi-term-other-window)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd28b364" class="outline-4">
<h4 id="orgd28b364">Term Advise</h4>
<div class="outline-text-4" id="text-orgd28b364">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">with-eval-after-load</span> 'term
  (<span style="color: #b6a0ff;">defadvice</span> <span style="color: #feacd0;">term-handle-exit</span> (after term-kill-buffer-on-exit activate)
    <span style="color: #9ac8e0;">"Kill term when shell exits."</span>
    (kill-buffer))
  (<span style="color: #b6a0ff;">setq</span> term-buffer-maximum-size 200000)
  (message <span style="color: #79a8ff;">"Lazy loaded term :-)"</span>))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd4cbe00" class="outline-3">
<h3 id="orgd4cbe00">Tramp</h3>
<div class="outline-text-3" id="text-orgd4cbe00">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">with-eval-after-load</span> 'tramp
  (<span style="color: #b6a0ff;">setq</span> tramp-backup-directory-alist backup-directory-alist)
  (<span style="color: #b6a0ff;">setq</span> tramp-default-method <span style="color: #79a8ff;">"ssh"</span>)
  (<span style="color: #b6a0ff;">setf</span> tramp-persistency-file-name (concat temporary-file-directory <span style="color: #79a8ff;">"tramp-"</span> (user-login-name)))
  (message <span style="color: #79a8ff;">"Lazy loaded tramp :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf6498f3" class="outline-3">
<h3 id="orgf6498f3">Version Control</h3>
<div class="outline-text-3" id="text-orgf6498f3">
<p>
<a href="https://protesilaos.com/dotemacs/#h:31deeff4-dfae-48d9-a906-1f3272f29bc9">Protesilaos Stavrou's VC reference</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">vc</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> vc-follow-symlinks t)
  (<span style="color: #b6a0ff;">setq</span> vc-make-backup-files t)
  (<span style="color: #b6a0ff;">setq</span> version-control t)
  <span style="color: #f78fe7;">:bind</span> (<span style="color: #79a8ff;">"C-x v d"</span> . vc-dir-root))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9808e1a" class="outline-3">
<h3 id="org9808e1a">View mode</h3>
<div class="outline-text-3" id="text-org9808e1a">
<p>
Provide pager-like keybindings. Makes navigating read-only buffers a breeze.
Move down and up with SPC and delete (backspace) or S-SPC, half a page down and
up with d and u, and isearch with s.
</p>

<p>
Prolific emacser Omar Antolin Camarena points out a built-in way to use
view-mode in all read-only buffers, including ones you set read-only with C-x
C-q.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> view-read-only t)
</pre>
</div>
</div>
</div>
