README.org
** Whitespace

#+begin_src emacs-lisp
  (use-package whitespace
    :config
    (setq whitespace-line-column 120)
    (setq whitespace-style '(face
                             tabs
                             spaces
                             trailing
                             lines
                             space-before-tab::space
                             newline
                             indentation::space
                             empty
                             space-after-tab::space
                             space-mark
                             tab-mark
                             newline-mark)
          whitespace-face 'whitespace-trailing)
    :bind ("C-c M-w" . whitespace-mode)
    :hook (before-save . whitespace-cleanup))
#+end_src

** Windmove

#+begin_src emacs-lisp
  (global-set-key (kbd "C-c w b") 'windmove-left)
  (global-set-key (kbd "C-c w f") 'windmove-right)
  (global-set-key (kbd "C-c w p") 'windmove-up)
  (global-set-key (kbd "C-c w n") 'windmove-down)

  (global-set-key (kbd "C-c w C-b") 'windmove-swap-states-left)
  (global-set-key (kbd "C-c w C-f") 'windmove-swap-states-right)
  (global-set-key (kbd "C-c w C-p") 'windmove-swap-states-up)
  (global-set-key (kbd "C-c w C-n") 'windmove-swap-states-down)

  (with-eval-after-load 'windmove
    (setq windmove-wrap-around t)
    (message "Lazy loaded windmove :-)"))
#+end_src

** Window Divider

#+begin_src emacs-lisp
  (setq window-divider-default-right-width 1)
  (setq window-divider-default-bottom-width 1)
  (setq window-divider-default-places 'right-only)
  (add-hook 'window-setup-hook 'window-divider-mode)
#+end_src

** Winner mode

[[https://www.gnu.org/software/emacs/manual/html_node/elisp/Startup-Summary.html#Startup-Summary][Startup Summary]]

#+begin_src emacs-lisp
  (add-hook 'window-setup-hook 'winner-mode)
  (global-set-key (kbd "C-c w u") 'winner-undo)
  (global-set-key (kbd "C-c w r") 'winner-redo)
#+end_src

* MELPA Packages

I like to split up my "vanilla" Emacs configuration and custom functions from
the customisations provided by third party libraries.

If you want to go for a more vanilla setup, just prefix the ~COMMENT~ keyword
to the tile above, and re-tangle the file.

This way it makes it very easy to run a semi-stock Emacs without ~package.el~
or any third party libraries, but still have some saner defaults and some extra
functionality.

** Ansible

#+begin_src emacs-lisp
  (use-package ansible :ensure :hook (yaml-mode . ansible))
#+end_src

#+begin_src emacs-lisp
  (use-package ansible-doc :ensure :hook (yaml-mode . ansible-doc-mode))
#+end_src

** Async

#+begin_src emacs-lisp
  (use-package async :ensure :defer 5
    :commands (async-byte-compile-file
               async-bytecomp-package-mode)
    :init
    (unless (equal system-type 'windows-nt)
      (setq async-bytecomp-allowed-packages '(all)))
    :config
    (if (equal system-type 'windows-nt)
        (async-bytecomp-package-mode -1)
      (async-bytecomp-package-mode 1))
    :hook (dired-mode-hook . dired-async-mode))
#+end_src

** Blacken

#+begin_src emacs-lisp
  (use-package blacken :ensure :hook (python-mode . blacken-mode))
#+end_src

** Default Text Scale

Increase or decrease font size everywhere with ~C-M-=~ and ~C-M--~

https://github.com/purcell/default-text-scale

#+begin_src emacs-lisp
  (use-package default-text-scale :ensure :defer 7 :config (default-text-scale-mode))
#+end_src

** Diminish

#+begin_src emacs-lisp
  (use-package diminish :ensure :defer 2
    :diminish abbrev-mode
    :diminish auto-fill-function ;; wtf?!
    :diminish eldoc-mode
    :diminish hs-minor-mode
    :diminish highlight-changes-mode
    :diminish ts-key-mode
    :diminish org-indent-mode
    :diminish org-src-mode
    :diminish subword-mode
    :hook
    (org-indent-mode . (lambda () (diminish 'org-indent-mode)))
    (hs-minor-mode . (lambda () (diminish 'hs-minor-mode))))
#+end_src

** Docker

#+begin_src emacs-lisp
  (use-package dockerfile-mode :ensure)
#+end_src

** Exec path from shell

Don't tangle this block if ~system-type~ is ~windows-nt~.

#+begin_src emacs-lisp :tangle (if (eq system-type 'windows-nt) "no" init-file)
  (use-package exec-path-from-shell :ensure :defer 10
    :unless (eq system-type 'windows-nt)
    :commands exec-path-from-shell-initialize
    :init
    (setq exec-path-from-shell-check-startup-files 'nil)
    :config
    (exec-path-from-shell-initialize)
    (exec-path-from-shell-copy-env "DEVPATH")
    (exec-path-from-shell-copy-env "PYTHONPATH"))
#+end_src

** Flycheck

#+begin_src emacs-lisp :tangle (if (eq system-type 'windows-nt) "no" init-file)
  (use-package flycheck :ensure
    :unless (eq system-type 'windows-nt)
    :diminish flycheck-mode
    :config
    (flycheck-add-mode 'javascript-eslint 'web-mode)
    :hook
    (prog-mode . flycheck-mode)
    (shell-script-mode . flycheck-mode))
#+end_src

** Git
