index.html

<div id="outline-container-org7bd778f" class="outline-3">
<h3 id="org7bd778f">Whitespace</h3>
<div class="outline-text-3" id="text-org7bd778f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">whitespace</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> whitespace-line-column 120)
  (<span style="color: #b6a0ff;">setq</span> whitespace-style '(face
                           tabs
                           spaces
                           trailing
                           lines
                           space-before-tab::space
                           newline
                           indentation::space
                           empty
                           space-after-tab::space
                           space-mark
                           tab-mark
                           newline-mark)
        whitespace-face 'whitespace-trailing)
  <span style="color: #f78fe7;">:bind</span> (<span style="color: #79a8ff;">"C-c M-w"</span> . whitespace-mode)
  <span style="color: #f78fe7;">:hook</span> (before-save . whitespace-cleanup))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7bf6432" class="outline-3">
<h3 id="org7bf6432">Windmove</h3>
<div class="outline-text-3" id="text-org7bf6432">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #79a8ff;">"C-c w b"</span>) 'windmove-left)
(global-set-key (kbd <span style="color: #79a8ff;">"C-c w f"</span>) 'windmove-right)
(global-set-key (kbd <span style="color: #79a8ff;">"C-c w p"</span>) 'windmove-up)
(global-set-key (kbd <span style="color: #79a8ff;">"C-c w n"</span>) 'windmove-down)

(global-set-key (kbd <span style="color: #79a8ff;">"C-c w C-b"</span>) 'windmove-swap-states-left)
(global-set-key (kbd <span style="color: #79a8ff;">"C-c w C-f"</span>) 'windmove-swap-states-right)
(global-set-key (kbd <span style="color: #79a8ff;">"C-c w C-p"</span>) 'windmove-swap-states-up)
(global-set-key (kbd <span style="color: #79a8ff;">"C-c w C-n"</span>) 'windmove-swap-states-down)

(<span style="color: #b6a0ff;">with-eval-after-load</span> 'windmove
  (<span style="color: #b6a0ff;">setq</span> windmove-wrap-around t)
  (message <span style="color: #79a8ff;">"Lazy loaded windmove :-)"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3721702" class="outline-3">
<h3 id="org3721702">Window Divider</h3>
<div class="outline-text-3" id="text-org3721702">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">setq</span> window-divider-default-right-width 1)
(<span style="color: #b6a0ff;">setq</span> window-divider-default-bottom-width 1)
(<span style="color: #b6a0ff;">setq</span> window-divider-default-places 'right-only)
(add-hook 'window-setup-hook 'window-divider-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f98d89" class="outline-3">
<h3 id="org5f98d89">Winner mode</h3>
<div class="outline-text-3" id="text-org5f98d89">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Startup-Summary.html#Startup-Summary">Startup Summary</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'window-setup-hook 'winner-mode)
(global-set-key (kbd <span style="color: #79a8ff;">"C-c w u"</span>) 'winner-undo)
(global-set-key (kbd <span style="color: #79a8ff;">"C-c w r"</span>) 'winner-redo)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org24cab38" class="outline-2">
<h2 id="org24cab38">MELPA Packages</h2>
<div class="outline-text-2" id="text-org24cab38">
<p>
I like to split up my "vanilla" Emacs configuration and custom functions from
the customisations provided by third party libraries.
</p>

<p>
If you want to go for a more vanilla setup, just prefix the <code>COMMENT</code> keyword
to the tile above, and re-tangle the file.
</p>

<p>
This way it makes it very easy to run a semi-stock Emacs without <code>package.el</code>
or any third party libraries, but still have some saner defaults and some extra
functionality.
</p>
</div>

<div id="outline-container-orgd660674" class="outline-3">
<h3 id="orgd660674">Ansible</h3>
<div class="outline-text-3" id="text-orgd660674">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">ansible</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:hook</span> (yaml-mode . ansible))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">ansible-doc</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:hook</span> (yaml-mode . ansible-doc-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org683768b" class="outline-3">
<h3 id="org683768b">Async</h3>
<div class="outline-text-3" id="text-org683768b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">async</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:defer</span> 5
  <span style="color: #f78fe7;">:commands</span> (async-byte-compile-file
             async-bytecomp-package-mode)
  <span style="color: #f78fe7;">:init</span>
  (<span style="color: #b6a0ff;">unless</span> (equal system-type 'windows-nt)
    (<span style="color: #b6a0ff;">setq</span> async-bytecomp-allowed-packages '(all)))
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">if</span> (equal system-type 'windows-nt)
      (async-bytecomp-package-mode -1)
    (async-bytecomp-package-mode 1))
  <span style="color: #f78fe7;">:hook</span> (dired-mode-hook . dired-async-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2da1c9f" class="outline-3">
<h3 id="org2da1c9f">Blacken</h3>
<div class="outline-text-3" id="text-org2da1c9f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">blacken</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:hook</span> (python-mode . blacken-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4dc9ce0" class="outline-3">
<h3 id="org4dc9ce0">Default Text Scale</h3>
<div class="outline-text-3" id="text-org4dc9ce0">
<p>
Increase or decrease font size everywhere with <code>C-M-=</code> and <code>C-M--</code>
</p>

<p>
<a href="https://github.com/purcell/default-text-scale">https://github.com/purcell/default-text-scale</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">default-text-scale</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:defer</span> 7 <span style="color: #f78fe7;">:config</span> (default-text-scale-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org623530a" class="outline-3">
<h3 id="org623530a">Diminish</h3>
<div class="outline-text-3" id="text-org623530a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">diminish</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:defer</span> 2
  <span style="color: #f78fe7;">:diminish</span> abbrev-mode
  <span style="color: #f78fe7;">:diminish</span> auto-fill-function <span style="color: #989898;">;; </span><span style="color: #989898;">wtf?!</span>
  <span style="color: #f78fe7;">:diminish</span> eldoc-mode
  <span style="color: #f78fe7;">:diminish</span> hs-minor-mode
  <span style="color: #f78fe7;">:diminish</span> highlight-changes-mode
  <span style="color: #f78fe7;">:diminish</span> ts-key-mode
  <span style="color: #f78fe7;">:diminish</span> org-indent-mode
  <span style="color: #f78fe7;">:diminish</span> org-src-mode
  <span style="color: #f78fe7;">:diminish</span> subword-mode
  <span style="color: #f78fe7;">:hook</span>
  (org-indent-mode . (<span style="color: #b6a0ff;">lambda</span> () (diminish 'org-indent-mode)))
  (hs-minor-mode . (<span style="color: #b6a0ff;">lambda</span> () (diminish 'hs-minor-mode))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2d23a6" class="outline-3">
<h3 id="orge2d23a6">Docker</h3>
<div class="outline-text-3" id="text-orge2d23a6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">dockerfile-mode</span> <span style="color: #f78fe7;">:ensure</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8439bb6" class="outline-3">
<h3 id="org8439bb6">Exec path from shell</h3>
<div class="outline-text-3" id="text-org8439bb6">
<p>
Don't tangle this block if <code>system-type</code> is <code>windows-nt</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">exec-path-from-shell</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:defer</span> 10
  <span style="color: #f78fe7;">:unless</span> (eq system-type 'windows-nt)
  <span style="color: #f78fe7;">:commands</span> exec-path-from-shell-initialize
  <span style="color: #f78fe7;">:init</span>
  (<span style="color: #b6a0ff;">setq</span> exec-path-from-shell-check-startup-files 'nil)
  <span style="color: #f78fe7;">:config</span>
  (exec-path-from-shell-initialize)
  (exec-path-from-shell-copy-env <span style="color: #79a8ff;">"DEVPATH"</span>)
  (exec-path-from-shell-copy-env <span style="color: #79a8ff;">"PYTHONPATH"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org72ed58d" class="outline-3">
<h3 id="org72ed58d">Flycheck</h3>
<div class="outline-text-3" id="text-org72ed58d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">flycheck</span> <span style="color: #f78fe7;">:ensure</span>
  <span style="color: #f78fe7;">:unless</span> (eq system-type 'windows-nt)
  <span style="color: #f78fe7;">:diminish</span> flycheck-mode
  <span style="color: #f78fe7;">:config</span>
  (flycheck-add-mode 'javascript-eslint 'web-mode)
  <span style="color: #f78fe7;">:hook</span>
  (prog-mode . flycheck-mode)
  (shell-script-mode . flycheck-mode))
</pre>
</div>
</div>
</div>
