README.org
*** Gitlab CI

#+begin_src emacs-lisp
  (use-package gitlab-ci-mode :ensure
    :mode
    "\\.gitlab-ci.yaml\\'"
    "\\.gitlab-ci.yml\\'"
    :hook
    (yaml-mode . hs-minor-mode))
#+end_src

*** Git Timemachine

#+begin_src emacs-lisp
  (use-package git-timemachine :ensure)
#+end_src

*** Magit

#+begin_src emacs-lisp
  (use-package magit :ensure
    :bind*
    ("C-x g" . magit-status)
    :config
    (when (eq system-type 'windows-nt)
      (if (file-readable-p "C:/Program Files/Git/bin/git.exe")
          (setq magit-git-executable "C:/Program Files/Git/bin/git.exe"))
      (when (file-directory-p "C:/Program Files/Git/bin")
        (setq exec-path (add-to-list 'exec-path "C:/Program Files/Git/bin"))
        (setenv "PATH" (concat "C:\\Program Files\\Git\\bin;" (getenv "PATH")))))
    (setq magit-clone-set-remote.pushDefault t)
    (setq magit-completing-read-function 'magit-builtin-completing-read))
#+end_src

#+begin_src emacs-lisp
  (use-package magit-repos
    :bind* ("C-x C-g" . magit-list-repositories)
    :config
    (setq magit-repository-directories `(("~/" . 0)
                                         ("~/src" . 10)
                                         ("~/oe-developers" . 10)))
    (setq magit-repolist-columns
          '(("Flag" 5 magit-repolist-column-flags ((:right-align t) nil))
            ("Name" 20 magit-repolist-column-ident nil)
            ("Branch" 10 magit-repolist-column-branch nil)
            ;; ("Version" 25 magit-repolist-column-version nil)
            ("Pull" 5 magit-repolist-column-unpulled-from-upstream ((:right-align t) nil))
            ("Push" 5 magit-repolist-column-unpushed-to-upstream ((:right-align t) nil))
            ;; ("Pull" 5 magit-repolist-column-unpulled-from-pushremote ((:right-align t) nil))
            ;; ("Push" 5 magit-repolist-column-unpushed-to-pushremote ((:right-align t) nil))
            ("Path" 99 magit-repolist-column-path nil)))
    (setq magit-repolist-sort-key '("Flag" . t)))
#+end_src

** Go mode

#+begin_src emacs-lisp
  (use-package go-mode :ensure
    :config
    (defun ts-go-indent ()
      (setq indent-tabs-mode 1)
      (setq tab-width 2))
    :hook
    (go-mode . ts-go-indent)
    (before-save . gofmt-before-save))
#+end_src

** Hungry delete

#+begin_src emacs-lisp
  (use-package hungry-delete :ensure :defer 6 :config (global-hungry-delete-mode))
#+end_src

** JSON

#+begin_src emacs-lisp
  (use-package json-mode :ensure
    :config
    (defun ts-json-mode-setup ()
      (json-mode)
      (json-pretty-print (point-min) (point-max))
      (goto-char (point-min))
      (set-buffer-modified-p nil))
    (add-to-list 'auto-mode-alist
                 '("\\.json\\'" . 'ts-json-mode-setup)))
#+end_src

** Markdown

#+begin_src emacs-lisp
  (use-package markdown-mode :ensure
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . gfm-mode)
           ("\\.markdown\\'" . gfm-mode))
    :init (setq markdown-command "multimarkdown"))
#+end_src

** Org
*** htmlize

#+begin_src emacs-lisp
  (use-package htmlize :ensure)
#+end_src

** Powershell

#+begin_src emacs-lisp
  (use-package powershell :ensure :mode (("\\.ps1\\'" . powershell-mode)))
#+end_src

** Restclient

#+begin_src emacs-lisp
  (use-package restclient :ensure)
#+end_src

** systemd

Don't tangle this block if ~system-type~ is ~windows-nt~.

#+begin_src emacs-lisp :tangle (if (eq system-type 'windows-nt) "no" init-file)
  (use-package systemd :ensure :unless (equal system-type 'windows-nt))
#+end_src

** Terraform

#+begin_src emacs-lisp
  (use-package terraform-mode :ensure)
#+end_src

** Trashed

#+begin_src emacs-lisp
  (use-package trashed :ensure :bind ("C-c f t" . trashed))
#+end_src

