index.html

<div id="outline-container-orga0f583c" class="outline-3">
<h3 id="orga0f583c">Git</h3>
<div class="outline-text-3" id="text-orga0f583c">
</div>
<div id="outline-container-orgcd28249" class="outline-4">
<h4 id="orgcd28249">Gitlab CI</h4>
<div class="outline-text-4" id="text-orgcd28249">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">gitlab-ci-mode</span> <span style="color: #f78fe7;">:ensure</span>
  <span style="color: #f78fe7;">:mode</span>
  <span style="color: #79a8ff;">"\\.gitlab-ci.yaml\\'"</span>
  <span style="color: #79a8ff;">"\\.gitlab-ci.yml\\'"</span>
  <span style="color: #f78fe7;">:hook</span>
  (yaml-mode . hs-minor-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f35aff" class="outline-4">
<h4 id="org7f35aff">Git Timemachine</h4>
<div class="outline-text-4" id="text-org7f35aff">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">git-timemachine</span> <span style="color: #f78fe7;">:ensure</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org01b4505" class="outline-4">
<h4 id="org01b4505">Magit</h4>
<div class="outline-text-4" id="text-org01b4505">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">magit</span> <span style="color: #f78fe7;">:ensure</span>
  <span style="color: #f78fe7;">:bind*</span>
  (<span style="color: #79a8ff;">"C-x g"</span> . magit-status)
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">when</span> (eq system-type 'windows-nt)
    (<span style="color: #b6a0ff;">if</span> (file-readable-p <span style="color: #79a8ff;">"C:/Program Files/Git/bin/git.exe"</span>)
        (<span style="color: #b6a0ff;">setq</span> magit-git-executable <span style="color: #79a8ff;">"C:/Program Files/Git/bin/git.exe"</span>))
    (<span style="color: #b6a0ff;">when</span> (file-directory-p <span style="color: #79a8ff;">"C:/Program Files/Git/bin"</span>)
      (<span style="color: #b6a0ff;">setq</span> exec-path (add-to-list 'exec-path <span style="color: #79a8ff;">"C:/Program Files/Git/bin"</span>))
      (setenv <span style="color: #79a8ff;">"PATH"</span> (concat <span style="color: #79a8ff;">"C:\\Program Files\\Git\\bin;"</span> (getenv <span style="color: #79a8ff;">"PATH"</span>)))))
  (<span style="color: #b6a0ff;">setq</span> magit-clone-set-remote.pushDefault t)
  (<span style="color: #b6a0ff;">setq</span> magit-completing-read-function 'magit-builtin-completing-read))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">magit-repos</span>
  <span style="color: #f78fe7;">:bind*</span> (<span style="color: #79a8ff;">"C-x C-g"</span> . magit-list-repositories)
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> magit-repository-directories `((<span style="color: #79a8ff;">"~/"</span> . 0)
                                       (<span style="color: #79a8ff;">"~/src"</span> . 10)
                                       (<span style="color: #79a8ff;">"~/oe-developers"</span> . 10)))
  (<span style="color: #b6a0ff;">setq</span> magit-repolist-columns
        '((<span style="color: #79a8ff;">"Flag"</span> 5 magit-repolist-column-flags ((<span style="color: #f78fe7;">:right-align</span> t) nil))
          (<span style="color: #79a8ff;">"Name"</span> 20 magit-repolist-column-ident nil)
          (<span style="color: #79a8ff;">"Branch"</span> 10 magit-repolist-column-branch nil)
          <span style="color: #989898;">;; </span><span style="color: #989898;">("Version" 25 magit-repolist-column-version nil)</span>
          (<span style="color: #79a8ff;">"Pull"</span> 5 magit-repolist-column-unpulled-from-upstream ((<span style="color: #f78fe7;">:right-align</span> t) nil))
          (<span style="color: #79a8ff;">"Push"</span> 5 magit-repolist-column-unpushed-to-upstream ((<span style="color: #f78fe7;">:right-align</span> t) nil))
          <span style="color: #989898;">;; </span><span style="color: #989898;">("Pull" 5 magit-repolist-column-unpulled-from-pushremote ((:right-align t) nil))</span>
          <span style="color: #989898;">;; </span><span style="color: #989898;">("Push" 5 magit-repolist-column-unpushed-to-pushremote ((:right-align t) nil))</span>
          (<span style="color: #79a8ff;">"Path"</span> 99 magit-repolist-column-path nil)))
  (<span style="color: #b6a0ff;">setq</span> magit-repolist-sort-key '(<span style="color: #79a8ff;">"Flag"</span> . t)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org45f64f0" class="outline-3">
<h3 id="org45f64f0">Go mode</h3>
<div class="outline-text-3" id="text-org45f64f0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">go-mode</span> <span style="color: #f78fe7;">:ensure</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-go-indent</span> ()
    (<span style="color: #b6a0ff;">setq</span> indent-tabs-mode 1)
    (<span style="color: #b6a0ff;">setq</span> tab-width 2))
  <span style="color: #f78fe7;">:hook</span>
  (go-mode . ts-go-indent)
  (before-save . gofmt-before-save))
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a663a0" class="outline-3">
<h3 id="org0a663a0">Hungry delete</h3>
<div class="outline-text-3" id="text-org0a663a0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">hungry-delete</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:defer</span> 6 <span style="color: #f78fe7;">:config</span> (global-hungry-delete-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2d71d4" class="outline-3">
<h3 id="orga2d71d4">JSON</h3>
<div class="outline-text-3" id="text-orga2d71d4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">json-mode</span> <span style="color: #f78fe7;">:ensure</span>
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">ts-json-mode-setup</span> ()
    (json-mode)
    (json-pretty-print (point-min) (point-max))
    (goto-char (point-min))
    (set-buffer-modified-p nil))
  (add-to-list 'auto-mode-alist
               '(<span style="color: #79a8ff;">"\\.json\\'"</span> . 'ts-json-mode-setup)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org25f9367" class="outline-3">
<h3 id="org25f9367">Markdown</h3>
<div class="outline-text-3" id="text-org25f9367">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">markdown-mode</span> <span style="color: #f78fe7;">:ensure</span>
  <span style="color: #f78fe7;">:commands</span> (markdown-mode gfm-mode)
  <span style="color: #f78fe7;">:mode</span> ((<span style="color: #79a8ff;">"README\\.md\\'"</span> . gfm-mode)
         (<span style="color: #79a8ff;">"\\.md\\'"</span> . gfm-mode)
         (<span style="color: #79a8ff;">"\\.markdown\\'"</span> . gfm-mode))
  <span style="color: #f78fe7;">:init</span> (<span style="color: #b6a0ff;">setq</span> markdown-command <span style="color: #79a8ff;">"multimarkdown"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d2b158" class="outline-3">
<h3 id="org5d2b158">Org</h3>
<div class="outline-text-3" id="text-org5d2b158">
</div>
<div id="outline-container-orgdab49d2" class="outline-4">
<h4 id="orgdab49d2">htmlize</h4>
<div class="outline-text-4" id="text-orgdab49d2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">htmlize</span> <span style="color: #f78fe7;">:ensure</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org08fe245" class="outline-3">
<h3 id="org08fe245">Powershell</h3>
<div class="outline-text-3" id="text-org08fe245">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">powershell</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:mode</span> ((<span style="color: #79a8ff;">"\\.ps1\\'"</span> . powershell-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f41226" class="outline-3">
<h3 id="org8f41226">Restclient</h3>
<div class="outline-text-3" id="text-org8f41226">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">restclient</span> <span style="color: #f78fe7;">:ensure</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a28cbc" class="outline-3">
<h3 id="org0a28cbc">systemd</h3>
<div class="outline-text-3" id="text-org0a28cbc">
<p>
Don't tangle this block if <code>system-type</code> is <code>windows-nt</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">systemd</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:unless</span> (equal system-type 'windows-nt))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4201457" class="outline-3">
<h3 id="org4201457">Terraform</h3>
<div class="outline-text-3" id="text-org4201457">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">terraform-mode</span> <span style="color: #f78fe7;">:ensure</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org535df81" class="outline-3">
<h3 id="org535df81">Trashed</h3>
<div class="outline-text-3" id="text-org535df81">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">trashed</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:bind</span> (<span style="color: #79a8ff;">"C-c f t"</span> . trashed))
</pre>
</div>
</div>
</div>
