README.org
** Web Mode

#+begin_src emacs-lisp
  (use-package web-mode :ensure
    :mode
    "\\.phtml\\'"
    "\\.tpl\\.php\\'"
    "\\.[agj]sp\\'"
    "\\.as[cp]x\\'"
    "\\.erb\\'"
    "\\.mustache\\'"
    "\\.djhtml\\'"
    "\\.html\\.twig\\'"
    "\\.html?\\'"
    "\\.php?\\'"
    "\\.css?\\'"
    :hook
    (web-mode . js2-minor-mode)
    :config
    (setq web-mode-content-type "jsx"
          web-mode-enable-auto-quoting nil
          web-mode-code-indent-offset 2
          web-mode-markup-indent-offset 2
          web-mode-attr-indent-offset 2
          web-mode-css-indent-offset 2
          web-mode-code-indent-offset 2
          web-mode-enable-auto-pairing t
          web-mode-enable-css-colorization t
          web-mode-enable-block-face t
          web-mode-enable-part-face t
          web-mode-enable-comment-keywords t)
    (add-to-list 'web-mode-indentation-params '("lineup-args" . nil))
    (add-to-list 'web-mode-indentation-params '("lineup-calls" . nil))
    (add-to-list 'web-mode-indentation-params '("lineup-concats" . nil))
    (add-to-list 'web-mode-indentation-params '("lineup-ternary" . nil)))
#+end_src

** Which Key

#+begin_src emacs-lisp
  (use-package which-key :ensure :defer 5 :config (which-key-mode))
#+end_src

** Writeable Grep

#+begin_src emacs-lisp
  (use-package wgrep :ensure :commands wgrep
    :bind (:map grep-mode-map
                ("e" . wgrep-change-to-wgrep-mode)
                ("C-x C-q" . wgrep-change-to-wgrep-mode)))
#+end_src

** YAML

#+begin_src emacs-lisp
  (use-package highlight-indentation :ensure)
#+end_src

#+begin_src emacs-lisp
  (use-package yaml-mode :ensure
    :hook
    (yaml-mode . highlight-indentation-mode)
    (yaml-mode . hs-minor-mode)
    (yaml-mode . display-line-numbers-mode))
#+end_src

** Yasnippet

#+begin_src emacs-lisp
  (use-package yasnippet :ensure :hook (prog-mode . yas-minor-mode))
#+end_src

#+begin_src emacs-lisp
  (use-package yasnippet-classic-snippets :ensure)
#+end_src

#+begin_src emacs-lisp
  (use-package yasnippet-snippets :ensure)
#+end_src

* COMMENT Local Variables                                  :NOEXPORT:ARCHIVE:
# Local Variables:
# eval: (setq org-confirm-babel-evaluate 'nil)
# eval: (setq init-file (expand-file-name "init.el" user-emacs-directory))
# eval: (setq early-init (expand-file-name "early-init.el" user-emacs-directory))
# eval: (add-hook 'after-save-hook 'org-babel-tangle nil t)
# End:
