index.html

<div id="outline-container-org06f4d08" class="outline-3">
<h3 id="org06f4d08">Web Mode</h3>
<div class="outline-text-3" id="text-org06f4d08">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">web-mode</span> <span style="color: #f78fe7;">:ensure</span>
  <span style="color: #f78fe7;">:mode</span>
  <span style="color: #79a8ff;">"\\.phtml\\'"</span>
  <span style="color: #79a8ff;">"\\.tpl\\.php\\'"</span>
  <span style="color: #79a8ff;">"\\.[agj]sp\\'"</span>
  <span style="color: #79a8ff;">"\\.as[cp]x\\'"</span>
  <span style="color: #79a8ff;">"\\.erb\\'"</span>
  <span style="color: #79a8ff;">"\\.mustache\\'"</span>
  <span style="color: #79a8ff;">"\\.djhtml\\'"</span>
  <span style="color: #79a8ff;">"\\.html\\.twig\\'"</span>
  <span style="color: #79a8ff;">"\\.html?\\'"</span>
  <span style="color: #79a8ff;">"\\.php?\\'"</span>
  <span style="color: #79a8ff;">"\\.css?\\'"</span>
  <span style="color: #f78fe7;">:hook</span>
  (web-mode . js2-minor-mode)
  <span style="color: #f78fe7;">:config</span>
  (<span style="color: #b6a0ff;">setq</span> web-mode-content-type <span style="color: #79a8ff;">"jsx"</span>
        web-mode-enable-auto-quoting nil
        web-mode-code-indent-offset 2
        web-mode-markup-indent-offset 2
        web-mode-attr-indent-offset 2
        web-mode-css-indent-offset 2
        web-mode-code-indent-offset 2
        web-mode-enable-auto-pairing t
        web-mode-enable-css-colorization t
        web-mode-enable-block-face t
        web-mode-enable-part-face t
        web-mode-enable-comment-keywords t)
  (add-to-list 'web-mode-indentation-params '(<span style="color: #79a8ff;">"lineup-args"</span> . nil))
  (add-to-list 'web-mode-indentation-params '(<span style="color: #79a8ff;">"lineup-calls"</span> . nil))
  (add-to-list 'web-mode-indentation-params '(<span style="color: #79a8ff;">"lineup-concats"</span> . nil))
  (add-to-list 'web-mode-indentation-params '(<span style="color: #79a8ff;">"lineup-ternary"</span> . nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf85224b" class="outline-3">
<h3 id="orgf85224b">Which Key</h3>
<div class="outline-text-3" id="text-orgf85224b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">which-key</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:defer</span> 5 <span style="color: #f78fe7;">:config</span> (which-key-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa1ef37" class="outline-3">
<h3 id="orgaa1ef37">Writeable Grep</h3>
<div class="outline-text-3" id="text-orgaa1ef37">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">wgrep</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:commands</span> wgrep
  <span style="color: #f78fe7;">:bind</span> (<span style="color: #f78fe7;">:map</span> grep-mode-map
              (<span style="color: #79a8ff;">"e"</span> . wgrep-change-to-wgrep-mode)
              (<span style="color: #79a8ff;">"C-x C-q"</span> . wgrep-change-to-wgrep-mode)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb937cd4" class="outline-3">
<h3 id="orgb937cd4">YAML</h3>
<div class="outline-text-3" id="text-orgb937cd4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">highlight-indentation</span> <span style="color: #f78fe7;">:ensure</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">yaml-mode</span> <span style="color: #f78fe7;">:ensure</span>
  <span style="color: #f78fe7;">:hook</span>
  (yaml-mode . highlight-indentation-mode)
  (yaml-mode . hs-minor-mode)
  (yaml-mode . display-line-numbers-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org990eb2b" class="outline-3">
<h3 id="org990eb2b">Yasnippet</h3>
<div class="outline-text-3" id="text-org990eb2b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">yasnippet</span> <span style="color: #f78fe7;">:ensure</span> <span style="color: #f78fe7;">:hook</span> (prog-mode . yas-minor-mode))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">yasnippet-classic-snippets</span> <span style="color: #f78fe7;">:ensure</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">use-package</span> <span style="color: #00bcff;">yasnippet-snippets</span> <span style="color: #f78fe7;">:ensure</span>)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Slight</p>
<p class="date">Created: 2023-01-29 Sun 23:06</p>
</div>
</body>
</html>